[{

"212": "Kirsten Larson is one of the three initial dolls released by Pleasant Company in 1986 and is the only original doll themed in the 19th century. In the Kirsten books, she and her immediate family immigrate to the United States from Sweden and move to her uncle’s farm in Minnesota. Kirsten’s books take a liberal approach to the issue of colonization, as Kirsten’s family and other settlers are painted in the most positive light possible while still attempting to acknowledge the mistreatment of the indigenous community. As a character, Kirsten is very shy and uncomfortable around unfamiliar people and places. I related to her the most out of the original three dolls as a child. While Kirsten is a complex character that means a lot to me, it’s impossible not to associate her with the tragedies in her books that traumatized me as a child. I will not go into detail because the tragedies are common triggering topics but if you want to find out what I’m referring to, you can look on the American Girl Wiki at your own discression. My first Kirsten doll was purchased right before she was discontinued at the end of 2009. I was in my Little House on the Prairie phase at the time and I became obsessed with her hoop braids. Being the spoiled child I was, for Christmas that year I got Kirsten as well as my first Kit doll because American Girl wasn’t sure Kirsten would come in time. I absolutely love my first Kirsten doll and she’s definitely in my all time top 5.<br><br>&nbsp&nbsp&nbsp I did not need a second Kirsten doll. She was rereleased for the 35th anniversary in 2021 and I probably should not have bought her. But I did and she is absolutely gorgeous. She looks the same as my first Kirsten doll did when I opened her as a child. Her shoes are a slightly different shade of brown and the spoon from her accessories is slightly different but she is otherwise nearly identical to my childhood doll. I can still tell them apart because the vinyl of their limbs and head feel different. Should I have bought this doll? Probably not. But I don’t regret it at all.", 

"213": "Samantha Parkington was one of the three originally released dolls by Pleasant Company in 1986. Canonically, Samantha is a wealthy orphan living during the turn of the 20th century in New York. Her books focus on child labor laws and first wave feminism as well as themes of found family and using privilege as an effective ally. I don’t know the exact year that this specific Samantha doll is from because I got her second hand as a child, but based on the copy of \"Meet Samantha\" that came with her, I believe she is from 1997 or 1998. This would be just before or right when Pleasant Company was purchased by Mattel, but the brand did not change its name to American Girl until 2000 so the manufacturer of this doll is undoubtedly Pleasant Company. Additionally, this doll has one noticeable section of hair cut in the back but it's easy to hide. Sentimentally, this is probably my favorite doll in my collection because Samantha Parkington is my favorite American Girl character, and I got this doll as a gift after she had originally been discontinued. However, I think this doll is the ugliest of my Samanthas; her face looks vastly different from the Mattel dolls that look a lot aesthetically nicer in my opinion. <br><br>&nbsp&nbsp&nbsp My second Samantha doll was one of my first adult purchased dolls. This is her Beforever version, which was first released in 2014. Beforever was a major flop that tried to revamp the Historical Characters but the outfits were so tacky and historically inaccurate that nobody was impressed. Her \"Meet\" outfit was changed to this pink dress that’s fine but vastly inferior to her original ensemble in my opinion. Instead of the fully molded shoes, she now has Velcro ones that are identical to her Shoes and Socks Set pair. On the physical doll, Samantha now has feathered eyebrows. Her face looks otherwise practically identical to the 2000s Samantha dolls (which is my easily accessible holy grail, but I cannot justify a 4th Samantha doll that isn’t a white body at this time). This doll is the Samantha I feel the most comfortable taking in public because my Pleasant Company doll’s hair is irritating to deal with and my 35th anniversary doll was only available for a short period of time.<br><br>&nbsp&nbsp&nbsp My third Samantha I probably should not have bought but I really wanted the experience of owning a Samantha doll in her original outfit new in the box. She also reverts back to the line eyebrows of the original dolls. Despite being extremely faithful to her original design, there are some interesting differences about her. The first thing I noticed about this doll is that her dress and hair ribbon (presumably made from the same fabric both originally and in this iteration) are made from a much more plastic-y fabric that reminds me of a picnic blanket or a tarp. Additionally, the clasp of her locket broach is gone, and it is just a solid charm now. I wish she didn’t have these changes but aesthetically she is still the prettiest Samantha and I love her more than any of my other 35th anniversary dolls.", 

"214": "Molly McIntire was first released by Pleasant Company in 1986 as a part of the American Girls Collection. She represents life growing up in the mainland United States during World War II. Her stories highlight childhood naivety and patriotism. In the books, Molly’s father works as a doctor in England while the rest of the family remains safely in Illinois. Molly McIntire is a very privileged character who I do not like very much. Molly is a horrible friend who manipulates the people around her to participate in her schemes, for example in \"Meet Molly\", she threatens to never talk to her best friend Susan again if she does not help Molly throw her brother’s underwear out the window. I should probably not be so harsh on a character that is in third grade but these are my dolls and I’m allowed to have beef with them if I want to. Additionally, Molly and the people around her share some super American Exceptionalist sentiments that I do not agree with and I find frustrating. I understand that this is very much a situation of context mattering, both in the fictional setting and the historical time the books were written (the middle of Reagan’s presidency). However, Samantha’s books were written at the same time and they are progressive by today’s standards so there’s no excuse. When I was a child, I did not share this sentiment, as Molly was the first doll I was ever truly hyper fixated on. I loved that she had brown hair that was often braided like me. I also considered the fact that she came with glasses a bonus item, which meant I was getting more things if I received her instead of another American Girl doll. My first Molly doll was the first American Girl doll I ever owned, and despite the flop books I will never ever part with this doll. Her wig has seen better days, unfortunately I do not feel confident in my boil washing skills to fix it. I don’t think I can recreate the pie-bangs myself. This Molly is also not wearing her original pair of glasses, which I broke as a child but still have. I lost one of her original hair ribbons but I hid that in the picture.<br><br>&nbsp&nbsp&nbsp My second doll was released as part of the 35th Anniversary collection along with the five other Pleasant Company-era Historical Characters. She came with her original \"meet\" outfit (the outfit she was sold in for about 25 years) and the corresponding accessories set that was previously sold separately. This Molly is a much nicer version of the first American Girl doll I ever received, but there are some differences in the details of their clothes and accessories. For example, the original sweater pulls over the head while the 35th anniversary version has Velcro on the back. There are other little differences such as the shape of the glasses but that that varied throughout Molly’s original tenure. The most noticeable change other than the Velcro is the state of the locket necklace. Along with Samantha’s rerelease, the charm no longer opens. This doll is not as sentimental as my other Molly doll but aesthetically she’s much nicer.", 

"215": "In 1991, Pleasant Company introduced their first addition to the American Girls Collection. Felicity Merriman is an ADHD-coded horse girl growing up right before the American Revolutionary War. Her books take a patriotic perspective to the politics of the time, and in an attempt to share feminist sentiments of the oppressed status of women at the time, the narrative accidentally implies that Felicity is a transgender boy. Considering the state of trans politics in the late 80s and early 90s, I heavily doubt that this was intentional. While this aspect of the story is unintentionally ahead of its time, there are also many problematic elements to Felicity’s story, arguably more problematic than Kirsten’s portrayal of settlers. Felicity’s family owns slaves, and because the story is written from the perspective of a 9-year-old girl living in 1774, the books treat the enslaved characters as \"part of the Merriman family\". This is very likely why Felicity is currently discontinued. Felicity was the first doll to be partially discontinued in the early years of Mattel’s ownership of the brand. I do not know the reason, but I assume it is related to the fact that there is essentially glorified depictions of slavery in the books. Felicity was removed from the catalogues in the very early 2000s, and since Pleasant Company/American Girl was initially a magazine-order company, it was nearly impossible to purchase Felicity or her collection for a few years (there were a couple of American Girl flagship stores, and the website was in its early stages, but most sales were still made via catalogue). For the release of the Felicity Movie in 2004, Felicity was revamped and reintroduced to the catalogues. Most importantly, Felicity’s Meet Outfit changed. Rather than the iconic Rose Garden Gown, new Felicity dolls would come in her Traveling Gown. When I was a child, the Traveling Gown was the only Felicity Meet Outfit I knew, so I was so confused when I borrowed old Pleasant Company-era books from the library and seeing the catalogue request insert that featured Felicity in her Rose Garden Gown. My first Felicity doll is from my childhood era, so she came in the Traveling Gown. She has the most piercing neon green eyes. Her hair is more brown than red, especially compared to my other Felicity. I got this doll several years after Elizabeth doll but it feels like they were reunited at last. I bought this doll during the early months of quarantine as I had finally allowed myself to be interested in dolls as an adult. She was the third adult purchased doll I bought on eBay, the last one I bought before I even allowed myself to consider buying a new doll that wasn’t from my childhood. I remember she took forever to ship but was absolutely worth the wait. I think I like this doll more than my other Felicity because she reminds me so much of my childhood.<br><br>&nbsp&nbsp&nbsp I almost missed out on my second Felicity doll; I managed to catch her the last time she was on backorder. It was a several months wait but I’m so glad I did it. This Felicity looks way more like the original Felicity, and what the typical Millennial thinks of when they see Felicity. She comes in her original Meet outfit and has the distinct copper red hair. There are some slight changes to the dress, most notably the shape of the sleeves changed to a shorter three-quarter length, but I’m not really bothered by the difference. This doll was the 35th anniversary doll I \"needed\" the second-most because my other Felicity was the 2000s one from my childhood. Not only had the Meet outfit changed, but the Meet accessories also completely changed so I really wanted this doll. Of the original six historical characters, Felicity is second from the bottom but she has a really unique place in both my collection and the history of the American Girl brand.", 

"216": "Addy Walker is probably the most important historical character released by American Girl. She and her mother escape slavery in 1864 and her stories follow her family’s reunion after their escapes to freedom. Addy was the first doll to have an advisory board to aid her collection’s development. This advisory board was composed of Black academics and historians, which impressed me considering Addy was developed in the early 90s. Addy was originally released in 1993 and was the first American Girl doll of color. She was also the first doll to have textured hair and non-removable earrings. Addy is also the first doll to have a new face mold, which was created to more accurately depict Black facial features. There is a really fantastic article about the development and creation of Addy, including some problematic behavior by Pleasant Company creator Pleasant Rowland. I will ask Jonah to link it here: https://slate.com/culture/2016/09/the-making-of-addy-walker-american-girls-first-black-doll.html. My Addy doll is the 35th anniversary rerelease. As a child, I did not have an Addy doll, but she was a top priority when I was an adult. I had been in the process of looking for one in the box for a good price when the 35th anniversary dolls were announced. I did not want to buy a doll in the Beforever Meet Outfit because the Addy from my childhood wore the iconic pink dress. Beforever and Post-Beforever Addy also has feathered eyebrows and I would just prefer to have the original. The 35th anniversary doll was bundled with her original accessories. Addy is the oldest American Girl doll to never be discontinued for any period of time, but like I implied earlier, she is no longer sold in her original Meet Outfit. Addy’s original collection has some of the coolest pieces, including a working puppet show from her summer collection. Addy has one of the smallest collections in my hoard of American Girl clothes which is very unfortunate but in my defense there’s literally nothing currently available at retail and Addy outfits are very expensive second hand.",  

"349": "In 1995, Pleasant Company introduced the American Girl of Today line, which was meant to be a more contemporary and relatable while encouraging writing. It was very much treated as \"you are also part of history\" and early on the consumer was encouraged to write following the format of the historical 6 book series. Packaged with the dolls were 6 blank books and a writing guide to show young girls (boys and enbies are not allowed to write apparently, which is my excuse for leaving mine blank) how they could put their self-inserts in the same canon as the Historical Characters. Later, only the blank \"Meet\" book was included, but my doll came with all 6. There were 20 dolls released as part of the initial launch of the American Girls of Today, and they were all very similar. There were only three face molds at the time (the pre-existing Classic and Addy molds as well as the Asian mold that was only used for AGoT Number 4). Most of the dolls also had the same pie bangs as the original three dolls. Each doll came in the hideous Mix and Match Outfit until 1996 when it was replaced with the equally ugly First Day Outfit. After the initial change, the American Girl of Today Meet Outfit would change every two years. I got my doll second hand with all her paper goods. The only piece of her Meet Outfit I have is her underwear which was identical in the first two ugly Meet Outfits so I don’t know for sure which one it is. Because of this mystery, I can only estimate how old this doll is exactly, but she is probably the oldest American Girl doll in my collection. The only other Pleasant Company era doll I have is my first Samantha who is from either 1997 or 1998. This doll is from any time between 1995 and 1997 because she came with all 6 blank books. This doll looks a lot like Kirsten who I am unashamed to say I love a million times more than this doll. The only difference between Kirsten and this doll is that Kirsten’s wig is designed to always be worn in two braids so there is a section of shorter hair pieces on the back of her head to help with the part line (and save money on kanekalon). I wasn’t really interested in the contemporary dolls until I was an older child because I didn’t want to create my own character. To me, the whole appeal was that the character already existed. I was also a child with undiagnosed autism which probably contributed to that perspective. I did eventually change my mind but this doll was long discontinued when I did so I never would have been able to get this doll at retail if I wanted to. This doll was filthy when I got her but I gave her the spa treatment she deserved and I think she looks much better now. I borrowed the I Like Your Style outfit for her picture because that was a later Meet Outfit for American Girls of Today (at that point the line was called Just Like You) and Number 3 was still available at that time so later iterations of this doll were sold in this doll, technically making it a correct Meet Outfit for her. This doll does not have a name because I could not think of one.",  

"217": "The last of the historical characters released under Pleasant Company was Josefina Montoya in 1997. Josefina lives in what would become New Mexico in 1824. She lives on a rancho with her father and her three older sisters. Her mother recently passed away and her father invites her mother’s sister Tia Dolores to live with the family temporarily. Josefina is very shy and does not like conflict. She loves animals but she does get into a fight with a goat in \"Meet Josefina\". Josefina was the second doll to come with non-removable earrings (after Addy). Ear piercing services were not yet available so there was no such thing as removable earrings for American Girl dolls during the Pleasant Company era. Due to the nature of the vinyl used in the 90s, interchangeable earrings were just not feasible. Pleasant Company dolls have very soft squishy limbs and heads. Anyway, Josefina has one of the most unique Meet Outfits from the Pleasant Company era because it does not follow the same formula as the rest of the dolls. Josefina does not have a hat, and rather than a purse she has a pouch that attaches to her belt. Josefina also originated one of the most iconic American Girl face molds, with the creatively named Josefina mold. The doll also is the first to have detailed eyebrows. When I was a child I always found Josefina to be one of the most gorgeous and interesting historical characters, and I’m not sure why I didn’t end up getting her until I was an adult. When I revived my interest in American Girl at the start of the pandemic, Josefina was one of the first dolls I bought. I knew I wanted a Mattel-era doll with the original Meet Outfit like the ones from my childhood, and I was lucky to find one still in the box for a relatively affordable price. There were a couple of marks on my doll’s arms when I got her, but I was quickly able to get them off with baking soda. Josefina is very important to the history of American Girl because she is the first Latina doll and she remains the only Latina historical character. I think she is one of the most beautiful American Girl dolls and I love her very very much.", 

"218": "Kit Kitteredge was released in 2000 as the first doll made under Mattel’s ownership and as the 7th historical character. Kit was also the first American Girl doll to have short hair (she has a bob, this is important for later). Kit grows up in 1934 and her books focus on the Great Depression. She struggles to cope as her father loses his job and her family shifts from middle to working class. She also has to reconcile her relationship with her best friend Ruthie, who will be nearly unaffected by the Depression because her father is a banker. Kit is a tomboy who wants to be a reporter when she grows up. She loves baseball and Robin Hood (let’s hope Ruthie didn’t think too hard about that one). In 2008, Kit was the first and only American Girl character to receive a theatrically released movie with \"Kit Kitteredge: An American Girl\". I don’t remember it at all because I was busy rewatching the Samantha movie. Kit was the first American Girl doll I owned more than one of, but it wasn’t because of my own shameful consumer choices.<br><br>&nbsp&nbsp&nbsp My first Kit doll was literally a back-up in case Kirsten did not come in time. When I was a child, I would hyperfixate on one American Girl character at a time. Samantha was a frequent favorite but because she was discontinued at the time, I didn’t get her until I was nearly 11. I never really hyperfixated on Kit, I did play her Nintendo DS game a lot but it was so much harder than Julie’s so I didn’t play it as much. I had a couple accessories sets for Kit such as her scooter and dog (they will not be making appearances on this website because I’m not willing to put Jonah through that), but I didn’t have any additional outfits for Kit until I was an adult. My other Kit doll was originally my sister’s and she got hers the same Christmas as I got mine. Kit was the historical doll that matched my sister’s personality the most but honestly she was only interested in dolls because her older brother was so obsessed with them. She didn’t care at all about the lore or Kit as a character so she didn’t play with her doll much. Kit stayed in a drawer for years. Despite this doll neglect, my sister’s Kit is currently in better shape than mine. Remember how I said she has a bob? Well Kit’s wig also has a side part, so I thought my doll’s hair was uneven. You can see where this is going. I could easily send Kit #1 to the Doll Hospital but I haven’t gotten around to it yet. Kit #2 has a slightly messed up wig so I’ll still be able to tell them apart after I stop being lazy.", 

"219": "A year after Pleasant Company fully transitioned into American Girl, the company decided to experiment with their first contemporary character doll. She was still released as part of the American Girl Today (the \"of\" was removed from the name in 1998), but Lindsey was still her own distinguished character. Like the historical dolls, she had her own book, but unlike the historical dolls, this book was longer and written in the first person. Because Lindsey was so experimental her collection was tiny and the lore of her story was limited. There are no separate outfits in Lindsey’s collection and she does not have a defined birthday. However, Lindsey’s life story wasn’t a complete mystery, as she is the first American Girl doll to be Jewish. In the first couple of years under Mattel’s leadership, American Girl dolls had a lot of quality control issues such as frizzy hair and greenish skin. My doll’s hair is fine but she does have a but of a green undertone. It is often difficult to find Lindsey dolls without these features because she was only sold during the rocky transition period. I’m not sure how I managed to not mention this yet, but Lindsey was also the first Girl of the Year. She lives in the year 2001 (as you can see from her Laptop and Bag set that I do not have). She was intended to be sold while supplies last but supplied lasted well into 2002, so she was more of the Girl of the year for both 2001 and 2002. Officially, she is only the 2001 Girl of the Year and there is no 2002 Girl of the Year (the same thing happened in 2003 and 2004 with Kailey). I got my doll used without any of her Meet Outfit. My doll has very loose limbs that need to be restrung. American Girls’ limbs are attached with elastic connected by small plastic cups that allow movement as well as being held in place. The elastic in my Lindsey doll is so stretched out that her arms and legs constantly flop around. Because of this, my Lindsey currently cannot stand on her own. I absolutely could have fixed this months ago but I am very lazy and I have plenty of other doll projects to finish first. For my picture, Lindsey is wearing the Snowflake Pajamas because I couldn’t think of anything better for her to wear.",  

"220": "In 2002, Kaya was released as the first indigenous American Girl. She is a member of the Nez Perce tribe that lives in the year 1764. She does not interact with the European colonizers but there is evidence of their invasion in the stories. Kaya is an adventurous child that cares deeply about animals. She is also very sensitive. Kaya has a unique face mold that features a closed mouth that was made to be respectful of Nez Perce culture. Most American Girl dolls have open mouths that show their teeth, but in Nez Perce culture, showing your teeth is seen as a sign of aggression so it was important for American Girl to accommodate. An earlier prototype of Kaya featured the classic face mold (the one used on all the white dolls up to this time). Like Addy and Josefina before her, Kaya had an advisory board to consult on the accuracy of the doll’s collection and books. Kaya has always had a smaller collection with only a couple of outfits at a time, as well as an emphasis on her animal friends and accessories. When I was a child, I thought that Kaya had one of the coolest collections but I was always anxious about how I didn’t have enough clothes for my dolls, so I didn’t prioritize her. Interestingly, when the Beforever relaunch disaster happened, Kaya (along with Caroline, but for different reasons) did not receive a new Meet outfit. I’m guessing this is because it would be disrespectful and probably boarder on cultural appropriation. Since it was over a decade after Kaya’s original release, I’m not sure American Girl were still in contact with the advisory board. I’m not complaining though, I absolutely hate the Beforever era. Kaya is one of the most beautiful dolls in my collection and one of the most important parts of American Girl history so I am incredibly thankful that she has a place in my collection.", 

"221": "The Bitty Twins were created in 2003 as an expansion of the Bitty Baby line. The twins were sold as a boy and a girl together (initially) and meant to be slightly older than Bitty Baby (as you can see for their difference in hair). In 2006, the Bitty Twins line was expanded, aging the dolls up to be walking and talking toddlers. Two years later, the racial variations increased, making the line more diverse. At this point the purchaser could choose any combination of two dolls. These were my sister’s dolls, so I don’t have much childhood sentiment here. However, these two twins were the first American Girl dolls I cleaned up as an adult so I will always appreciate them for teaching me so much. In order to not be redundant, I decided to split the personal story of these dolls to the blonde doll’s description so see her for that.", 

"222": "See the brunette twin for the history of these dolls. My sister picked out these twins when we went to the American girl store for the first time because she was jealous of me but I guess my mom thought she was too young for a full-sized doll so she got to pick out twins. She probably played with them a maximum of 2 times because my sister only liked dolls so she could play with me or her friends. These poor dolls spent about a decade in the garage until I rescued them. They lost some of their pieces in that time. These dolls have a weird hairstyle, but I can’t judge much because I had a similar haircut until very recently. It didn’t look that bad on me I swear. I don’t think my sister gave these dolls names, and I didn’t either but I don’t name any of my dolls except for Dianne.", 

"223": "In 2004, American Girl shifted from the transition period to the Mattel era I grew up with. This shift was signified by new book covers for the Historical Central Series. Rather than immediately changing all 8 characters books, American Girl only switched up Samantha’s at first. This was because the Samantha movie was released in 2004 and with that came the introduction of Nellie O’Malley, the first Historical Best Friend doll. When you buy an American Girl doll new, you get a book with them. Nellie’s book was a new 7th story in Samantha’s series (only it was written in Nellie’s perspective). It would be silly for this new book to be released in the transition cover style only to switch over a year later. Anyway, Nellie is a child maid that Samantha becomes best friends with. Later, Samantha’s aunt and uncle adopt Nellie and her sisters after they lose their parents and face additional trauma. It was a whole ordeal. Nellie is Irish and she’s very connected to Irish-American working class culture. After her adoption, she is very conscious of the privilege she has after jumping from to bottom to the top. When I was a child, Nellie was completely overshadowed by Samantha in my head which apparently is not a popular sentiment. My love and attachment to Samantha Parkington is not normal and I acknowledge it is definitely related to being autistic. Nellie is to the neurotypical a much more interesting doll and character but I am clearly not neurotypical. Nellie was the first white doll to feature the Josefina mold. She’s objectively a very pretty doll. I’m sure I would appreciate her more if I wasn’t so attached to Samantha.", 

"224": "Marisol Luna was the first Girl of the Year that was actually successful. Apparently I did not explain the Girls of the Year well because Jonah thought that American Girl picked a pre-existing historical character to highlight each year. Marisol was the last Girl of the Year to also be considered a part of the American Girl of Today line. Marisol’s story focuses on her coping with the fact that her family is moving from the city to the suburbs because her parents wanted her to grow up in a safer neighborhood. This brought criticism because Marisol is Latina and liked in a majority-Latino neighborhood so the implications were a bit racist. Marisol is the first non-white Girl of the Year, and she is also the first of many dancers. I think Marisol is one of the most beautiful Girls of the Year. I got my doll second hand and she was filthy when I found her. Her hair had been kept in an elaborate braid for years so it looks crimped in the front where it’s not supposed to. I could fix it with a boil wash but I’m afraid of ruining her original waves in the process so I put it off. Because I got her used, I don’t have Marisol’s Meet Outfit, I only have the underwear so I put her in the Pretty Party Outfit because I thought it looked nice on her.", 

"225": "Following the success of Nellie O’Malley the year before, Elizabeth Cole was released alongside Felicity’s soft relaunch and the Felicity movie in 2005. Elizabeth and her family have just moved to Virginia from England at the time of the Felicity books, but unlike Felicity’s family, the Coles are Loyalists. The whole point was to teach kids that you can still be friends with someone who has different opinions. I’m not sure I agree with that sentiment. Felicity and Elizabeth meet when they start taking tea etiquette lessons together alongside Elizabeth’s older sister Annabelle. Elizabeth is very shy, and her older sister is honestly unreasonably mean to her. An interesting fact about Elizabeth is that she is the only character to get a drastic change in physical appearance. Originally, Elizabeth was a brunette with brown eyes but in 2005 she was changed to a blonde with blue eyes to match the actress in the movie. Elizabeth was the first American Girl doll to have removable earrings (Addy and Josefina have non-removable earrings). Ear piercings did not become a service provided by American Girl until 2008. I got my Elizabeth right before she was discontinued, and I became absolutely obsessed with her. Unfortunately, I gave Elizabeth a haircut when I was a teenager, but I can hide it in a ponytail for now.", 

"226": "The third Best Friend, Emily Bennet was released alongside the Molly movie in 2006. Unlike Nellie and Elizabeth, Emily isn’t actually Molly’s best friend (Molly has 2 best friends who she mistreats, Linda and Susan). Emily is Molly’s \"English Friend\" who originally only appeared in \"Happy Birthday, Molly!\" Emily is sent to the United States to escape the dangers of War-stricken London. She came to live with her aunt who is so sick that she stays with Molly’s family for a while. Molly and her peers treat Emily like a celebrity because to them, Emily’s trauma is a fun game (literally, Molly and her friends \"play\" air raid shelter for fun). Emily is fantastic speller (cannot relate, queen. Every typo on this website is my fault) who loves puns. She’s a nerd. She’s also horrible at the recorder. Emily sees England like Molly sees America, so Emily likes the royal family (cringe) but she’s 10 so I can’t be too mad. Emily originally had shorter chin-length hair but it was made shoulder-length for the doll to match the movie (she was always a redhead though). Emily was the 5th doll to join my collection and I always adored her, but she was subject to a slight haircut and a lipstick facial when I was in middle school. I forgot to take it off for a day so she had a bit of a red stain. Of course she got a new head. There’s still a lipstick stain on her torso and Meet dress that I could easily get off but I’m just too lazy.", 

"227": "Julie Albright was released in 2007, as the first new full Historical Character in the Mattel era. She is the only historical doll to debut alongside her best friend, Ivy Ling. Julie grows up in San Francisco in the year 1974. Her parents recently got divorced because her father did not want her mother to have a job. Julie’s books mainly revolve around second-wave feminism, as Julie adjusts to living with a single working mother and has to create a petition to play on the boys basketball team (Title IX). Julie is determined to fight for what’s right. She is excited for a progressive future and is determined to create a better world.  Julie was the second American Girl doll I ever received, and my interest in that character definitely came from the Julie video games. The PC point-and-click adventure was too difficult for me (and as an adult it was too slow so I got bored), but I think I played the DS game more than any other video game in my entire life. Julie has very long blonde hair that I loved playing with. Unfortunately, I think my first Julie head (yes, this was another Doll Hospital visitor) was faulty because almost immediately there were fly-away split ends. The neck was also not tied on right, so her head was loose. When I was 11 her head fell off. I was able to reattach it but it remained loose until she went to the Doll Hospital when I was an adult. Julie also received a haircut too but the stylish bob did not look very good with her straight hair. Julie is an extra special doll to me because I brought her with me when I went to the American Girl store in New York for the first time. She was my plus one at the American Girl Café. I would love to go again to celebrate the completion of this website but I doubt Jonah would be very receptive to that idea.", 

"228": "I was first introduced to American Girl in 2008, when Mia was the Girl of the Year. Mia is an ice skater with lots of older brothers who all play ice hockey. Mia struggles with her figure skating but spends her books determined to improve. I really wanted this doll after she was discontinued because my best friend (the same one who was always accusing me of copying her) got this doll the Christmas I got Molly. I got my Mia doll four years later when we were no longer friends. The person who sold my Mia to my mother got a bit confused and accidentally sent me pieces to a Girl of Today ballet outfit instead of Mia’s tights and bag but I really don’t mind. Obviously, I’s prefer the original tights but it doesn’t bother me enough to do anything about it. My Mia doll has a slight haircut but it’s not noticeable so I haven’t rushed to get her head replaced. I think Mia is one of the most beautiful redhead American Girls, so she’s my favorite redheaded doll. However, the prototype for Mia was a doll of color so I do wish that she looked like that instead.", 

"229": "Rebecca was released in 2009 following the original discontinuation of Samantha. So naturally, I hated her. As an adult with 3 Samantha dolls, I no longer care that much. Rebecca is the child of Russian immigrants that lives in New York City in the year 1914. Rebecca’s family is Jewish and live in a Jewish neighborhood, but Rebecca goes to public school where she and the other Jewish students are forced to assimilate to Christian American traditions. Rebecca wants to be an actress when she grows up, just like her uncle. My Rebecca is from the post-Beforever era, so she came in her Beforever Meet Outfit. I do like the newer Meet Outfit because it’s purple, but I wish I had her original one instead. I tend to prefer the original Meet Outfits because with the exception of Felicity, they are the ones I grew up with. Rebecca is one of the most beautiful dolls in my collection, but I honestly don’t have that much to say about her. I really like her, but I haven’t given her the attention she deserves yet. I’m a bad father that plays favorites.", 

"230": "Marie-Grace Gardener was half of the most experimental Historical Character release. Instead of a main character and her less important best friend, Marie-Grace and Cécile Rey (who I currently do not have unfortunately) are equally prominent and share a collection. The books alternate perspectives. Cécile and Marie-Grace live in New Orleans in the year 1853, and their story revolves around the Yellow Fever epidemic. I remember being bitter because these dolls kinda replaced Kirsten as the representative of the 1850s but obviously I got over that. Marie-Grace is very shy and reserved. She and her father moved around frequently before returning to New Orleans at the start of the series. Marie-Grace is horrible at speaking French so she’s just like me for real. Marie-Grace also loves to sing and she takes music lessons with her best friend Cécile. Marie-Grace was the 11th and last American Girl doll I received as a child. I got her right before she was discontinued (Cécile was already sold out) along with her remaining outfits. Until last year, Marie-Grace had a unique face mold. Because I lost interest in American Girl soon after I got this doll, her hair is fairly untouched and remains in good shape. That is a relief because I cannot recreate that hairstyle. Despite not playing with this doll much, her underwear elastic completely stretched out and one of her legs is really loose. I don’t know how either of these things happened but personally I blame Jonah.", 

"231": "In 2010, the American Girl of Today line got yet another revamp. I’ve been just calling the brand American Girl of Today for consistency and so Jonah doesn’t get confused but at this point it was renamed \"My American Girl\". With this revamp, American Girl also launched Innerstar U, which was essentially American Girl’s answer to Club Penguin, but it was a university and didn’t work very well so I gave up on it. With this revamp came the release of various new contemporary dolls. I quickly became obsessed with this doll the second I saw her. When I was 11, I had this delusional belief that this doll looked like me. I do not have hazel eyes nor do I have freckles like that. American Girl of Today gets a new Meet outfit every two years probably to stay current. My doll came in the True Spirit Outfit. See that outfit for my opinion of it. Because Innerstar U was still running at the time, my doll came with a code to make an account. It was like Webkins in the way that you need to buy a doll in order to make an account. The price difference between American Girl dolls and Webkins is pretty huge so obviously Innerstar U was nowhere near the level of success. The doll also came with a charm necklace, and each American Girl of Today outfit came with a charm to add. This is the only American Girl doll I got at one of the stores. I got her at the New York store for my birthday. This was my brief phase where I lost interest in the historical dolls and gravitated towards the contemporary dolls. I regret this now because I wish I got Caroline at this time instead. Obviously, I do not have a Caroline doll at the time of writing this. When I was an older kid playing with this doll, her hair started to get frizzy so I decided to give her hair a trim. This soon became a stylish bob. And then the Karen. One of my first priorities when I got back into American Girl as an adult was sending this doll to the Doll Hospital and getting her. Head replaced. I felt so bad that I destroyed her hair, but it honestly wasn’t as bad as my McKenna doll, but you can see that if you click on her. I went through various names for this doll but they are all embarrassing, so I don’t want to share them. As an adult I just call her My American Girl Number 55 because I am uncreative. For a while, American Girl only used the number system in the stores but this doll has always been number 55.", 

"232": "Bitty Baby is an evolution of the first spin-off line by Pleasant Company. In 1990, Our New Baby was released. This was a baby doll that was marketed as a teaching tool for young children adjusting to having a new sibling. In 1995, Our New Baby was discontinued, and the Bitty Baby line began. Bitty Baby dolls are essentially the same as the Our New Baby dolls but came with slightly modified hands. Bitty Baby was also defined as a girl and got Bitty Bear; her stuffed animal that often received her own little outfits packaged with the Baby’s clothes. Bitty Baby came in various combinations of skin tone, hair, and eye color. They did not always have numbers to distinguish them (unlike American Girl of Today). I’m not sure when the numbering started, but my doll is number 3. Judging by the Meet outfit she came with (I assume, I got her second hand), my doll was bought between 2011 and 2013. To be honest, I do not like baby dolls that much, I only got this doll because she is an American Girl doll and I obviously love American Girl very much. Gideon said this doll was scary and honestly, he’s right.", 

"233": "I cannot explain why, but when she was the Girl of the Year, I was obsessed with McKenna. She is a gymnast that is heavily implied to be dyslexic and learns to not be ableist. I was horrible at gymnastics, I am not dyslexic, and I did not express open distain for wheelchair users as a child, so I have no idea why I loved this doll so much. Honestly I probably had a crush on her and thought she was cool. I’ve seen people on TikTok say that McKenna looks homophobic, but I don’t get it. I think her Meet outfit is hideous and screams elementary school in 2012, so I guess it serves its purpose well. This doll was the first time I deliberately preferred getting a contemporary doll to a historical one. This was a weird phase I was going through at the time. When I was in Middle School, McKenna’s hair started to get frizzy so I decided to give her a haircut. At first I gave her a stylish bob, and honestly that looked really good. However, One day I decided I wanted a male American Girl doll because I saw people make custom boy dolls on Youtube. This was before American Girl decided to release their own male dolls. I did a horrible job of cutting her hair because I didn’t understand how the rooting of American Girl wigs worked. There was a massive bald spot that I tried to cover up but it did not work. Additionally, I also accidentally removed half of her eyebrow with a Magic Eraser. Youtube told me to clean my American Girl dolls with a Magic Eraser which was a very bad idea. Magic Erasers are essentially just very fine sandpaper so they take doll face paint right off. Do not use them on your dolls. My doll’s eye got messed up at some point; I think something happened to the weight because it was no longer able to close all the way and it would open weirdly. Along with My American Girl number 55, McKenna went straight to the Doll Hospital for a new head when I was an adult. She looks a million times better now and I’m sure she’s much happier.", 

"234": "As the Girl of the Year for 2013, Saige is so early Tumblr. She’s a bit of a horse girl and a bit of an artist. A lot of the art aesthetics that are associated with her feel like they’re appropriating Aztec and Native American art that was rampant in 2013. It’s very Coachella. The most exciting thing about this doll is that she had a massive hot air balloon in her collection. This was actually my sister’s doll; our parents bought her for her when we went to the American Girl store for my birthday for the second time and I got My American Girl Number 55. My sister never played with this doll, and Saige stayed in a drawer until I was 18 and I adopted her. I think Saige is cute but she looks a little bit too much like Emily to me so she’s not my favorite. Saige looks like one of those girls that would make fun of me in middle school. Honestly I think Saige looks more homophobic than McKenna. Saige is one of those people that refuses to acknowledge that she’s ever wrong even when she’s called out for her behavior.", 

"235": "Melody Ellison represents life as a young Black girl during the Civil Rights Movement. She lives in Detroit and is surrounded by musicians. Melody loves singing and gardening, but she struggles with not feeling like a leader. Melody is the third Black Historical Character, but at the time she was released she was only the second available. Along with her predecessor Addy, Melody had an advisory board to ensure her world was portrayed accurately. Also like Addy, Melody has textured hair, but it has been straightened, as Black women and girls were expected to do at the time. Melody’s fashion is absolutely adorable, and I think she looks amazing in everything. I love her Sonali face mold, but I do wish she had the Addy mold because Addy is the only historical doll to use that face mold. Otherwise, I think this doll is absolutely perfect and I have literally nothing negative to say.", 

"236": "Nanea was released in 2017 as the third Historical Character that came after the Beforever relaunch. Nanea is unique because she is not the first doll to represent World War II and the 1940s, but she has a drastically different (and honestly more interesting and important) perspective than Molly. While Molly lived safely on the Home Front in Illinois, Nanea lives in Hawaii and witnesses Pearl Harbor. Nanea is traumatized by the attack on Pearl Harbor and the changes it brings to her life. The Nanea doll featured a new face mold and was the first historical doll to feature additional decals as part of her face paint. Nanea is also the second Historical Character after Julie to feature pants in her Meet outfit. At first I was slightly off-put by the new face mold but I quickly fell in love with this doll. I think she is absolutely gorgeous. Nanea was the third American Girl doll I bought at retail after I regained interest as an adult and I really love her. Although I have a lot of sentimental love for Molly, I think that Nanea is a much better character and doll. I think her story is much more important and significant than Molly’s if I’m being honest. I think she’s a lot prettier too.", 

"237": "Courtney Moore was the newest historical doll released when I first returned to dolls as an adult. Courtney is my second favorite historical character. Courtney is probably the most like me in personality now because she is a very shy person but when she feels comfortable and determined she becomes outspoken. This is most obviously seen during one of the many traumatic events in her books when she becomes an AIDS activist during the height of the epidemic. But I’m jumping ahead. Courtney lives in a blended family where her mother decides to run for mayor. Because it’s the 80s her mother is ridiculed for being a silly woman and wanting to run for office (I hope you can tell I’m being sarcastic), and Courtney impulsively defends her in a passionate monologue on live television not too unlike America Ferrera’s in the Barbie movie (which of course I dragged Jonah and Gideon to). Courtney is also a gamer gorl and she is ridiculously good at video games. Of course, that means she has licensed Pac-Man merchandise in her collection. Once when we were working on this website together Jonah called Courtney a material girl because of all her outfit pieces and honestly he’s right. I wish I could say this was a reflection of 80s consumerism but it’s really just Mattel trying to maximize profit. While other historical dolls have had licensed pieces in their collections (for example, Julie has a Barbie styling head in her Christmas collection), licensed pieces are integral to Courtney’s world. Like I mentioned earlier, Courtney’s books also cover the AIDS crisis but they still avoid talking about gay people except for a brief mention in the tiny non-fiction section at the end. This is not very slay. Despite completely ignoring the minority group targeted by the stigma of the AIDS crisis, Courtney is still bullied for her activism and being friends with a child who is HIV-positive. After her locker is vandalized in what could arguably be called a hate crime, Courtney makes an informative pamphlet for her classmates at her dad’s house (her dad is heavily implied to be gay because he divorced her mother amicably and he moved to San Francisco). One other narrative thing I want to highlight about Courtney is the fact that she has her own American Girl doll (really it’s a Pleasant Company doll). Courtney’s story takes place in the year 1986, when Pleasant Company was founded. Courtney randomly gets a catalogue in the mail and becomes obsessed with Molly (I’d judge her for her taste when there was a much better option a couple pages away but I did the same thing when I was 6). It was a very silly part of the story but I thought it was really cute. Honestly I think I need to boil wash Courtney’s hair but that’s so much work.", 

"238": "This is the second version of the mini dolls, in the third variation featuring miniature \"Mattel era\" (my term) books. The original mini dolls were marketed as accessories for the American Girl of Today dolls from 1995-2000. They also had tiny glass eyes, but they did not open and close like the full-sized 18 inch dolls. From 2000 onward, mini dolls have had printed on eyes, but until the start of the Beforever era in 2014, they had cloth bodies just like their large equivalents. This Kirsten came in a bundle with her story collection, which I detailed in my descriptions of my full sized Kirsten dolls, but she is exactly the same as the single release doll. I was in second grade when I received this doll, so her tiny looped braids are long gone and I don’t have the skill or patience to attempt to recreate it. She is dressed in a tiny version of her original meet outfit (although Kirsten has only ever had one). Unlike the full sized American Girls, the 2000-2017 (I assume, because that is when it was discontinued) mini dolls were rooted with fashion doll grade kanekalon. This is one of the two most sentimental mini dolls I my collection because she was the first, and I got her before my first big Kirsten (Kirsten #2 was an adult acquisition).",  

"239": "This is the first mini doll I bought used. I got this mini-Samantha in a lot of Samantha clothes, accessories, and books I bought on eBay. I bought it because the lot included the Spring Party Dress, which usually sells for more than I paid for the entire bundle. I am also a doll hoarder. Anyway, this mini doll is missing her shoes, but they are identical to the 25th anniversary doll’s shoes so it’s not a huge deal for me. Additionally, this doll has received a boil wash so her hair went straight. Mini-Samantha is supposed to have wavy hair like my full-sized dolls. Oops. Like all standard mini dolls, this one wears a scaled-down version of Samantha’s original meet outfit. This is a 2000s era mini doll, so this was the meet outfit regular Samantha had at the time. Sentimentally, this doll does not mean that much to me because 25th anniversary Samantha was a childhood doll that holds a special place in my heart. They are very similar looking with regards to the physical doll. However, I still treasure her as one of my dolls and part of my unreasonably large Samantha Parkington collection.",  

"240": "Along with the release of her full-sized doll, mini Nellie O’Malley was the first mini Best Friend. Nellie was first released with the Samantha Movie in 2004. She started the formula of Best Friend characters having a 7th book at the end of their corresponding historical’s series. My mini Nellie was bought secondhand so she is missing her shoes and mini book. I took her hair ribbon out when I cleaned her and honestly I’m too impatient to tie tiny hair bows so the ribbon lives in storage. Nellie has always been way less important than Samantha to me but I still think this mini doll is very cute and I have a soft spot for dolls with short hair.", 

"241": "I got my mini Kit the Christmas after I got my full-sized doll. I’m not sure why she was chosen because I never gravitated towards Kit as a child. This doll can only be described as a budget version of the original 18-inch doll because the sweater and top are attached and the hair clip does not open and close (reattaching that was a headache). I can’t compare the hair clip to the full-sized one because both of mine were lost when I was a child. The hair is also interesting because it just has a blunt uncurled bob rather than the slightly asymmetrical curl of the original doll. The closures are also all Velcro instead of snaps and zippers which is to be expected.",  

"242": "Mini Felicity is unique because the version I have is slightly newer than the other mini dolls I have from that time period. In 2005, Felicity was semi-relaunched with the release of her movie and given a new Meet Outfit (see my full-sized Felicity for more details), and her mini doll changed to match. This doll was a childhood acquisition, I remember I got her for my birthday when I was in 3rd grade from a classmate. This doll went on many adventures with mini Elizabeth; I brought them to school often. It’s a miracle I still have her hair ribbon. Her original ponytail is still in but it looks awful and I really should redo it. I purposely lost one of this doll’s shoes when I was a kid because I had lost one of Elizabeth’s and I wanted them to match. This doll’s dress lacks the pocket holes and the detailed embroidery of the full-sized doll but they are made from the same material.", 

"243": "Mini Elizabeth was released in 2005, and like Nellie she came with the release of Felicity’s movie. I got this mini Elizabeth for Christmas, shortly before I got the big Elizabeth. I was in third grade when I got this doll and that is very obvious when you see her. I absolutely destroyed her hairstyle and I lost both of her shoes very quickly. Because of the period-accurate undergarments, I treated this doll as having two outfits so she did a lot of costume changes. Especially after I got mini Felicity, they were often matching in all white shifts that I thought were just dresses. This poor doll has seen better days but she’s still really beautiful. She’s just in urgent need of a boil wash right now.",  

"244": "I am not sure why I have this doll. I don’t really like the full-sized Ruthie that much. In fact, as a child I was more interested in the fact that she came with a fancy watch in her meet accessories than the doll herself. I think Ruthie’s Meet Outfit is absolutely hideous and her collection is almost entirely boring and horrible. That being said, I don’t hold a huge amount of hatred for this mini doll because she is cute in this tiny form. She is still wearing that horrible ugly dress. Her hair is a cute length, its definitely shorter and less curly than the 18-inch version but it’s still cute. I’m very sorry but this is my least favorite mini doll and one of my least favorite American Girl dolls.", 

"245": "For the 25th anniversary of the American Girl brand, a mini doll of each historical character, including the (at the time) discontinued ones, each month in their holiday outfit except for Kirsten. This doll features Samantha in a miniature version of the Cranberry Party Dress. Samantha, the first historical doll to be \"archived\" was also the January release. She came with an abridged version of \"Samantha’s Surprise\" in the scale of a full-sized American Girl doll. Rather than featuring a scaled down version of the original (Mattel-era) cover, the mini version of Samantha’s Surprise features a zoomed in portrait of the character usually in their signature holiday outfit. In the case of Samantha, the portrait from her \"Samantha’s Family and Friends\" page is used instead. There was also a sticker label for the Mini Doll Display Shelf that was sold separately. I have a lot of childhood memories of this doll because I got her before any of my full sized Samanthas so she’s very special to me.", 

"246": "The September release of the 25th anniversary historical mini doll collection featured Julie in her original Christmas Outfit and a miniature abridged version of \"Happy New Year, Julie!\". Julie is unique as far as the historical holiday stories go because although Julie celebrates Christmas with her family, the majority of the story is dedicated to celebrating Lunar New Year (but is referred to as Chinese New Year in the book) with her best friend Ivy. Because of this, the illustration on the cover of the mini book shows Julie wearing a traditional Chinese dress that Ivy gave her in the book. This dress was not made into an outfit (although Ivy’s own dress was part of her own collection). Like the rest of the dolls in the line, the doll came with a nameplate sticker but I lost mine years ago. I also lost one of Julie’s shoes so I took the other one off for this picture. I think this is a beautiful doll with the loveliest hair of all my mini American Girl dolls. I also really like her outfit but that entirely comes from bias because I love 1970s fashion far too much.", 

"247": "I love this doll very much, but I really really wish I had the full-sized doll instead. The full-sized Cécile was not sold for very long and she’s absolutely stunning, so she is very expensive on the second-hand market. Since I don’t have the full-sized Cécile, I’ll go over her biography here. Cécile Rey is a wealthy young Black girl growing up in New Orleans during the Yellow Fever epidemic. She and her family are prominent members of the free Black community. She’s a very confident and considerate person. She’s also bilingual, speaking French and English (in that order) Because this is a mini doll, my Cécile does not capture the gorgeous details of the 18-inch doll. She still wears a scaled down replica of her Meet Outfit but details such as the buttons on her boots are replaced with embroidery. This is definitely one of my favorite mini American Girl dolls aesthetically.", 

"248": "The biggest difference between the full-sized Marie-Grace and her mini doll is the highlights in her hair. Because the mini doll has a much smaller head, the highlights stand out and contrast more with her base hair color. Her dress is a slightly different material from the original, but it’s still pleasant. I don’t love the plaid fabric of Marie-Grace’s Meet Outfit but I think it looks cute in the mini form. I think this is one of the cutest American Girl Mini dolls, prob ably because she is in much better condition than my other dolls with similar features. Mini Marie-Grace has the cutest pin curls and she looks absolutely darling. I’m sure I would say similar things about mini Felicity and Elizabeth but I destroyed both of their original hairstyles as a child. I can’t remember if I got this mini doll shortly before or at the same time as my full-sized Marie-Grace but it was definitely around the same time.",  

"249": "This is the most unique doll in my American Girl mini collection because she is not actually from the mini doll line. Instead, she is actually part of Courtney’s collection. Courtney is the 80s historical doll and her books happen to take place in 1986, the year that Pleasant Company (the brand that would later become American Girl) was founded. In the books, Courtney finds a Pleasant Company catalogue and she falls in love with Molly. I’d judge her choice but I did the exact same thing as a child. This mini doll is a recreation of how Pleasant Company dolls were initially released but the doll itself is made identically to modern mini dolls. Mainly, this mini doll has a plastic body, painted on eyes, and nylon hair. Courtney’s Molly should have a white cloth body, inset eyes, and kanekalon hair. The doll also came with a miniature version of Meet Molly, but this is also historically inaccurate. This miniature book has the second version of Molly’s illustrations which were not used until 1989. However, the little red box Molly comes in is a faithful adaptation to the original release. This doll was must-have in Courtney’s collection because it marks how full-circle American Girl has become as a brand. I still think Courtney should have gotten Samantha instead but I’m not bitter."

}]