[ 

{ "1": "Ballerina Barbie is the oldest doll in my collection, and the only Barbie that precedes the Superstar mold. She has the TNT (Twist N Turn) face mold that I was scared of as a child. Uniquely, the crown is stuck in her hair, in not sure what with but it’s very secure. I marked her hair as saran, but I am honestly not entirely sure if that is the correct fiber. It is absolutely not kanekalon or any type of modern nylon, but it could possibly be saran. There is also a mechanism inside of this line of dolls that made Barbie’s arms and legs move when she bent forward, but it is notoriously fragile. My doll is miraculously still in one piece despite my reputation for breaking things but part of the soft plastic of one of her bend-n-snap legs has ripped. This happened before I bought her, so it was not my fault. Additionally, my doll does not have her original outfit (minus one shoe). Instead, she is wearing a period accurate fashion pack, Best Buy Fashions 7814, but it is missing the belt.<br><br>- Daniel", 

"171": "Capitalizing off of the success of Superstar Barbie, Mattel released a 17 inch version of my favorite fashion doll. Rather than the iconic pink gown, this doll came in a silver ensemble. The doll came with a leotard, a skirt, and a pair of pants so consumers could mix and match. The doll also came with a stand, shoes, and some jewelry. Of course, I bought this doll 45 years after she left stores, so my doll came with none of these pieces. I probably shouldn’t have bought this doll without her original outfit but she’s a Superstar Barbie and I couldn’t pass her up. There are also many fashion packs released in the late 70s just like the Superstar fashions in the standard scale but they are also very expensive. Oops.<br><br>- Daniel", 

"2": "In 1976, Mattel changed the world with the launch of Superstar Barbie. Shifting from the peasant dresses and the Malibu bathing suits to the gorgina disco gowns and feather boas, Superstar Barbie shifted the brand into the Barbie pink glamour we know and love today. She was the first doll to use the Superstar mold, which is also the mold that didn’t terrify me as a child. Identifying this doll was a journey. I originally assumed that miss Barbie was on the right body, and the closest facial screening with that body type was 1983 Great Shape Barbie (a.k.a. \"Toy Story\" Barbie). However, the eyebrows were too different. So, I got curious and took her head off, as you do. I checked the stamp on the inner rim, and the country make did not match the body, which confirmed that this poor doll was on the wrong body. Next, I threw the body away because most of the fingers were broken off and the feet were all chewed. I had already washed it but it was just gross, so it had to go. I decided to give the remaining head another spa treatment, which was when I noticed that there was some short white thread rooted on each side of Barbie’s head. I was very confused, but I quickly figured out that this was the remains of a wedding veil. I also noticed that my doll has a slight haircut but it’s entirely possible that this was done in the factory during the repackaging process. Flash forward several months, I was looking at a 70s Barbie Instagram account that showed how someone restored Superstar Barbie’s original hairstyle. They redid the white string which I initially thought was just them being quirky and different until I looked through the comments and they said that the holes were from the factory. After checking the factory hairstyles of 1978 Beautiful Bride and 1980 Roller Skating, and then apologizing to Jonah via a 4,000-word essay about the importance of not wasting his time (just kidding I drew him a picture of the edit content button covered in glitter), I updated the spreadsheet with the correct information. For my picture, I borrowed someone else’s body and I dressed her in my reproduction Superstar’s outfit. This is my favorite fashion doll of all time and even though she’s currently just a head and one of the most common Barbies, she is one of my most prized pieces in my collection.<br><br>- Daniel", 

"3": "This is the first \"My First\" Barbie released, and she has a simplified version of the standard Twist N Turn body. Instead of bend n snap legs, My First Barbie has solid legs, one bent and one straight. Her head is also limited in movement, it can only move left and right. The clothes were supposed to be easier to put on and take off. The box contained extra outfit pieces so the child could mix and match fashions. I got this doll used so I only have some of the clothes, but I personally think that tying laces isn’t the easiest mechanism for young children to use. Velcro wasn’t widely used on Barbie clothes at the time, so I guess laces were the next best option. Also important about this doll is that her exact facial screening was reused for other My First Barbies and other dolls at the time. I was lucky that I found my doll in her original outfit. She had never been taken out of her original hairstyle which was very helpful for identification but not very fun to clean up. This doll is very unique in my collection as I don’t have many dolls from this time period.<br><br>- Daniel", 

"397": "Oh dear. This doll did not age well. This is one of the most iconic western themed Barbie dolls, but she has a winking mechanism that does not work well. Since this doll is over 40 years old, the winking mechanism has drooped over time and so Barbie’s eyes never look right. Similar to Kissing Barbie from 1978, this doll has a modified body with a button on her back that pushes gears in her head to make her wink. Also, rather than having a standard vinyl head, Barbie’s face wraps around the gears with a staple in the back. This looks rather terrifying to the unsuspecting viewer. I got this doll used, so I am missing everything except her jumpsuit. The doll originally came with a cowboy hat, boots, a hairbrush, comb, mirror, six headshots, and stamping tools so she could give her autograph to the other dolls. I’m sure Jonah and my other dolls are devastated that they could not get Western Barbie’s autograph. I don’t think this doll is as scary as the original Barbie face mold but she’s still pretty horrifying.<br><br>- Daniel", 

"4": "This doll was the first of a now annual series of dolls celebrating the holiday season. She was labeled a \"collector\" doll but was widely available. It is very common to find this doll still sealed in the box for very cheap. My doll is missing her hair bow, shoes, and stand. For a while, this was the oldest doll I owned. The bodice of this dress is a little big on Barbie. Honestly, I don’t like this dress very much, I think it’s a bit ugly and the tulle is very bulky. The doll is also very orange-toned and has a very large forehead. I do love her makeup and this doll is so important to Barbie history and doll history in general so despite my grievances I’m very glad to have her in my collection.<br><br>- Daniel", 

"5": "UNICEF Barbie was released as a tie in with the United States Committee for UNICEF, and with the original purchase of this doll Mattel donated a fraction of the profits (according to the box it was only $0.37) to UNICEF. The back of the box describes some of the organization’s focuses and advertises a poster called \"The Rights of a Child\". I got this doll used so I do not have this poster. I also unfortunately did not give UNICEF $0.37 with my purchase. I am also missing this doll’s shoes and her torso has some sun damage. Honestly, I don’t see how this outfit gives United Nations or UNICEF but I think it has a nice pattern.<br><br>- Daniel", 

"6": "When I think of Holiday Barbie, this is the doll I picture in my head. Despite being the third \"official\" Holiday Barbie, I see this doll as the first distinctly Barbie Holiday gal. Wearing a hot pink ballgown to a Christmas party is absolutely iconic. My doll was purchased used so she is missing her hair bow, shoes, child sized ornament and stand. Additionally, she has received a boil wash so her hair is straight. The silhouette of this doll is a more exaggerated and campy version of Barbie’s signature look in the 1990s. The sleeves are massive, with a tight bodice and a flared out skirt. I like this gown a lot more than the 1988 dress because the materials are much softer and look nicer on the doll. This release was also the first Holiday Barbie to have a Black variant, who is absolutely gorgeous but unfortunately a lot harder to find.<br><br>- Daniel",  

"7": "The Marine Corps dolls were a part of the military series that released throughout the late 1980s and early 1990s. This doll included a stand, a sheet of cardboard accessories, and a pair of black standard Barbie pumps. I bought this Barbie still in the box, and 32 years in a box was not the best condition for this poor doll to stay in. Everything was fine when I took her out and cleaned her, but a week later when I looked at her on display, I noticed that her shoes had mysteriously broken into pieces. I’m not a scientist so I have no idea how plastic degradation works or any other reason for this. Additionally, I don’t really care that much about this doll because I am not a fan of the US military industrial complex, so I am not proud to essentially own merchandise for it. However, this doll is very unique because she has such short hair. Barbies from this time usually have really long hair which I love, but it also feels refreshing to see some variation.<br><br>- Daniel", 

"8": "When I look at this doll, I think of RuPaul. I doubt designer Kitty Black Perkins was inspired by the Supermodel (fracker) of the world, but I think it’s a fun thought. This doll was released as a part of the Classique collection, which was themed around high fashion and highlighted the doll’s designer. This doll has very short rooted eyelashes, and mine has a massive shiny mark on her forehead. The dress is very tight and limits leg movement but she is meant to be put on display or kept in the box so I can’t complain. Normally, I would really dislike the asymmetry of this dress but something about it, probably how draggy it is makes me love it. The Black variation of this doll has a gold color scheme instead of pink which is honestly a million times better.<br><br>- Daniel", 

"9": "The 1993 version of Holiday Barbie features a floral motif in her gown. Unfortunately, it is not well constructed, as the elastic straps dry rotted by the time I freed her from her cardboard and plastic prison. Instead of sleeves, this Barbie has a large floral arm band on each side, I think they are intended to sit by the bicep but mine tend to fall to the elbow region. While this is an interesting silhouette, the garment does not fit properly so the bodice does not like to stay on. My doll has been boil washed, so her hair has lost its curl. My favorite thing about this doll is her green eyes. A lot of Barbies in the 90s have green eyes, so this isn’t a rare feature, but I still love it.<br><br>- Daniel",  

"10": "I’m not sure if I should consider this doll to be a 90s version of my beloved 1976 Superstar, but that’s honestly why I bought her. This doll has an award show theme, including a faux doll-sized movie poster and a tiny award. She also contains a little cardboard ornament. Structurally, this doll’s dress does not really work. The bodice is too tight to fit properly, and the straps were clear elastic that dry rotted, so it does not like to stay on. I think it is a very interesting design for a dress, and I do like it, but it just doesn’t fit her. The hair accessory matches the pattern of the skirt. I love the mullet bangs on this doll, which is why I have not boil washed her before taking the picture.<br><br>- Daniel", 

"11": "I can never remember the name of this doll, so I call her Dianne. I usually don’t give my dolls names because I am an adult and also because it would be impossible to keep track of them all. Regardless, I think this doll looks like a Dianne. She was released as the Winter portion of the Enchanted Seasons collection. My doll was bought used so she is missing her shoes and stand. I removed her hair fascinator to wash her hair thoroughly. Some of the sequins have fallen off the bodice but the garment is so busy that I think it’s hard to notice. My favorite part of this doll is her hair and makeup. I love her short curly hair and her striking blue eyeliner. I do find it funny to say that Dianne is homophobic but she’s still a very special doll in my collection.<br><br>- Daniel", 

"12": "The Spring iteration of the Enchanted Seasons collection is absolutely gorgeous. Not pictured is her hat, which I removed in the cleaning process. I am also missing the basket, stand, and one of the shoes. I love the curly blonde saran hair on this doll. I also adore her dress, but I personally think it would look better without the fake flowers attached to the bodice. I think that looks a little weird but I guess the dress would be pretty plain without it.<br><br>- Daniel",  

"13": "The 1994 Holiday Barbie has interesting hair, as it is mainly kanekalon with saran highlights. The dress is very gaudy and drag-y, and Mattel was a little cheap, putting fabric on only one side of the underskirt. This dress has a very unpleasant texture in my opinion. I really like how Barbie looks in this shade of gold, and the green accents complement her eyes very well. The earrings are very subtle but clearly festive.<br><br>- Daniel",  

"14": "This poor Skipper doll was stuck in her box for nearly 30 years, and I am partially responsible for that. I found her still sealed at a thrift store as a child, but I assumed that keeping her in there would keep her financial value (the one true priority/s) so she stayed in that box for another decade. When I finally opened her, I noticed that there was a small perfume bottle inside. That went straight in the trash because any fragrance older than I am surely cannot smell pleasant. Anyway, this doll was released alongside Barbie and her friends, so this was more of a little-sister-tagging-along moment. The body on this doll is very fragile and the top layer of her leg’s plastic ripped in storage which I suspect came from her tenure in that box. The top of this bathing suit is too big and does not stay on which is very frustrating. However, this doll is currently my only Skipper so she is very special. Also, I think this face was a huge upgrade from the previous Skipper face mold, which is serving fivehead.<br><br>- Daniel",

"15": "Purple is my favorite color, so this was a wish list doll until I found her. This doll is technically considered \"special edition\" but like most 90s Barbies she is very easy and cheap to find. The doll does not come with a stand unfortunately, so I wish they did not bother with the \"special edition\" label. Apparently, she is not special enough to display standing up. My opinion of this outfit is entirely biased because I am a simple man. I see a doll with brown hair wearing purple and I instantly love it. The massive tacky jewelry makes this doll even better and breaks up the monotone of purple.<br><br>- Daniel", 

"16": "The Hula Hair line featured Barbie, Black Barbie, and Teresa with bright colorful hair. They also have more flexible bodies that have not held up well. I’m missing the skirt. This doll’s neck broke and was the first doll neck I repaired with acrylic. I didn’t paint over the patch in case I decide to redo it in the future. I’m not sure if this doll is appropriating anything so I don’t want to say anything super affirming, but I cannot deny how slayful this Barbie’s hair is.<br><br>- Daniel", 

"17": "This is one of the most common Barbies to find in the box second-hand. Interestingly, this is the only instance where brunette Barbie was the primary or \"default\" Holiday Barbie because the blonde variant was mail order only. However, there are misprinted versions of the brunette Barbie where she has blue eyes on the box. Regardless, the doll itself is financially worth very little. My doll is pictured without the tiara that is sewn into her hair because I removed it to clean her. I also boil washed my doll, and because she has kanekalon hair the original curls went straight. Personally, I think this is an odd outfit choice because the arm wrap severely limits movement but as a brunette girlie, I have a soft spot for this doll.<br><br>- Daniel", 

"18": "Before Barbie in the Nutcracker premiered in 2001 as the first of the 21st century Barbie movies, there were a couple of \"playline collector\" edition dolls themed after the late 19th century ballet. Interestingly, in the Barbie adaptation, Marzipan is a horse. This doll features the Mackie face mold (as in the designer Bob Mackie). My doll unfortunately no longer has straps on her bodice because they were originally clear elastics (guess what happened to them). Additionally, this doll has a similarly elastic body to Hula Hair Barbie, only with high heeled feet (and not tanned). This doll was very clearly intended for kids to keep in the box because she does not stand property on the included stand. I understand that she’s doing ballet, but it still frustrates me. Regardless, this doll is absolutely gorgeous and aesthetically I love everything about her.<br><br>- Daniel",  

"19": "Pretty in Plaid was a slim boxed line released in 1998. Apart from the Black doll, they all feature the Mackie mold. My doll is missing her dress and shoes. Judging by her age, I must have received this doll second hand as a child. She has the 1966 Twist N Turn body that looks a bit dated with her face. TNT bodies look very drag to me which I love, but I don’t think that was the vibe Mattel was going for with this line.<br><br>- Daniel", 

"20": "Angelic Inspirations was one of the many playline collector dolls released during the late 1990s. She was packaged with some inspirational cards and a dove figurine. Despite being a \"collector\" doll, this Barbie has a gimmick. Apparently, Angelic Inspirations Barbie can balance the dove on her hand. I have not been able to get this to work in a way that looks natural. Honestly, I have had better luck balancing the bird on Barbie’s head. My doll is the Black variant, and she has the Asha mold. The Asha mold is my all-time favorite Barbie face, so I was ecstatic to find this doll still in her box. The underskirt of her dress faded a bit while I washed it but this doll is still an absolute gem in my collection.<br><br>- Daniel", 

"21": "Despite never being married, Barbie has been a bride many times. I wonder if these are alternate universes or Barbie and Ken keep having cold feet. Regardless, Barbie absolutely slayed this wedding dress. This is the earliest appearance of the Generation Girl face mold in my collection, and I think she looks absolutely stunning. The wedding dress is very conservative, but it still looks very modern and stylish.<br><br>- Daniel", 

"22": "The 2000 iteration of Holiday Barbie was actually called Celebration Barbie. It wasn’t until 2004 that the name officially became standardized as \"Holiday Barbie\". Not pictured is a Christmas ornament and a metal crown that was originally sewn into her hair. I’m not very good at sewing and she has kanekalon hair, so I didn’t bother to put it back. Everyone who sees this doll tells me she looks homophobic. I don’t get it but I do think her dress is ugly. She does have a very pretty face though.<br><br>- Daniel", 

"23": "Stroll N Play is a childcare gimmick doll where Barbie takes her baby sister Krissy and Krissy’s friend for a walk. The double stroller can be converted into a play gym and plain car seats. I’m not really sure why Barbie is held responsible for caring for her infant sister and this other unnamed baby. Whatever the story is, Barbie slayed this look. She has articulated elbows which are common in childcare dolls and that made identification significantly easier. She also has crimped hair that feels very 2000. I got this doll second hand as a child, so unfortunately I do not have any of her pieces. I wish I did, because her original outfit is incredibly tacky in the best way.<br><br>- Daniel", 

"24": "The Sunshine Day dolls were a slim box line released in 2001. They have a 60’s inspired theme and feature special printed white underwear. My doll is missing everything, her dress, shoes and purse. This Barbie took me months to identify because it was hard to find pictures of the doll with the distinct underwear. But I was able to do it all by myself (please clap). This doll has really distinct turquoise eyes, which is my favorite feature. My doll is wearing the Storytelling Inspired by Roxy: Matching Floral Top & Pants fashion pack. It’s twenty years newer than this doll but I think the pattern brings out her eyes.<br><br>- Daniel",  

  "25": "The 2002 Birthstone Collection featured 36 dolls representing the 12 birthstones. Each outfit was the same, only the color changed to the respective birthstone. Each month received three dolls, at least one white (usually blonde) and one Black with the Goddess face mold. This was a collector release. My doll is the Black doll representing February. I did break her neck after a boil wash, but I managed to save all the pieces, so she was able to be repaired without the use of acrylic. In my opinion, this is one of the most beautiful dolls in my collection; I love absolutely everything about her. She’s also very special to me because I found her alone still in the box at a flea market and February is my birthday month.<br><br>- Daniel",  

"26": "The 2002 Birthday Barbie is almost identical to the 2001 Happy Birthday Barbie. The only differences is that the 2001 dated doll has the 1991 body while my doll has the 1999 body. Additionally, the child sized crown in the 2001 release is silver while the 2002 one is hot pink. The 2001 doll has a more simplified skirt with no printed pattern and purple mesh while the 2002 doll has a printed ribbon patterned skirt and pink mesh. The bows on the waists are also very different. The 2001 bow is smaller, a darker pink, and off-center compared to the 2002 doll. The cardboard presents that both dolls came with have different patterns but are otherwise the same. Unfortunately, my doll’s cardboard present did not survive 21 years of living in a box. The elastic holding it in place dry rotted and stained the cardboard, so I did not keep it. The ribbon in this doll’s hair also did not survive because it was originally attached to her hair entirely with an elastic that has dry rotted. Most unfortunate of all is that when I was cleaning this doll, her arm snapped off. I am able to get it to rest in place for display and it was previously glued back into place but when I took the picture of this doll her arm broke off again. That’s very unfortunate.<br><br>- Daniel", 

"172": "2003 Ballet Star Barbie was one of many budget slim boxed ballerina Barbies sold in the early 2000s. This one is very interesting to me. First of all, this line reuses the name of a standard released Barbie released in 2000, and then again in 2001. Barbie reuses names all the time but I was surprised it was done so soon without any connection between the lines lore-wise. What I find most interesting about this doll is the body that she has. She has the 1966 Twist N Turn body which was in the process of being phased out in this era. Additionally, she has stiff, non-bending legs which is uncommon for the early 2000s. Her legs are painted to give the illusion of colored tights that match her leotard. Another interesting part of this doll is her arms. They are the pre-Superstar straight arms that were the standard for Barbie in the 1960s and 70s. She reminds me a lot of the My First Barbies from the 1980s (I only have the 1980 one). Other than the Generation Girl mold and the ballet theme (although some My First Barbies were partially ballet themed), the biggest difference is that this doll has full neck articulation which really surprised me. I wonder at what point the stiff neck was considered a worthwhile cost-cutting measure. Interestingly, Barbie is the purple themed doll in this line while Teresa is the pink doll. This is just a lot of weird decisions only I would find interesting. I think this doll has such a beautiful face but I don’t think her makeup matches her outfit well.<br><br>- Daniel", 

"27": "Jamin’ in Jamacia was the first My Scene movie. My Scene was a Barbie adjacent line that was released as a response to Bratz in 2002. Until the 2009 legal ruling that Bratz was property of Mattel, My Scene existed as a Barbie version, where the dolls had Barbie bodies but larger, much more Bratz-like heads. The shoes were sized so they fit on standard Barbies feet but appeared oversized similar to Bratz dolls. As a result, My Scene dolls end up being very tall while fully dressed. In the My Scene universe, Barbie is the main character, and the other dolls are her friends as they live in New York city. My Scene also carried over elements from the Generation Girls line that was canceled because of 9/11. In this movie, the My Scene characters take a trip to Jamacia to participate in a music contest. Madison, this doll, is the manager of the band. I got my doll used and unfortunately, I do not have a single piece to this doll other than the doll herself. Madison originally came with a DVD of the movie, a doll beach chair, two outfits and various little accessories. I wish I at least had one of her outfits, but she has really gorgeous distinct makeup so it’s ok. My doll is wearing the dress of my childhood Sporty Style Madison doll that is unfortunately no longer with me. I don’t know what happened to her but I’m very glad her outfit gets to stay with the character.<br><br>- Daniel", 

"28": "This doll was released in 2003 as part of the first wave of the DC Comics collection. The second wave also included this doll, but the release was exactly the same and I do not still have the box so I cannot check the box dates, so I went with the older release. She was also released with a motorcycle playset, but the doll had a standard Barbie body. The single doll release, which I have has the Ever Flex body. The Ever Flex body was a short lived sculpt from the 2000s that put wires in the doll’s arms and legs for additional flexibility. In the 1960s and 70s, Barbie’s younger siblings Tutti and Todd (rest in peace) had similar leg mechanisms. Many of the pieces to this doll disappeared, but I still have one of the boots. I know nothing about superheroes or comic books. I am not interested in learning about superheroes or comic books. I got this doll with Barbie as 2004 Barbie as Poison Ivy as well as 2006 Sesame Street Tickle Me Elmo Barbie (rest in peace queen) as a very young child.<br><br>- Daniel",  

"396": "One of the most iconic beach lines of the early 2000s was Cali Girl. Barbie and her friends (and Ken) spent a lot of time on the California beach. The dolls have a significant tan compared to the other dolls of their time. There was also a lot of associated media with the Cali Girl line such as a flash game on Barbie.com and 2 tie-in CDs. There were many spin-off lines and playsets such as a car and ear-piercing dolls. In my opinion, this doll is much nicer than the Cali Girl Barbie released in the following year, both due to the lack of horrible massive feet and her much prettier face. This doll used to belong to one of my close friends so I will forever appreciate his generosity in giving her to me.<br><br>- Daniel",  

"29": "This doll was part of the second wave of DC Comics dolls. Unlike Barbie as Batgirl, Barbie as Poison Ivy has a completely rubberized body. I cannot figure out the name for this body type unfortunately. Her hair feels very cheap, I initially labeled it as polypropylene, but I think it’s more likely to be saran in dire need of a boil wash. I lost almost all the pieces to this doll almost immediately as a child. I think I only have one of her arm bands now. I have absolutely no memory of the lunchbox keychain so that was probably the first item to go.  I still have no interest in superheroes, but this doll is special because of her unique body and how long I’ve had her.<br><br>- Daniel", 

"319": "The 2004 release of Cali Girl Barbie is distinct from her 2002 version for multiple reasons. First, Ken is gone and has been fully replaced by Blaine, who is Australian and the brother of Barbie’s friend Summer. Barbie now wears a blue themed ensemble and has the cursed massive flat feet. She along with the other dolls in the line smelled like lotion. Both of my dolls previously belonged to my close friend who gave them to me because he is a normal adult that does not keep dolls. The previous life of at least one of these Cali Girl Barbies was just as cursed as her horrible feet. I don’t think Jonah wants me to include it in this description. Honestly, I think both of my dolls are pretty ugly but at least they have kanekalon hair.<br><br>- Daniel", 

"30": "This doll was released as a part of a bridal collection in 2004. Barbie was once again a \"Beautiful Bride.\" Barbie was a full-sized release, bundled with a wedding cake and hair accessories. Ken was sold in a slim box because he’s just Ken. I have the Black variant, and I am missing his suit jacket and shoes. I really appreciate the fact that this doll has an articulated waist, but I wish he came with an accessory. No wonder Barbie keeps calling off their wedding. Interestingly 2004 was the year that Barbie and Ken first announced their breakup. My theory is that Barbie was so fed up with Ken’s mediocrity at their many weddings that she ended things for good (until 2011). I distinctly remember my sister finding this doll second hand when we were children, so I am not to blame for how loose this doll’s joints are. I don’t have a lot of Ken dolls though, so I’m still glad to have him in my collection.<br><br>- Daniel", 

"31": "Holiday Barbie peaked with this doll in 2004. This doll marks the first time Holiday Barbie was officially called \"Holiday Barbie\". This iteration was also the first Holiday Barbie to come with multiple dress versions. The standard one is the green dress my doll has. However, there was also a Sears-exclusive version that featured the same dress in red. This doll was probably designed to be left in the box, as the straps of her top stop halfway and are attached with elastic. Due to being about 18 years old when I opened her, the elastics crumbled. My doll is pictured without the beads tied into her hair. They match the color of the entire ensemble. This is my favorite Holiday Barbie of all time. I think she is absolutely beautiful, and in my opinion, this is the best gown she’s ever worn.<br><br>- Daniel", 

"32": "Beach Fun was a slim boxed line that reused the name of a 1978 foreign release. The 2005 line was sold in the United States and included multiple versions of Barbie and Summer. The Ken in this line was also advertised as featuring his new look. It seems like both Barbie and 5-year-old me chose Blaine over Ken, despite the new look, because I distinctly remember picking out this doll in a Walgreens with a revolving door. All the dolls in this line including Blaine came with a bottle of lotion, I can’t tell if its sunscreen or suntan lotion because my doll’s bottle is long gone. This is sentimentally my favorite male doll of all time.<br><br>- Daniel",  

"320": "This is one of the many ballet themed Barbies released in the 2000s. This was also a sister gimmick doll and featured unique articulated ankles. Her feet also featured painted-on ballet shoes. Mine have started chipping. The ankle articulation has also become loose over time. This doll was sold with a Kelly that also had ballet mechanisms. I don’t have any of the clothing pieces to this doll unfortunately. I received this doll as a gift from my friend, who had this doll as a child. I really appreciated getting this doll from my friend because I have a lot of memories of ballerina Barbies from my childhood.<br><br>- Daniel",  

"33": "Beach Glam was yet another slim boxed beach line released in the 2000s. This doll is unique because her purse is part fabric, beach towel fabric to be specific. She also has very large hoop earrings that are non-removable. Her facial screening is also very unique and undoubtedly the best use of this face mold. Unfortunately, this doll also suffers from the curse of the massive flat feet which is absolutely the worst part of this doll. I think she would be perfect if she didn’t have those horrible feet.<br><br>- Daniel",  

"34": "The Mascarade series was released a couple times with different packaging throughout 2006. Some of the dolls had different face molds. Unfortunately my doll has the mold that was used twice so I can only use my best judgement of my memory. I believe my doll came in the Gold Crown box. The packaging does not explicitly label this doll as a Sleeping Beauty, nor do any of the other dolls have specific fairytale princesses attached to them. However, I’ve seen this doll labeled as Sleeping Beauty as a commonplace nickname so that’s what I labeled her as. All my doll’s accessories are long gone but I don’t remember playing with them much. I remember as a child mistaking this doll to be Erika from Barbie in the Princess and the Pauper. It was mainly because my friend at the time also had this doll and called her Erika. This doll has the weird face mold that peaked with 2006 Beach Glam Barbie but I think she still looks pretty. Just not as pretty as Beach Glam Barbie.<br><br>- Daniel",  

"35": "The Mini Kingdom line included mini Barbie dolls themed after the Barbie movies out at the time. The line seemed to focus entirely on the princess movies. Maybe they couldn’t get fairy wings to work at that scale. The gimmick of this doll is that she came with both fabric clothes and a plastic outfit that snaps together. I only have the plastic outfit unfortunately. Fortunately though, Barbie’s shoes are molded on so I didn’t lose them. I really love that this doll’s face is a smaller version of the face mold that was used at the time. I think it makes the doll look really nice. I do wish I had the fabric clothes though.<br><br>- Daniel", 

"36": "This was considered the \"signature\" doll in the 12 Dancing Princesses line. It was a tie in with the 12 Dancing Princesses movie. This doll’s gimmick was that her skirt lights up and turns. Even when this doll was new, I could never get the mechanism to work. I have since removed the batteries during the cleaning process because they were long dead and also gross. I didn’t bother replacing them because I’m honestly not bothered. I am missing her cat and her ballet slippers broke off the plastic ribbons when I was very young. She has also had a pink stain on her forehead since I was a child that I haven’t had the time to remove yet. This doll is very special to me despite all her flaws, and I never want to part with her.<br><br>- Daniel", 

"37": "In the 2007 movie Barbie as the Island Princess, Luciana is the arranged fiancée of Prince Antonio (Ken). She is essentially a pawn in her mother’s schemes. There is a song that explains the lore featuring some CGI mice that goes so hard. This doll is interesting because only one of her elbows are articulated. I’m pretty sure this is so she can hold her cat (that came with her). I no longer have the cat or anything else belonging to this doll unfortunately. She also sings when you press the pendant on her necklace. I took the batteries out when I cleaned my doll, so she no longer sings. I think this doll looks a lot like Natasha Lyonne but I might just be delusional.<br><br>- Daniel",  

"38": "This doll was released as a part of an elephant toy. Kelly, along with blue Kelly have magnets on their feet that allow them to swing on the elephant trunk and land on the elephant’s back. I no longer have blue Kelly or the elephant. I also no longer have purple Kelly’s shoes. In the movie, Tika the elephant is one of Rosella’s (Barbie’s) talking animal friends from the island. Tika is not happy that Rosella is falling over with the prince because she feels like she’ll get less attention. I haven’t watched the movie in several years, but I don’t think people like this elephant very much. The Kellys are the younger sisters of the prince and because they are young children, they think the animals are cool toys to play with. I guess they were right in this case. This doll is my sole surviving childhood Kelly, so I appreciate her for that, but I don’t really have an opinion of her otherwise.<br><br>- Daniel",  

"39": "By 2007 My Scene was in a weird position. Mattel and MGA were going through legal proceedings at the time and Mattel was very close to gaining the rights to Bratz. Carter Bryant, the creator of the Bratz franchise, was employed by Mattel at the time he drew the original concepts. Mattel argued that his employment automatically made his designs property of Mattel. In 2009 the courts ruled in Mattel’s favor, and Bratz were off the shelves. However, this ruling was later reversed. Anyway, at this time, My Scene was essentially becoming obsolete since Mattel no longer needed Barbie to compete with Bratz. In 2006 Barbie left the My Scene universe because she \"moved away\" to California. The night before Barbie moved away, she and her friends met Kennedy, who happens to look identical to Barbie. As far as the physical dolls go, Kennedy is just Barbie with a different name. I’ve spent a lot of this description detailing the state of the My Scene brand because there just aren’t any details about the Sailor Sweeties line. It has a nautical theme, and the sailor tattoo motif makes many appearances between the two dolls in the line. There isn’t any associated media and the only text on the box is a tongue twister. Also, the line was alternatively named \"Ocean Chic\". Like my other My Scene dolls, I am missing everything to this doll except her earrings. The temporary tattoo is long gone, but the clothes and accessories have also mysteriously disappeared. I’ve had this doll for a really long time, but my childhood memories are hazy because I was very young in 2007.<br><br>- Daniel",  

"40": "See my description for Sailor Sweeties Kennedy to explain the state of My Scene in 2007.During that whole debacle, My Scene collaborated with Adidas to design a line of dolls participating in various sports and wearing respective Adidas branded outfits. Kennedy does yoga, Chelsea skateboards, and Madison and Nolee play tennis (in the same outfit. For some racist reason My Scene really liked making the two non-white main dolls share an outfit because this is not the only time this happened.) As a child, I received the Kennedy and Madison from this line (I guess I was not interested in skateboarding). Unfortunately, I no longer have the Madison doll because she mysteriously disappeared, but I do still have her dress. Please forgive me Jonah. I no longer have any of the pieces to this doll, but I have distinct memories of Playing with the yoga mat that came with her. I love this doll’s makeup. This era of My Scene has the most beautiful faces.<br><br>- Daniel",  

"321": "As a child, my favorite Barbie movie was the Princess and the Pauper. This was years before the memes, but I was a Preminger stan back then. I was very upset at the time (around 2009-2010) that the original Princess and the Pauper Barbies were no longer sold in stores. Luckily for me, a 2007 version of the doll was rereleased and available at the time. The doll is much more simplified than the original release and she has a different face mold, but the dress is undoubtedly Princess Anneliese. I can’t exactly remember which version of this doll I have because the doll itself is identical throughout the releases (although I believe that they all have the same box date). I think I have the doll that came with the extra outfit, but I don’t have the outfit so I can’t confirm for sure. I absolutely do not have the version that came in a multi-pack with Erika and two Kelly dolls. Honestly, I don’t think this face mold is very flattering for Anneliese, especially compared to the original doll with the Generation Girl mold. My doll also has a slight stain on her forehead I’ve been too lazy to remove.<br><br>- Daniel",   

"322": "Candy Glam was a scent gimmick line released in 2008 and featured Barbie and her friends themed after different candies. The doll would come with multiple accessories including lip gloss and key chains to store the lip gloss for the child. I can’t see a reference to it on the box, but apparently this line is associated with Fashion Fever, which weas the main fashion Barbie line at the time. Interestingly, everyone except Teresa received a budget version with the new addition of Nikki who reused Barbie’s outfit. As a child, I received Summer and Teresa, but obviously I no longer have Summer. Teresa is lemon lime themed. I no longer have any of the key chains or lip gloss, but I’m not upset because that’s disgusting. I am also missing her cropped jacket, belt, shoes, bracelet, purse, and drink. This doll has the gorgeous sparkly eyeshadow I love on 2000s Barbies. She also has kanekalon hair which I love very much.<br><br>- Daniel",  

"323": "This is a hair gimmick doll that was weirdly themed after the Barbie Rapunzel movie, despite that movie being 6 years old at the time. As part of the gimmick, this doll comes with faux hair extensions and plastic connectors tied into her hair, but I took them out while cleaning because I didn’t want the elastics to dry rot. It also comes with human sized plastic scissors that mimic hair cutting. My doll’s scissors are long gone unfortunately. Also, my poor doll’s neck broke during the storage era, a.k.a. when I lost interest in dolls as a teenager, but I was able to fix it with acrylic filler. This doll’s face mold is very nostalgic to me, as many of my childhood dolls have it, but its honestly not my favorite. I just prefer the Generation Girl mold.<br><br>- Daniel",  

"41": "I Can Be… was Barbie’s long-running career line that was replaced by \"You Can Be Anything\". I can’t find exact dates for when it switched over, but I assume it’s around the time the flop era started. The whole point was to inspire young people to be high achievers while also unapologetically feminine. This specific doll was a Toys R Us exclusive set that included a DVD that I never watched. I never bothered to learn the lore of Barbie Space Camp, so I don’t have much to say about that. Since this was a doll I got as a child, I’ve lost most of the accessories. I actually found another top for this doll at a flea market. I think this doll has one of the nicer facial screenings on this face mold so I’m quite fond of her.<br><br>- Daniel",  

"42": "This is the signature Barbie doll released alongside the movie Barbie in a Fashion Fairytale. In that movie (which wasn’t very good), Barbie takes a break from filming movies to visit her fashion designer aunt Millicent in Paris. At some point she finds a magical wardrobe with fairies that transform clothes when they’re placed in the wardrobe. This doll is modeling one of the dresses. At the fashion show at the end of the movie, Barbie models this pink dress that transforms into a much sparklier light up dress. This doll’s gimmick is that she can transform her dress by switching it around. I pictured my doll wearing the sparklier dress because that’s her signature look for this \"film\" but personally I prefer the other dress. Probably because it’s more symmetrical and also baby pink. I don’t love the mechanics of this doll because the battery pack is stored in her legs, so she has a molded-on skirt to hold the batteries. As a result, the legs have almost no movement. Like all my dolls I took the batteries out, so this is useless to me. My doll has a chipped eyebrow because Mattel got a bit lazy with the face paint sealer in the early 2010s. She’s still pretty but I wish the gimmick to this doll wasn’t so tacky.<br><br>- Daniel",  

"327": "Barbie in a Mermaid Tale is a movie where Barbie plays a surfer who finds out her mother is an enslaved mermaid queen. Hadley is one of her friends in the human world before she realizes that she’s half mermaid. Hadley doesn’t do much, but she does answer a science question via Skype halfway through the movie. This doll has a couple things against her. First, she has the horrible big feet. Also, she has glue seepage (thankfully my doll only has it in the back). The worst thing about this doll is that she doesn’t have an official name. That’s why I put her name in quotes. I have a lot of memories of taking this doll swimming as a child. Of course, she wasn’t as cool as the main Barbie in a Mermaid Tale Barbie that had color changing hair and a transformative outfit, but that doll is lost (rest in peace) so this is the best I can do right now. I’m joking, I still love this doll very much.<br><br>- Daniel", 

"43": "The late 2000s-early 2010s era of Barbie Fashionistas are some of the most iconic Barbie dolls from my childhood. Unfortunately I no longer have most of the dolls but I still have this one. Shopping Spree was a sub-line where some of the characters (which were named different adjectives related to their fashion tastes) obviously went shopping. Sweetie here is shopping for accessories. Unfortunately I no longer have any of the merchandise or any of her clothes. Honestly, I don’t mind very much because her outfit is very mid compared to her face. The side glace on this doll is absolutely gorgeous. I have another word I want to describe this doll with but I don’t think I’m allowed. For me, side glances are like the anti-asymmetrical clothes because they make me love a doll a million times more. I don’t remember this doll well because I’m pretty sure she was my sister’s, but she’s so beautiful so she is never getting this doll back.<br><br>- Daniel", 

"44": "Because Barbie can hold any job, in 2009 she decided to become a racecar driver. And a gorgina one at that. She came with a pink helmet which advertises the only sponsor she needs: herself. She also came with a trophy, but I think I broke that years ago. Barbie also came with the commonly used 2000s black scrunch boots but my dog chewed them so I didn’t make her wear them for the picture. This Barbie usually wears her hair in two ponytails, but I forgot to replace the elastics. I really love this doll. I picked her out because my friend had her and I was obsessed. I think that friend got mad at me for copying her but honestly it was absolutely worth it.<br><br>- Daniel",  

"393": "In celebration of Barbie’s 50th birthday in 2009, there were many dolls produced in tribute to her most iconic looks. This doll is an homage to my favorite Barbie of all time, 1976 Superstar. The 2009 doll is essentially a modernized version of the original look. Barbie is essentially wearing the same dress, but it is much shorter. She also has newer shoes. And most notably, this Barbie has an updated face mold and facial screening. Her makeup is the same scheme as the original doll but in a much more 2009 version. If these were real makeup looks on real people I would describe it as the same look created with different techniques. This doll combines my favorite fashion doll with the look of the Barbies of my childhood. Because of that, she means a lot to be part of my collection Her body is very cheap quality with the hollow unarticulated legs but she entertained Jonah when I showed him this doll so that must earn bonus points.<br><br>- Daniel", 

"45": "Avon Rose Splendor was (obviously) released exclusively through Avon. These are technically considered \"collector\" dolls, but they are worth very little. I got my doll new in the box for $15. This doll is very beautiful, and I love the pattern on her dress. However, her hands do not rest nicely on the waist due to the shape of her dress. I also don’t love the shape of this dress because it’s asymmetrical. It does have a very nice texture though. The earrings of this doll remind me a lot of Elizabeth Cole from American Girl, and considering Mattel manufactured both dolls I wonder if there was any connection. This doll also has a side glace which puts her in the top tier for me. Miss Rose Splendor looks MEAN and I love her for it.<br><br>- Daniel", 

"46": "The 2010 version of Holiday Barbie is the Holiday Barbie I have the most childhood memories of. It was released once again as a playline collector doll. That means that it was sold in stores alongside playline Barbies but it’s packaged and priced as a \"collector\" level. My sister and I both got one in the after Christmas sale. Unfortunately, I broke the earrings and the wrap of my doll almost immediately and I swapped the pieces with my sister when she wasn’t looking. I don’t think she would’ve cared much anyway. I’m not sure what happened to either of these childhood era dolls. One of them definitely fell victim to my haircutting era which is a massive shame. Regardless of what happened to those dolls, I hope they rest in peace. My only complaint about this doll is the lack of stand and how fragile her jewelry is. However, both the face and the dress of this doll are immaculate. I adore the embroidery on the bodice and her makeup looks gorgeous. This doll makes me question my dislike of asymmetrical gowns.<br><br>- Daniel", 

"47": "This doll was one of the many career dolls released in the early 2010s under the \"I Can Be\" line. She was released both individually and as part of a 4-pack with chef, doctor, and ballerina Barbies. I have the single doll release. I believe that the 4-pack version has a different lip color but I’m not 100% sure. I don’t have any of the pieces to this doll anymore, but I have distinct memories of the accessories. That’s the main reason why I know this doll was from childhood. Miss Pet Vet Barbie was definitely my sister’s doll because I have no memories of playing with this doll myself. She also has a bit of glue seepage which is especially noticeable on her bangs. They are very much of the year 2010. That’s probably the best way to describe this doll.<br><br>- Daniel",

"48": "This doll was released in a 2-pack with Ken. This release was marketed as Barbie and Ken finally getting back together. Barbie wears a modernized (for the time) version of her original 1959 black and white swimsuit. She also came with flip flops and sunglasses. Her earrings were also a tribute to the original Ponytail #1 with the silver hoops, only they are now non-removable. It’s a good thing the original doll’s earrings were removable or else every Barbie #1 would have green ears (from a chemical reaction between the plastics). Unfortunately, my doll has major glue seepage in her hair which is an absolute headache to take care of but I did my best. I also no longer have her outfit which is very unfortunate. I have a huge bias in favor of Barbies with side glances so this doll is one of my favorite.<br><br>- Daniel",  

"49": "This Ken was released in a 2 pack with Barbie to celebrate them officially getting back together. He wears pink ombre swim trunks in homage to the first Ken doll from 1961, though I would consider the original swimsuit to be red. Also like his original release, this Ken comes with a small beach towel. He also has a black watch and black flip flops. This Ken’s facial screening is unique because he has a lipstick mark on his cheek matching She Said Yes Barbie’s lip color. Due to the limited articulation of this doll, this Ken has very limited movement. As a result, he is not very good at the Wuthering Heights dance (unlike the creator of this website). This doll is unfortunately completely outshone by his girlfriend. Maybe he and Jimmy Paul Roxxi can start a support group.<br><br>- Daniel",  

"50": "This Stacie is a camping doll that came with a tent. I no longer have the tent because it was very flimsy. This is the only Stacie doll in my collection; she wasn’t really around when I was really into Barbie and by the time the sisters line became prominent, I had moved on to Monster High. She also has a loose neck joint that I could fix but I don’t have any fishing wire and I am also lazy so I couldn’t be bothered. I’m not sure why this doll was sold without a Barbie because Stacie is supposed to be around 12 and I don’t think she should be roasting marshmallows without adult supervision. I guess Barbie was too busy taking care of their infant sister and someone else’s unnamed baby.<br><br>- Daniel", 

"328": "Barbie: A Perfect Christmas is a holiday movie released in 2011 where Barbie and her sisters get snowed in a hotel in Minnesota. Minnesota is everywhere. This doll was sold exclusively at Target. There was also a 4-pack version that was sold in a singing playset with Skipper, Stacie, and Chelsea. The dolls appear to be identical and have the exact same outfits. The single release came with a plastic gift box while the bundle version came with a microphone. I have two of this doll as a result of my sister and I both getting one for Christmas as children. I’d like to believe that the wonkier one was my sister’s, but I honestly have no idea. Obviously, the wonkier one is ugly, but my other doll is very pretty. Both of my dolls have glue seepage unfortunately. This outfit is very camp and I love it.<br><br>- Daniel", 

"51": "In 2012, Barbie returned as Merliah in Barbie in a Mermaid Tale 2. I have so many memories of the first Barbie in a Mermaid Tale but I remember nothing about the sequel. Ironically, I lost my first movie doll but I have two of the second movie doll (the other was originally my sister’s). This doll features the gimmick where her surfboard transforms into a mermaid tale and vice versa. I’m not sure what happened to either of the mermaid tales at this time. In order to accommodate the gimmick, Barbie has extra articulation in her knees and ankles which gave me many options for play as a child (though I mostly made her do taekwondo). This isn’t reciprocated with the arms though, which only have the standard shoulder articulation. Both my dolls have glue seepage now, but it is much worse on one of them. This doll is very nostalgic to me and I honestly like her molded on bathing suit.<br><br>- Daniel", 

"52": "Couture Angel was a Pink Label (essentially playline) collector doll released in 2011. It followed another doll with the same name released in the previous year. Honestly the 2010 version looks a lot nicer and higher quality. No matter how I pose this doll she looks weird, and (this is a very petty complaint) her halo (that does not like to stay on by the way) makes this doll too tall to fit on my Barbie shelf. She has to stay on the top shelf with my Trixie Mattel doll, looking way more important than she is. There’s something about this doll’s face that I don’t like very much. I think it’s the lips. I do really like her dress though. The most memorable thing about this doll is that even though I bought her still in the box there was a tiny dead bug inside with her. Obviously Barbie received a deep clean but that was still very gross and I was not happy.<br><br>- Daniel", 

"369": "Barbie and the Pink Shoes was the 24th modern Barbie movie, released in 2013. Barbie plays a ballerina named Kristyn who has magical ballet shoes. I presume they are pink. An important note is that I’ve seen Kristyn spelled two different ways. I just went with the way the doll box spelled it. To be honest, by the time Barbie and the Pink Shoes was released I was completely checked out from Barbie as a franchise. I was fully in my Monster High era. I thought a movie called \"Barbie and the Pink Shoes\" was the dumbest idea ever. This was my sister’s doll that she received as a gift. She also wasn’t impressed by the concept. This doll features a gimmick where if you spin her hips her skirt flips around and becomes a different color. I think this is a cute and creative idea, but it was a headache to clean. Additionally, Barbie’s leg movement is severely limited by her magical skirt. I do find this doll very cute and I appreciate that she has shoulder-length hair as a change from the typical long style of Barbie movie dolls.<br><br>- Daniel",   

 "53": "This was the second of the two Holiday Barbies I had as a child, although I think only I got this one. I can’t remember. I don’t know how to describe Holiday Barbie without repeating myself so go look at my older Holiday Barbies if you really want that explained again. This doll did not have a stand which is not very slay in my opinion. Her dress also suffers from asymmetricality which makes her lose points in the Daniel’s criterion of perfect dolls official rules. Anyway, this doll has a beautiful face and her jewelry is a lot less fragile than her 2010 counterpart. My childhood doll has received a slight haircut from my childhood. She was very lucky to escape getting all her hair cut off during *that* phase of my adolescence. Unfortunately, her outfit mysteriously disappeared. Luckily for me, I bought another of this doll in a lot of boxed Holiday Barbies so I have a second doll that’s perfect. This doll never got the love she deserved from me because I preferred 2010 Holiday and she still isn’t my favorite doll. She really is very beautiful and I still love her a lot.<br><br>- Daniel",   

"54": "This doll was one of the many times Barbie was a teacher. This time she appears to be an elementary school teacher as Chelsea is her student. This doll came with a chalkboard with lots of storage as well as various accessories related to school supplies. There is some human sized chalk that I broke almost immediately after I got this set. This doll also came with a Chelsea doll that had a mechanism so she could raise her hand. I’m not sure what happened to this Chelsea but I don’t have her anymore L. There was another release of this doll that was very similar but the clothes and accessories were recolored from 2013. The only thing I still have for this doll is her dress. I also had to repair a chip on her neck but it was so small that her head did not come off. I was also very quickly able to remove the glue from this doll because it just crumbled rather than leaked through. I wish this doll was more articulated because it feels a little weird that she can’t bend her arms but she’s specifically supposed to be a teacher and use a chalk board. I also wish that this dress was two pieces but I still like the design. It reminds me a lot of the outfits my teachers wore when I was in elementary school. This was one of the last Barbies I picked out as a child so I really treasure her.<br><br>- Daniel", 

"55": "This Barbie is so generic that she doesn’t even have a name. Her box literally just said \"Barbie\", so I listed her stock number as her name. These generic nameless Barbies became common by the mid-2010s (when Barbie entered her flop era). She has a very cheap, hollow and static body. Her bikini top is too small. Despite the corner cutting, this doll is rooted with saran. 2013 Mattel did not use polypropylene as liberally as they do today. Honestly, the thing I like the most about this doll is that I was able to identify her. There isn’t anything super interesting about the doll itself.<br><br>- Daniel", 

"56": "The 2013 edition of Holiday Barbie came with the return of the doll stands which I was very happy about. Her dress features a snowflake motif and I don’t think that it is ugly, but I really am not a fan of the asymmetry. Once again, the face is the highlight of this doll. The barbie collector dolls from this time have the most beautiful faces. I really enjoy collecting Holiday Barbies and this one is far from the worst.<br><br>- Daniel", 

"395": "In 2019, Mattel released a reproduction of Olympic Gold Medal Barbie, who was originally released in 1975. This was a repackaged Malibu Barbie (who had many repackaged versions herself). She was released in collaboration with the 1976 Olympics. This doll came at the time where Mattel needed to cut corners in their designs to accommodate the rising costs of production. At the same time, the Barbie brand was shifting. Rather than buying one or two dolls and several fashions, Mattel aimed to sell a new doll in each outfit. This doll was reproduced in 2021. I presume that it was intended for a 2020 release to coincide with the Tokyo Olympics but like the Olympics it was delayed by the COVID-19 pandemic. I made this guess because the box date for this doll is 2019. Personally, I find this doll hideous. I was terrified of Malibu Barbie as a child and I didn’t understand why Barbie looked like that while P.J. and Francie looked so much better. I think this is one of the worst face molds Barbie ever had. That being said, I almost bought this doll once before I made the actual purchase. She is so important to the history of Barbie so I still wanted this scary looking doll in my collection.<br><br>- Daniel", 

"57": "The Fashionistas line evolved from being high fashion dolls to diverse everyday budget releases. I really appreciate the fact that Mattel puts the effort into producing diverse and accessible fashion dolls. However, that doesn’t stop me from complaining. I really wish that this doll was more articulated, and her facial screening featured some makeup. Her dress is also very boring in silhouette, it suffers from the common problem modern Barbies have of being shapeless. I still think it’s a very nice pattern and if the Barbie market was not flooded with this type of dress, I would appreciate it more.<br><br>- Daniel",  

"58": "This doll was released in promotion of the 2020 Summer Olympics in Tokyo. Of course, the 2020 Olympics were delayed to 2021 due to the COVID-19 pandemic. The line featured Barbie participating in the sports that would debut at the 2020 Olympics. I bought this doll because she was the closest I’ve seen to a taekwondo Barbie. Fun fact about me is that I have a third-degree black belt in taekwondo, and as a child I would have loved to have a Barbie that participated in the same sport as me. We can’t all be tennis players. I honestly know nothing about karate, but I knew that this was the closest I could get to the one sport I enjoy.<br><br>- Daniel",  

"394": "To celebrate the 60th birthday of Ken, this special edition doll was released reproducing his original look. I bought him from the Mattel Creations website and they accidentally sent me two so I have them displayed together. This doll is extra unique in my collection because he is made of Silkstone. Silkstone is described by Wikipedia as a \"simulated porcelain material\". Silkstone dolls have the weight and feel of a porcelain doll without the fragility. I am very relieved to find out that Silkstone dolls are more durable because I am very clumsy. I honestly don’t have the same interest in male dolls as I do female dolls (which you can probably figure out from the gender representation of this website), but I do really like this Ken. I think 1960s Ken is a lot less scary than 1960s Barbie. I absolutely do not recommend throwing this doll in a pool.<br><br>- Daniel", 

"59": "Barbie Loves the Ocean is a line that boasts the fact that the dolls are made entirely of recycled plastic. The doll feels noticeably different, the head articulation is limited similarly to 1980n My First Barbie. The plastic also feels a little more brittle. I almost broke this doll just while fidgeting with her. The packaging for this doll was also 100% recycled so it was made entirely of cardboard. As a result, the doll could be touched before opening. I really appreciate the conservation effort but at the same time I don’t want strangers touching my dolls before I buy them. I specifically picked my doll because she had messed up hair that I knew I could fix. I was so happy when I realized she had saran. I’m not sure if the hair is recycled but I’m not complaining. My doll is blonde, white, and wears a purple dress. She does not have an official name which is why I included the stock number. This doll also came with a pair of sunglasses and some Birkenstock shaped sandals. As someone who almost exclusively wears Birkenstocks I was delighted when I discovered this. The makeup on this doll is questionable but the novelty is cool enough to be honest.<br><br>- Daniel", 

"60": "In 2021 Mattel released a new playline collector line called \"Rewind\". It featured dolls with vintage face molds in 1980s inspired looks. I wish this line would expand into the 70s because that’s my favorite era of Barbie but if I’m being realistic this line was just capitalizing off of recent 80s nostalgia so it’s not going to happen. My doll is heavily inspired by Barbie and the Rockers. Barbie and the Rockers was Barbie’s band that was essentially created as a slimy business move. Mattel was made aware of Jem and the Holograms before the cartoon or the dolls were released so they rushed out a competing rock band doll that managed to release right before Jem. As a result, the public believed that Hasbro copied Mattel. If I’m being honest, the Jem dolls are very ugly and they have massive feet, so I do prefer Barbie and the Rockers. Anyway, this doll isn’t explicitly tied to Barbie and the Rockers, but her entire outfit and vibe seems like a fond look back at Mattel’s fabulous but immoral behavior. I think this is a gorgeous doll with gorgeous makeup.<br><br>- Daniel",

"61": "Brooklyn made her first appearance in the Big City Big Dreams movie. She meets and becomes best friends with Barbie after they discover that they have the same name. Brooklyn’s real name is also Barbie Roberts. I’m not sure if they have the same middle name. Anyway, this doll is my first Barbie with microbraids. I’m not going to unravel the braids so I can’t determine what hair type she has. I wrote polypropylene just because this is a modern Mattel doll and Mattel loves being cheap with Barbie right now. This doll has limited accessories and a half-printed dress. I do appreciate the printed edges as part of her facial screening so at least a little effort was put into this doll. Brooklyn deserves so much better because she’s a very pretty doll.<br><br>- Daniel", 

"62": "The Big City Big Dreams movie was the first time white, blonde Barbie (\"Malibu\") met Black Barbie (\"Brooklyn\"). This doll is a budget release because she has simplified clothes and accessories. She also has flat feet, but they aren’t as huge and scary as the 2000s flat feet. She is undoubtedly a budgeted release of the Malibu Singing doll. She also lacks the singing mechanism of the main doll. This doll is honestly very mid and I really wish that Mattel put more effort into her. The print of her dress only goes on one side which is very lazy. At least this doll has saran hair.<br><br>- Daniel",  

"390": "This doll features the signature look Margot Robbie wears in the Barbie movie. The dress is extremely high quality and I was very impressed. Unfortunately, the shoes keep falling off so I have to be careful with her. Additionally, her hair bow is held in by those evil plastic T tabs that I despise but for my own sanity I pretend I do not see it. I feel like the bangs absolutely ruin the face of this doll. She gave the world the first look of the new Margot Robbie face mold and the bangs (which aren’t even accurate to the movie; she should have curtain bangs), and it looks absolutely awful. It looks nothing like the actress. The other dolls, who do not have bangs look a million times better. I feel bad because she’s otherwise amazing but those horrible bangs completely take away from the face.<br><br>- Daniel", 

"63": "I fell in love with the 2022 Birthday Barbie the moment I saw her. I love how unique her silhouette is, and every detail is perfect. I do think this doll was a bit overpriced, so I’m glad I bought her on sale. Her ponytail reminds me of Barbie #1 without the hideous bangs and the massive bow on her waist is so campy. I love the tiny splashes of color on this doll’s dress but it is still mainly baby pink (my favorite shade of pink). I do wish this doll wore a necklace but I guess necklaces weren’t really in style. I honestly can’t tell if this doll has the Millie face mold but she looks very pretty regardless.<br><br>- Daniel",  

"389": "For some cursed reason, Chelsea joined Barbie in the Jungle Series of Cutie Reveal dolls. She essentially wears miniature versions of the four different animals Barbie dresses up as in this series. See the Barbie Elephant doll for a more detailed description of this line of dolls because I don’t want to talk about it again. This doll is pink monkey themed but unlike her sister, Chelsea does not have any fluffy sweatpants. To be honest, these dolls were pretty lazy compared to Barbie. The \"revealed\" outfit is also very ugly. I genuinely do not understand why anyone would seriously purchase this doll unless they are a small child or enjoy tormenting their friends who have to upload them to websites.<br><br>- Daniel", 

"324": "The Jungle series is the fourth series of Cutie Reveal dolls. Honestly, this is one of the most ridiculous dolls I own. This is an unboxing (I do not like that word; just say open L) gimmick doll where you remove Barbie’s animal costume and change her outfit into a tracksuit. I don’t really understand the vision because the dolls aren’t blind packaged, but apparently this line has been very successful with children. I bought this doll entirely because I thought it was funny. Jonah specifically told me that he would not put any of these dolls on the website, but I chose not to listen. Apart from the cursed concept of these dolls, the Elephant doll is honestly gorgeous and I’m so glad I impulsively bought her.<br><br>- Daniel",  

"64": "Barbie Extra #14 is very obsessed with 1980s Barbie. Almost every piece of this doll’s outfit is branded with the 80s Barbie logo. Apart from the jewelry and shoes everything is also Barbie pink. Her pet also has their own car that’s Barbie pink. My absolute favorite detail about this doll is her purse. It is a clutch bag that is stylized to be an 80s slim boxed Barbie package. That’s such a cute detail that put effort into the nostalgia bait. I honestly can’t say I like this doll more than my other full-sized Barbie Extra but I still really love her.<br><br>- Daniel", 

"65": "The first thing I notice when I look at Barbie Extra #20 is her face. It’s an older mold that I haven’t seen on a Barbie since the 2000s. The second thing I notice is her sweater, with the plastic butterfly charms textured as if they were also made of wool. Because this is a Barbie Extra doll, she comes with an unnecessary number of accessories that honestly do not match her outfit well, so I did not include her purse, sunglasses, pet, or her pet’s sunglasses. My biggest complaint with this doll is her shorts. I would have much preferred if she had some cute bell bottom jeans with this outfit, especially with those cowboy boots. I might be completely delusional though because I think that bell bottom jeans make every outfit better. I also really love this doll’s hair. Obviously, I appreciate that it’s purple but I’m also very glad that it’s saran because this is a modern Mattel doll, and I don’t trust them to not use polypropylene on their main playline releases. All my complaining aside, I really really love this doll. I think her jewelry is absolutely adorable and she’s one of the best Barbie Extra dolls released at the time I’m writing this.<br><br>- Daniel", 

"66": "Extra Mini is a spin off to Barbie Extra and speculated to be a response to MGA’s LOL Surprise tots. However, the Extra Mini dolls are closer in scale to the LOL Surprise Tweens. Their release dates are pretty close together, so I think it’s more likely Mattel’s response to the tots. Despite this, the Extra Minis have fabric clothes and rooted hair. They have cartoonishly large heads in contrast to the regular Barbie Extra dolls, who have regular Barbie heads and bodies. Also, unlike the full-sized dolls, the Extra Mini dolls come with stands. I don’t know the reason for this inconsistency, but I assume that Mattel is aware of the fact that it is much harder to find 3rd party stands for mini dolls. Anyway, I go back and forth with my opinion of this doll. I think she’s very cute, but her face is a bit jarring. She is way simpler than the LOL Surprise Tweens so I honestly can’t say that she’s very impressive.<br><br>- Daniel", 

"325": "Barbie Looks #10 is part of the Barbie Signature umbrella of \"playline collector\" dolls, as in they are packaged as collector dolls and are more expensive than playline dolls, but they are widely available and far from the price range of Silkstone \"adult collector\" type dolls. The name Barbie Signature seems to be an evolution of the Barbie Collector dolls from my childhood, which were the same idea of \"playline collector\". The Looks line was first released in 2022, and the first series (which this doll was part of) featured neutral colors and silver chrome. They also all had the Made To Move body, which gave the dolls the highest amount of articulation on a Barbie. A restyled picture of this doll went viral within the doll community on Twitter, which is why I decided to buy her (I usually don’t pay much attention to modern Barbie because she is currently in her flop era). I think this doll is one of the most beautiful Barbies in my collection and personally I think this is one of the best dolls Mattel has made in many years.<br><br>- Daniel", 

"67": "This is a reproduction of (box dated) 1976 Superstar Barbie, which was the first doll to use the \"Superstar\" face mold that became Barbie’s signature face for the next twenty years. This doll also signified a harsh shift in Barbie’s aesthetic from the peasant-style fashions of the early 70s and the Malibu era to the disco style of the late 70s. Superstar Barbie is also the first doll to feature the 90-degree bent \"Barbie\" arms that became part of her pop culture image. The original Superstar doll was frequently repackaged, both as \"Superstar Barbie\" (with additional fashions, child-sized jewelry, and as a 2-pack with 1977 Superstar Ken) and as two other dolls: 1978 Beautiful Bride (I own that one :) Update: no I don’t :( ) and 1980 Roller Skating Barbie. Superstar Barbie is the earliest Barbie that didn’t scare me as a child, and I see her as the turning point from Barbie’s early years into the absolute icon she became by the end of the 20th century. There are some slight differences between this reproduction and the original doll. The original Superstar is much more orange in skin tone and her makeup is thicker (but there was frequent facial variations at the time). My doll also has a bit of a misprint, she is missing some of the eye shadow on one of her eyelids. Superstar Barbie is my favorite fashion doll of all time and I love her very much.",

"436": "This doll was the first leak for the Barbie Movie dolls. I remember being so excited because I thought this doll looked really good while still looking like Ryan Gosling. Looking back, I think this doll looks a lot more like Life in the Dreamhouse Ken, but I still really like him. I don’t buy a lot of male dolls because the female dolls are usually more interesting and detailed, but I am so glad I brought this Ken. He has rooted hair, which has been absent from flop-era Kens, for a start. His clothes are also a really nice quality material and I really appreciate that the faux buttons are added on and not printed. The shorts also have working pockets which is so rare with modern Barbie dolls. Ken also came with a surfboard which I appreciate but I wish it had some printed details. I really like this doll’s outfit because it reminds me of something my friends would wear. I could give you a detailed description of how Gideon and Jonah would style this Ken’s shirt right now but I’m not sure if they want me exposing their fashion choices. I would never dress like that personally, but people I love do, so I love this doll very much. Of course, Barbie is better, but Barbie is always better. \n\nQuick note, I wrote this and my description for the corresponding Barbie before I saw the movie so the only context I had was the marketing. ",  

"409": "Kelly was Barbie’s toddler-to-preschool-aged sister who debuted in 1995. In 2010, she was discontinued and the character was renamed Chelsea. She was also aged-up to be in elementary school. Interestingly, Kelly was named Shelly in Europe and is the only Roberts sister (for those who don’t know, Barbie’s last name is Roberts). Kelly also had a friend named Chelsie, but she was gone by the time the Chelsea era began. Now we’ve gone through the Kelly introduction, I’ll go into more detail about this doll. Eatin’ Fun Kelly came with a highchair and various little foods. The gimmick was that you (Barbie) were teaching her how to behave and feeding her (I’m sorry I don’t know how to take care of children). The doll had a special mechanism where if you pushed a lever on her back her arm raised, mimicking an uncooperative child. I got this doll used from my friend Gideon, who probably also got her secondhand as a child. I don’t believe I have any this doll’s pieces but that’s ok. Her original outfit is very ugly anyway so I’m not that upset.", 

"412": "Tommy is Ken’s little brother who is the same age as Kelly. They appear to be friends. In this set, Tommy and Kelly are playing with a child-sized truck. This Tommy is near identical, including his outfit, to the Tommy from Big Brother Ken & Baby Brother Tommy but without the mouth hole (so Ken could feed him) and arm-moving mechanism (so he could wave). This playset featured a tiny pink truck and connector thing (sorry I don’t know what it’s called). There’s also a battery-operated feature but I got it secondhand from Gideon who also got it secondhand, so it no longer works and I am too lazy to look it up. This doll has cut hair so what once was a bowl cut now sticks up all over the place. I did my best but it still doesn’t look very good. See Kelly Club Lots of Secrets Clubhouse Detective Tommy for how this doll’s hair is supposed to look.", 

"427": "This Kelly has a unique body. Her legs have pointed ballerina feet and her arms are articulated for additional movement. She also has painted on tights and ballet shoes but unlike the Barbie she was sold with, her ankles do not articulate. Also like her Barbie, I got this doll from Gideon, but I’m pretty sure I do not have her outfit. In the playset that came with the doll, Kelly was able to \"really dance\" by being attached to a mechanism that made her spin. She could be posed so she looked like she was dancing. This Kelly is newer than most of the others Gideon gave me, but I prefer her facial screening to the 90s dolls.", 

"429": "Cut & Style was a reoccurring gimmick with Barbie. See my Cut & Style Rapunzel doll for a more detailed description of this hair gimmick. The original Cut & Style dolls had refillable hair cartages for their undercuts but that was a lot messier. This doll was given to me by Gideon, but the connectors for the hair extensions were already removed. The extensions and accessories were also lost but I’m not bothered because that’s kinda gross. This doll’s dress reminds me so much of the dolls from my childhood, which were very much from 2010 so that makes sense. Honestly, I’m not a big fan of the green, sorry Gid. The dress is very ugly but it’s very much giving Candy Land so it’s kinda camp. I’m not the biggest fan of hair gimmick dolls but this Teresa has lovely kanekalon hair so she gets bonus points from me. The best part though is definitely her dark purple makeup, but purple makeup is my favorite so I might be a little delusional.", 

"406": "This doll was released under the first line (obviously) of Li’l Friends of Kelly. Because this was Gideon’s doll, she was actually a Li’l Friend of Shelly because that was Kelly’s name in the UK. Marissa is the first Latina friend of Kelly and she is very cute. She has kanekalon hair which is very much appreciated on this website. Once again, she is missing her outfit and loaning the romper from Power Wheels Kelly (who I do not have at this time). I hope she can one day be reunited with her own outfit.",  

"420": "The Adventures of the Li’l Friends came in the most darling little costumes. In this wave, Chelsie made two appearances, but this doll is the Cowgirl one. There was a variation where she came with a little toy rocking horse. I have no evidence of this rocking horse so I don’t know which she was. The only thing she’s missing is a cute little cowgirl hat. Of course I don’t have any of her little pieces because this was another gift from Gideon but that’s absolutely ok. I’m sure she doesn’t mind borrowing from the Kelly fashions I have. This doll is one of the very few of Gideon’s that did not get a haircut, and I can’t complain about this at all because I also cut a lot of my dolls’ hair when I was a child (they are no longer with me so unfortunately will not make an appearance on this website). Chelsie is interesting to me because Kelly herself was renamed Chelsea in 2010, so I can’t help but wonder if that strained their relationship. I don’t have the answers but I personally think Jonah is to blame, and I really do believe that based on nothing (that’s an Ethan Klein quote). Here’s what Gideon thinks about this doll. I thought Cowgirl Chelsea was SO PRETTY when I was a kid. I loved her dark red hair and red lipstick and green eyes and freckles. Looking back, that was probably just my ego talking because I had most of those traits, but who would Gideon be without being full of himself? She also reminded me of my uncle’s girlfriend Kelly who was American and crocheted me a hat that I loved for so long. It was dark turquoise and really soft and also I could hide all my hair in it. She was often the main character when I played with my dolls, leading treks through snail-covered fennel plants and answering all the questions in Barbie school. She also wore my favourite outfit a lot of the time which was a denim and red plaid dress. She always wore shoes for some reason even though I usually didn’t.", 

"421": "Kayla honestly seems like a pointless character in the Kelly-verse because she looks exactly the same as Kelly but with green eyes. Kelly has green eyes sometimes so it still doesn’t mean much. Also Barbie has had at least five different friends named Kayla so like pick a new name girlypop (for once Gideon has gotten me to start saying a new buzzword instead of the other way around). In this release, Kayla is apparently playing dress-up but she is doing a boring job. She can’t even commit to a monochromatic fit because her shoes are the wrong color. Also toddlers should not be wearing high heels that’s got to be awful for their development. Apparently Gideon and his siblings hated this doll too because he had a lot of negative things to say about her when I asked for identification help. I just enjoy clowning on my dolls. Also this doll has a slight haircut so I put it into a ponytail.", 

"422": "This doll was a special Easter release that featured Kelly in various easter costumes. 3 of the 4 dolls were blonde, white Kelly, but the second Kelly as a \"Funny Bunny\" was Black. These dolls were released in 2001. This doll was another gift from Gideon, and to be honest I wasn’t sure if this Kelly was salvageable because most of her hair was cut off. However, I knew the chick costume was authentic Barbie the moment I saw it, so I used that as a lead when I was identifying the dolls. Luckily, the hood of the costume hides the haircut which saves me a reroot. This doll is absolutely adorable in her little costume and I’m very thankful my friend was generous enough to give her to me.", 

"425": "Here’s the boy again with his stupid bowl cut. Tommy is Ken’s little brother who was essentially the token boy in Kelly’s friend group. In this series, he is a detective for some reason. The other dolls in the line are not in similar costumes, they are going on picnics and stargazing. There were two versions of this doll released, with the same stock number. The only difference was the color of the magnifying glass they came with. I don’t know which one came with my doll because he was from Gideon’s childhood and missing all his pieces. He’s ok I guess.", 

"432": "Of Barbie’s many many careers, Beekeeper is probably one of the least appealing to me personally. I’m not afraid of bees at all, but I am impatient and bee keeping appears to be a very slow and tedious occupation. Additionally, the outfits do not slay. This doll is from Barbie’s flop era so she features some of the many sins of modern Barbara. First of all, each detail of her clothes are printed on, including the denim of her jeans. Additionally, she has the Millie face mold which is so bland. My doll also has faded face paint- well it’s not really paint because it’s the lazy pixelated printing where you can see all the tiny dots that make up her features. This Barbara is also very limited in her movement because she only has 5 points of articulation. The saving grace for this doll is that she has saran hair. I am certainly thankful for that. This doll originally came with a playset that was essentially a curated bee colony that has just been saved by Barbie. Unfortunately for those bees, I do not have the playset pieces because I got this doll second hand. I found her at a thrift store with the 2019 Gymnast Barbie and a Chelsea camper that was unfortunately missing all its pieces. I’m also missing one of this doll’s gloves so I pictured her without them. It was clear to me that this doll was never taken out of her original outfit which makes me kind of sad for Barbie because her previous owner probably didn’t give her much love and attention. I may be a judgmental father that plays blatant favorites but I’m still going to give this doll the love she deserves.", 

"433": "Barbie has been a gymnast countless times. I tried gymnastics when I was in first grade but my balance is abysmal even after 11 years of taekwondo so it was never meant to be. This doll came in a playset with various gymnastics accessories and pieces including a balance beam and an extra outfit. I got this doll secondhand wearing her spare leotard and her medal. This doll has articulated elbows and wrists which is very much appreciated for modern Barbie. She also has very short hair that is supposed to look like it’s in a top bun which I appreciate. I love dolls with short hair because they are so much rarer than dolls with long hair. Unfortunately, this doll has the Millie face and a boring screening so she does lose quite a few points but she’s still cute. I just wish she had some glitter or something, but I know nothing about gymnastics or their kind of makeup etiquette.", 

"434": "Alongside Superstar Barbie, Superstar Christie also changed the world in 1977. Christie was Barbie’s first Black friend (and friend of color), introduced in 1968. Mattel didn’t want Barbie herself to be Black until the early 1980s, but in the 70s, Christie (alternatively sometimes it was Cara) was packaged as the Black version of Barbie’s releases, but she was still seen as \"Barbie’s friend\". Usually, Christie dolls would feature a different face mold than their corresponding Barbie, but the Superstar dolls introduced the world to Barbie’s most iconic face, so (I’m entirely guessing here, I don’t have any evidence for this.) Superstar Christie also used the Superstar face. Christie wears a yellow version of Barbie’s iconic pink disco gown and feather boa, and she looks absolutely stunning. This doll was reproduced as a collector doll in 2021, a year before Barbie (although Superstar Barbie was reproduced in 2009 for Barbie’s 50th anniversary). Interestingly, the material of the feather boas is very different, I don’t have an original boa but from the pictures I’ve seen, Christie’s seems more accurate. If it wasn’t obvious enough, the original Superstar Barbie is my favorite fashion doll of all time so this Christie means the absolute world to me and I love her very much.", 

"361": "This is one of the most iconic Barbie of the 80s. She came in an elaborate peachy gown that I unfortunately do not have. Jonah is probably thrilled that I don’t have the outfit because he’s a hater that doesn’t like fabulous ball gowns. I would put 20 tomato emojis here but I don’t think I’m allowed. I found this doll at a thrift store with a fat head (when the neck breaks so the child shoves the head down to try and keep it on and it makes the doll’s head look wide and oddly distorted. It’s entirely fixable) and wearing 1980 Western Barbie’s jumpsuit. As soon as I saw this doll’s face I knew 2 things: 1. She was from the 80s which is a rare occurrence for me to find, and 2. This Barbie needs me to be her father and fix her neck. After the release of the Barbie movie I’ve been more gatekeep-y with Barbie because I don’t want to share but also I don’t want my favorite thing in the world to become a discarded trend. In my delusional thinking, I worried that someone else would buy this doll, realize she was broken, and throw her away. Barbie deserves better than that. Also, this doll has the added sentiment because two of my aunts had her as kinds. My mom didn’t have any Barbies, she had Sindy (see Music Star Sindy for more information), so having a Barbie my mother remembers from her own childhood is extra special. I used to have my aunts’ hand-me-down Barbies when I was very young but unfortunately they are no longer with me. Often, Peaches ‘N Cream Barbies are ugly but I think mine is stunning. I love her purple eyeshadow and coral lipstick. She is so beautiful.", 

"362": "Mattel has always been obsessed with gimmick dolls. Barbie gives a unique retrospective of how technology has evolved. The late 70s and early 80s were a particularly cursed time for gimmick Barbies. See 1980 Western Barbie for what I mean. Magic Moves Barbie isn’t as scary, but her mechanics are also dated. When you push a lever on her back, her arms move up and then her head tips back. It makes it look like she’s flipping her hair back. The mechanism is very loud, and you have to push the arms down with a little force to get them back to normal. Because this doll is almost 40 years old that stresses me out. I got this doll second-hand, so I don’t have any of her pieces and she has a haircut but that’s ok. I think she’s still very pretty and I was very happy to adopt her. This poor thing was the filthiest doll I’ve ever rescued. She was covered in what I hope was just dirt. I promised her that I would give her a nice home and never let her get to that point of filth again.", 

"363": "Barbie has been a mermaid a million times. In 1991 she was really into being blue this time. This mermaid doll is the most common one I’ve found, where they have a standard doll body and a cloth tail that slips on. Unfortunately, I got this doll used so I don’t have her tail or her bikini top. This doll has tinsel in her hair which stresses me out because it gets snagged so easily and often ends up looking awful. The tinsel has a turquoise tint to it that reminds me of the hand-me-down Barbies I had as a kid. This doll also smelled exactly like those childhood dolls that are no longer mine which was a very weird nostalgic moment. I thought this doll was from the late 80s judging by her facial screening and I’m not going to lie I was slightly disappointed she was from the 90s because 90s Barbies are so much more common, but I don’t mind now. Personally, I think Barbie should’ve gone with a purple theme instead of the blue but I forgive her.", 

"364": "As Barbie’s longest-lasting sister, Skipper has gone through a variety of friends. Courtney is one of the longer lasting and more memorable friends. In 1988, Skipper had a much-needed redesign. The 1984 \"Hot Stuff\" Skipper face mold was very scary and constantly making Skipper look like her hairline receded. The dolls bodies also changed, making Skipper an older teenager. She’s still quite a bit shorter than Barbie but she’s undoubtedly a teenager. In 1988, Skipper got a complete revamp with the new Teen Time and Teen Fun lines. She also got Courtney as her new best friend. The Pet Pals line featured Skipper, Courtney, and Kevin (Skipper’s boyfriend at the time) taking care of animals. Unlike Skipper and Kevin, Courtney comes with a cat. The others have dogs. For some weird reason, each of the dolls in this line come wearing animal themed jerseys. It reminds me too much of gym class ew. I’m not sure why they’re wearing these tacky things because it looks ridiculous and clashes with their outfits. Lucky for me, I got my doll secondhand without her outfit and wearing a Skipper Bridesmaid fashion pack that’s slightly less ugly. This doll has beautiful makeup and lovely crimped kanekalon hair which I appreciate. Sorry it’s hard to say much when I only have the base doll.", 

"373": "This is one of the many many slim boxed beach releases in the 90s. This line was glitter themed but also included colorful crystal necklaces on each doll. Barbie also came with a bottle of lotion that was advertised as being for the child and the doll. That lotion is long expired but even if it was in date I would not put it on my doll because that would make a mess. I think the bandanas/headbands each of the female dolls have are all really cute. Unfortunately my doll does not have hers or any piece of her bathing suit. The flower pattern is really darling and cute. I love the purples here that’s very slayful. Barbie’s makeup here is very Daniel-core with the near-garage doors of purple (for Jonah: garage doors is a drag term where you just use one solid eye shadow, as in your eyelid looks like a painted garage door). Barbie was still in her over-tanning era here and I worry about her health. I don’t really like Barbies with these kinds of arms because they just constantly look awkward. Like when are you going to stand like that? Never. This doll looks like she works in a diner and aspires to be a housewife (me too bestie).",  

"383": "This is yet another iconic 90s Barbie line. Interestingly, there was a deluxe Hollywood Hair doll released in a completely different outfit and dated 1993. I’m not sure which version I have because they are identical and I didn’t get any of her clothes, so I defaulted to the earlier one. These dolls are known for their really long hair. I’m lucky that my doll didn’t have a haircut. This was obviously a hairstyling doll, which I am not a big fan of because I am impatient and unskilled. Regardless of the version, this doll’s fit is so Saved by the Bell as in it was already out of date when it was released style-wise. It’s very tacky. However, I must say this doll has some of the most fabulous Barbie earrings that look amazing on her. Honestly I want a pair for myself. The best part of this doll by far is her makeup. Something about the way this screening is done completely transforms the Superstar face mold and it looks incredible.",  

"423": "The I Can Be line was so iconic to my childhood. I had no idea it existed all the way back in 2000. This release was also a Barbie and Kelly set. Barbie is Kelly’s pediatrician here. It also came with doctor playset pieces such as a weighing scale and various tools. Barbie being a doctor has been the norm for so long but I don’t know where this ranks among the various doctor Barbies. It took me a while to identify her because she was so glam that I assumed she was one of the slim boxed Teresas. I wasted a lot of time going through all the Teresas from this era, but identifying a doll is always worth it, no matter how long it takes. This doll has the Twist N Turn body which really stood out to me because her face looks like it belongs on the 1999 body. It’s weird because she’s so stiff and yet Kelly has additional articulation to accommodate the playset. This Barbie is so beautiful, especially in the dress I found her in. It took me a little longer to identify the dress because it came from a fashion pack, but it is 2000 Barbie Fashion Avenue Premiere in New York 25701. I decided to photograph her wearing it because it just looks so good on her and I don’t have her original outfit at this time.", 

"491": "This is another one of Gideon’s dolls that he kindly gave to me. Unfortunately, it took me especially long to identify her because she had some pink stains on her face that needed the acne cream treatment. This doll also has a slight haircut, but it’s hard to tell because she was originally styled with a ponytail. In this series, which features Kelly and her friends cosplaying as adults, Marisa decides to be a flight attendant. It reminds me a lot of Jan’s Night of a Thousand Michelle Visages runway on Season 12 of RuPaul’s Drag Race. It’s very cute. I like how her lipstick matches her stewardess uniform. Oh I forgot to mention, Marisa is dressed up as an airline stewardess. None of the other dolls in the line are dressed for air travel so this was a strange choice but I’m not offended or anything.", 

"428": "The I Can Be line was Barbie’s main career series throughout the early 2000s and 2010s. I thought it was only a late 2000s to early 2010 series but I was wrong. I can’t find exact dates though so I apologize for that. Barbie has also been a babysitter many many times, going all thte way back to the early 1960s. This release was a 2-pack with Kelly in one of her last appearances. I got this doll used so I’m missing Kelly and all the accessories. I’m not that bothered though because this set came with a bathroom gimmick as Barbie seems to be potty training her sister once again. Where are their parents? Unfortunately, the one thing I do have for this doll is her ugly dress. I have no idea what that print is supposed to be but I’m not a fan. Interestingly, this doll has kanekalon hair but the stock pictures appear to use saran. There’s often variation with Barbie so this isn’t a big deal but I thought it was cool. This Barbie’s face is fairly generic but it reminds me a lot of the dolls from my later childhood so I appreciate her a lot. Her hair also features an extreme side part which looks a little silly but I wasn’t paying much attention to hair styles in 2009 so I can’t really judge.", 

"430": "Before they were universally disliked, Barbie collaborated with SeaWorld multiple times. The 2011 release featured a branded playset with small plastic animals that could do tricks. I’m guessing it’s a forced perspective moment but it looks a little silly. I got this doll secondhand so I’m missing the tiny playset and animals as well as parts of Barbie’s outfit. I do have her wetsuit and whistle though so that’s something. This doll has the big scary flat feet but interestingly, it’s my only doll with big feet to have the hollow hard plastic legs rather than the bend n snap rubbery ones. Unfortunately, my doll is super wonky and her eyes look very silly from almost every angle. I can’t do anything about that because I’m terrible at painting. I doubt Jonah would be willing do try either. Sorry Barbie. Another big problem with this doll is that she has pretty bad glue seepage, but it’s treatable. It’s just going to take some time. I feel bad for this Barbie because she’s so unfortunate and forever tied to a super unethical corporation so I promised to take care of her and be a good father.", 

"431": "Starting in the early 2010s, Mattel would release super budget Barbies in super slim boxes with simple Barbie-printed dresses and minimal accessories. The boxes would just say \"Barbie\" so the name Budget Chic Pinktastic is a common fan term I found online. I find these dolls super fascinating because of their composition. They remind me a lot of the My First Barbies from the 1980s because of their limited articulation. This dolls arms can only turn up and down and her neck can only turn left and right. This is super interesting to me because I have a similar budget doll from the early 2000s who has similar arm articulation but a full range of motion on her neck. This doll also has the 2009 body and full hip movement which surprised me. I know the 1966 bodies were fully phased out at this point but I’m not sure why they didn’t opt for the 1999 body. Another interesting thing about this doll and a lot of similar dolls from this time period is that they have non-removable necklaces. This was very helpful with identification so I appreciate it as an adult but I’m sure kids would be disappointed. This doll’s necklace features the Barbie silhouette in solid black which always slays. Barbie’s makeup is pretty standard for the time period, but what’s unusual is her hair. This doll has a middle part which is almost unheard of for the early 2010s. I really love it as someone whose been parting his hair in the middle since 8th grade. Unfortunately I did not get this doll with her original outfit and at this time I have not identified the one she is currently wearing because I forgot to do it. This doll reminds me of my childhood a lot because I would see dolls like her at CVS or other stores that otherwise wouldn’t have dolls. I would never buy them but they always made me happy to see my favorite thing in the world where they otherwise wouldn’t be.", 

"435": "I’ve explained Barbie Fashionistas before, so see Fashionistas #160 for more information. This doll is obviously a Ken, but the box just says Barbie so I just wanted to clear up any confusion. This doll has vitiligo, which is shown through printing, but I believe a different method is used for the face and the body. For the face, the printing is pixelated just as many Mattel screenings in the late 2010s-early 2020s are, but on the body it seems to use a more traditional printing method. Unfortunately, the body printing looks the most fragile, despite the higher budget method. I got this doll as a gift from Gideon so I’ll let him give a more subjective description. This Ken’s job is get dressed in the dark. He calls himself a fashionista, however, his outfit is not very cute. Aside from the clothes though, fashionista Ken #192 is a cutie pie. I like his big strong arms and other muscles ;) . I would like if his hair was actually hair, but I guess it’s still ok. His shoes are really dumb and they don’t even fit him well. They should at least be dark green (the best colour). He is definitely the token bi and probably trans guy in a friend group of straight girls. He likes to date men who look exactly like him and he also has a puppy that is extremely well trained. I’d probably meet him for coffee 7/10.", 

"437": "Before I start this description I need to issue an apology for the Margot face mold because I said mean things about it previously but it looks absolutely stunning here. It also looks like Margot Robbie and I love it. This doll was part of Wave 2 of the Barbie movie dolls, and one of the few Barbies because apparently Ken is more important. I’m warning you now the remainder of this description contains spoilers for the Barbie movie but even Jonah’s seen it (only because I made him go with me) so I don’t think that’s a big deal. Anyway, this is Barbie’s outfit when the group start unbrainwashing the other Barbies. I wish they sold Allan in this outfit because that would be so slay. I guess a Michael Cera sculpt was not in the budget. This doll is a little simple but she’s so cute and beautiful. I was surprised she has a wedge boot (insert the Alyssa Edwards clip here) but I’m more surprised that I don’t hate it. The fabric on the jumpsuit surprised me with how nice it is. If I’m being honest, this was not my first choice of the Barbies but the rest of them are out of stock everywhere. I still really like this doll though and any Barbie movie doll is special to me because it reminds me of the special day I spent with my friends.", 

"424": "Before the flop era, Barbie’s budget/slim boxed dolls always slayed, sometimes more than the standard or deluxe dolls. This doll is a great example of that. Her dress is so 2001 and I love it. Usually, I deep clean all my boxed dolls just in case but with this one I didn’t want to fade the sparkle decals. I did wash her hair though because her hair elastic dry rotted unfortunately. The shoes are a very weird choice here, they’re the chunky short boots I always associate with 2009 I Can Be a Racecar Driver Barbie. I don’t know if that was en vouge in 2001 but it seems like a very strange choice and does not match the rest of the look. This doll’s face is so beautiful, it’s the type of screening I grew up with so it’s very nostalgic to me on top of being absolutely gorgina. I’m surprised that this doll has blue eyes because green eyes were very common with holiday themed Barbies at the time.", 

"426": "I’m going to start this by saying this doll was an adult collector release, themed around fancy elaborate chairs, which of course they came with. The line also included a white tiger and a leopard. This is such an interesting and bizarre release. The packaging choice decided to use a PIPE CLEANER to attach the doll to the couch. I’ve never seen that before but there’s a first time for everything I guess. At first I thought it was sewn into her bodysuit so I was worried that she’d have a massive red pipe cleaner coming out of her back in the picture. Lucky for you, dear reader (let’s be real the only person reading this is Jonah and that’s if I’m lucky) I managed to get it off. All the elastics dry rotted, and that has left a slight mark on her ankles I can’t do anything about at this time because I can’t wash her bodysuit (which is attached to the tights/boots) because the faux leather will definitely peel. Speaking of, I am afraid to breathe on this doll too much so her clothes don’t peel off. Despite how delicate it is, this outfit is fabulous, but also cursed because like I said, the shoes are attached to the entire bodysuit. It reminds me of those cursed Converse leggings from like 2010. The fluffy accents are very cute though, but I wish the tail was more obviously bendable. It took me a while to realize it had any flexibility which is no fun. Now that I’m done complaining about the outfit, I’m going to tell you how weird her hair is. Usually I wash out all the crusty hair gel because yuck. However, the cat ears are her hair but gelled and cut to look like the right shape. I’m not sure how the construction works because I’m too scared to investigate. Even without the weird \"ears\" (Jonah I forgot how to do quotes please help) her hair is weird because she has a pixie cut which is extremely rare for Barbie. I’m here for it though. Even though she’s really weird this doll slays. Also if you want to see the couch look it up yourself this is Daniel’s Dolls not Daniel’s Doll Furniture."

} 

] 