[{
"68": "The iCandy line of dolls is especially unique because they have unconventionally colored legs mimicking tights. Phoebe has black legs while the other two dolls in her line have neon colored \"tights\". Phoebe is one of the first twin dolls, being more traditionally feminine than her sister Roxxi. My doll is missing quite a few accessories, including her earrings, her belt, her purse, a card, and one of her belt buckles. Despite missing so many things, I treasure this doll dearly because I got her as a gift from my aunt when I was very very young. I distinctly remember opening her as a four-year-old at my grandparents house. This doll is what I think of when I remember my childhood Bratz dolls.", 

"69": "Of all my childhood Bratz dolls, this one I remember the least. When I cleaned her up as an adult, I still struggled to unlock any memories. She is from a lesser-known Western Line that was quickly overshadowed by Wild Wild West in the same year. My Meygan doll is missing her necklace, earrings, and the sticker. I am absolutely obsessed with the ridiculously high-heeled boots, they are definitely the highlight of this outfit. The skirt does not like to sit nicely unfortunately, but the top is very cooperative. This Meygan looks drastically different from my other childhood doll (Sleepin Style) so I wonder if they were confused for different characters by whatever relative gave me them (I was 3-4 when these dolls came out).", 

"70": "This doll was identically released as \"Sleep-Over\", and shares an outfit with 2002 Slumber Party Meygan. However, she has a completely different facial screening and came with significantly less accessories. My doll is from childhood and has lost the robe, sleep mask, monkey, and card. Additionally, while cleaning I accidentally removed the flocking on her slippers. Another interesting variation is that some versions of this doll have blonde hair. I have the redheaded variation. My memory of having this doll as a child is hazy but she was definitely there. Unfortunately, most of the buttons on her shirt fell off when I was a child but luckily they are just for decoration and the shirt has Velcro underneath. This doll has one of my favorite Bratz facial screenings and I really like her crimped hair.", 

"71": "One of my very few childhood memories about Bratz dolls is having this specific Jade doll so she is very special to me. She has a very uniquely articulated body, with the arms of modern collector Bratz and a chest joint. She also has rooted eyelashes. I do have the outfit for this doll, but it has a prominent stain I have not been able to remove, and it constantly sheds and makes a huge mess of silver glitter. I also only have one remaining shoe unfortunately. The white coat, silver gloves, and earrings are long gone too. The Bratz the Movie line was very obviously a tie-in with the live action Bratz movie which is notoriously bad. Weirdly, the dolls are more dressed as if they’re on a red carpet and include a camera toy for kids (that I have more memories of than the doll herself). For my picture, I let Jade borrow Rock Angelz Sasha’s second outfit for the picture exclusively because I thought it would look nice. On display, I will display her in Cult Gaia Yasmin’s second outfit because in my opinion that feels like an upgraded version of her original dress.", 

"72": "I honestly have no idea if I got this doll used or new as a young child, but all that remains is the doll and one earring. The doll also came with a working microphone on top of clothes and doll accessories, as this was a music themed line. According to the Bratz wiki, the logos for this line were inspired by Madonna. The makeup on this doll is stunning, I love the bold pink lip paired with the glittery eyeshadow. For my picture, I borrowed The Bratz Pack Kumi’s second outfit because I thought it would look interesting with her makeup. I’m not sure if it looks very good with her lipstick but I think it looks good enough.", 

"73": "The Bratzillas line of dolls was a short-lived Bratz spin-off featuring the cousins of the Bratz characters (that coincidentally have very similar names) who are all witches. Unlike their non-magical counterparts, the Bratzillaz have inset eyes and solid feet. As a child, I was not very impressed with the Bratzillaz line. Ten-year-old me smelled a Monster High rip off miles away, but I was still curious enough to ask for one. I found Cloetta’s split color theme intriguing since Monster High didn’t have an equivalent at that point. Unfortunately, the Bratzillaz dolls are notorious for their low-quality polypropylene hair that easily frizzes. Fortunately for this doll, I got bored of her very quickly, so her hair did not frizz much. Her jewelry piece broke when I was a child and one of the earing holes was not properly done in the factory so my doll can only wear one earring. Another quality issue is that her little witch hat fascinator is attached with an elastic band that will inevitably dry rot over time. There are just too many quality issues with this doll that it’s no wonder the Bratzillaz line flopped so quickly.", 

"74": "This doll was rereleased alongside the 2021 reproductions of the original 4 Bratz dolls. Cameron was not released in 2001 like his sister dolls, rather, he was released in 2002 with Dylan as a part of the first edition Bratz Boyz line. He also came with a different poster from the girls, featuring just Cameron. He came with more jewelry than the girls, highlighting either progressive fashion or an increased budget. Honestly I only bought this doll to complete the set of 20th Anniversary Reproductions. Cameron is just some guy. Bratz Boyz are just not as fabulous and pretty as Bratz girls (there is yet to be a Bratz enby so I can’t speak on them). He’s honestly very goofy looking but I enjoy the novelty of owning this doll.", 

"75": "Of all the original Bratz dolls, Cloe is the most disappointing to me. Mainly because she is the only doll to not come with a complete second outfit, as she just has a jacket rather than a second top. Her outfits are still very iconic with the cow print, and I think they’re very cute but I’m not much of a denim girlie so it’s no surprise that she was the last of the reproduction dolls I bought. I also do not like her makeup very much, but I understand that it was a popular style in 2001. My doll also has a bit of a defect where the yellow paint on her scalp, it’s overpainted so she has a weird yellow semicircle on her forehead that I keep forgetting to remove with acetone. While she is clearly my least favorite, this Cloe is so important to doll history, so I really appreciate her.", 

"76": "While I aesthetically prefer Yasmin, this is sentimentally my favorite doll in the 20th Anniversary Reproduction line. This Jade was the first Bratz doll I bought as an adult, and she was my favorite Bratz character as a child so she’s very special to me. Because I was stupid and 4 I didn’t know Jade was Asian so I thought she was the Bratz doll that looked the most like me. I am very white so I look more like Dana than anyone else. In my defense I did not know who Dana was at the time, I thought every doll outside of the main 4 was Meygan. Anyway, this doll is really pretty and I think she aged really well. I mean I don’t see a lot of people wearing hats like hers but I could definitely see a TikTok influencer wearing a very similar outfit. I am very glad that this doll was my first experience with Bratz as an adult.", 

"77": "This doll is a reproduction of the first Sasha doll released in 2001. The only differences between this doll and the original is the holes on the bottom of her shoes and the gradient on her second shirt is shifted. I don’t have the original so I cannot make a comparison. Honestly, I absolutely hate both of the outfits that this doll comes with. I think the skirt is absolutely hideous and the pants are a pain to get on her bend n snap legs because they’re so tight. It’s such a shame because this is such a gorgeous doll. I think she has the prettiest face out of all the dolls in her line. I do think Sasha looks amazing in orange, so I know I’m being a bit hyperbolic, I just really hate this skirt, ok?",  

"78": "This Yasmin is the second reproduction of her initial release, the previous doll being from the Bratz 5th anniversary in 2005. Unlike the original dolls, and the rest of the 20th anniversary reproductions, this Yasmin has nylon hair. When she was on display, I would constantly play with my doll’s hair. That is how I accidentally messed up the braids and why I never bothered to put them back in. This doll solidified for me that Yasmin was my favorite Bratz character. As a child I was a Jade stan, but I think Yasmin was my second favorite. In fact, I named my fish \"Jasmine\" after her. Honestly, I thought her name was Jasmine until I got into Bratz as an adult which is very embarrassing. Regardless of me being a stupid 4-year-old, this doll is stunning and I love her very much.", 

"79": "Pride Nevra was released as a part of a 2-pack with her girlfriend Roxxi. The set was a collaboration with the designer Jimmy Paul. Bratz confirmed that the characters were a canon couple in 2020, but no canonically queer doll was released until 2022. Nevra comes wearing a very elaborate faux fur coat which I adore, but it also covers up most of her remaining ensemble. I pictured her without her hat so you could see her face, but the hat is one of the highest-quality pieces in this set. Since this was a collector release, this doll (as well as Roxxi) features many tiny details. For example, Nevra’s hat includes intersex, nonbinary, and genderfluid pride pins. However, Nevra has always been referred to with she/her pronouns so that is what I will use. In the Bratz canon, Nevra identifies as bisexual and her accessories reflect that here. She wears bracelets (covered by the fur coat) and hair clips decorated with the bisexual pride colors. Her eyeshadow is also bisexual pride-themed. Her shoes prominently feature the Progress Pride Flag. My absolute favorite detail is the tiny Bratz illustrations on Nevra’s pants of all her friends, I think it’s very cute.", 

"80": "Much of the information for this doll is the same as Jimmy Paul Pride Nevra, so see her page for any information missing here. In the Bratz canon, Roxxi is a twin; she and her sister Phoebe were the first set of twin sisters released under the Bratz brand. Unlike her girlfriend Nevra, Roxxi is a lesbian and she wears the lesbian pride flag proudly throughout her outfit. The flag itself appears on the sleeves of her shirt (covered by her jacket in my picture) and her knee-high socks. Rather than the traditional lesbian undercut, Roxxi dyed that part of her hair the lesbian pride colors. Her hat, which is not pictured so you can see her face, features more hidden details. In the same scale as Nevra’s she has lesbian pride and \"Girl P<3wer\" buttons on the top, and under the brim she wrote \"Roxxi <3 Nevra\". Her feather boa matches the pattern of Nevra’s coat. Unfortunately for Roxxi I do prefer her girlfriend’s doll, but I still think she’s stunning.", 

"329": "Rock Angelz was originally released in 2005 along with a movie and video game also called Rock Angelz. I must admit I am not an expert on Bratz lore yet, but I do know that the Rock Angelz band consists of the main 4 Bratz Pack and Roxxi. In 2022, the Rock Angelz were rereleased with notoriously wonky faces. My Sasha doll isn’t too bad, but her lip liner is war too high. I honestly like it because it makes her look more androgenous. I lost one of her bracelets unfortunately, but like most Bratz dolls, Sasha came with plenty of accessories so it’s really not a big deal. One other quality control issue I noticed is that the studs on her jeans keep falling off but I honestly don’t care that much.", 

"350": "This doll, along with Cloe, was a collaboration between Bratz and the clothing brand Cult Gaia, which happens to be created by Jasmin Larian Hekmat, the daughter of MGA CEO Isaac Larian. This 100% was a nepotism moment but I am absolutely here for it because this doll (and Cloe) are absolutely gorgeous. I know very little about fashion but apparently the outfits on this doll are heavily inspired by Cult Gaia staple pieces. The quality and detail of this doll is absolutely incredible. For example, her shoes are molded to include Cult Gaia labels on them. The silver dress, which is not currently pictured because it is Yasmin’s second outfit, is a very high quality metal. I don’t really understand why Yasmin wears purple shoes with that dress but again, I do not understand fashion.",  

"81": "This mini doll is more of a figurine, but it came in a replica box of the full sized doll and I inflate my numbers to make my collection look more impressive. This particular mini DOLL (therefore it counts) is a micro version of Jade’s first release back in 2001. This doll came packaged with mini Rock Angelz Roxxi. Jade is my second favorite of the original release Bratz dolls, but she means a lot sentimentally because she was the first Bratz doll I bought as an adult (the 20th Anniversary version obviously). These mini dolls are a little ugly but it’s a cute novelty to have Bratz dolls for my actual dolls. Also, I did not keep the tiny packaging because I am an out of box collector and it just felt like I was hoarding garbage (do NOT ask about my doll hair brush collection).",  

"83": "This doll is a miniature version of Rock Angelz Roxxi. See Mini first edition Jade for my excuse of why this counts as a doll and Rock Angelz Sasha for my minimal knowledge of the Rock Angelz lore. Each of the mini Bratz came in a blind set of 2 in miniature packaging within purple trapezoidal capsules. This doll came with mini first edition Jade. It’s honestly very difficult for me to tell his doll apart from mini Yasmin because they are so small and their outfits are so similar.", 

"82": "This mini doll, which is a scaled down version of Rock Angelz Yasmin, was bundled with mini Tokyo A Go-Go Collectors Edition Kumi. Look at mini first edition Jade for my argument including these in my doll collection. Honestly I wish this doll along with Roxxi came with mini molded on guitars but for the low price point (also I bought them on clearance) I can’t complain. I honestly don’t have much to say about these dolls because they mainly exist as a gimmick.", 

"84": "Of my four mini Bratz, this one is hands down my favorite. For a start, she is the biggest, with the figure allowing the garment to take up as much space as it needs. Additionally, Kumi’s arms are up while the other three dolls have their arms down at their sides. She’s the most eye-catching of my mini dolls. She was packaged with mini Rock Angelz Yasmin and completely overshadows poor Yasmin. I don’t know the lore of Tokyo A Go-Go but this mini doll and the full sized doll are absolutely stunning.", 

"399": "In 2022, MGA released a reproduction of 2005 Wild Wild West Kiana. Wild Wild West is probably the most significant western line in the Bratz franchise. For this reproduction, the doll no longer came with rooted eyelashes, painted teeth, or beaded hair. Additionally, the jewelry and purse were removed. The hairbrush (which is obviously the most important part of the doll) was switched from the Bratz star mold to the original and more traditionally shaped Bratz hairbrush. There are some weird marks on her top that I thought were a mistake but apparently they are factory. I’m not complaining because it means I don’t have to do anything but it does look a little weird. Wild Wild West was the first appearance of Kiana in the Bratz franchise. She has only appeared as a doll in Wild Wild West lines and this reproduction so I’m not sure why she was picked for series 2 of the reproductions. I’m not complaining because I love this doll, but I do think it’s weird that she was picked over Fianna. The pants in her second outfit are my favorite piece because they feel really high quality and they are just a very nice sensory experience. Her second top is unfortunately a little too small so it looks weird on a Bratz doll. She will remain in her first outfit for the time being.", 

"330": "This doll is a reproduction of 2005 Ooh La La Paris Kumi. The Bratz pack line was a sequel to the 20th anniversary reproduction dolls of the first edition main four Bratz characters (and one of the boys). This sequel series includes four supporting Bratz characters in one of their most iconic looks (and another boy). Their second outfits are also included. However, many of the original pieces, specifically purses are missing. In the case of Kumi, she no longer comes with her shopping bags, purse, fur stole, or child sized lip gloss. However, the reproduction adds a second pair of shoes. Notably, the Ooh La La Paris line included painted arms and legs. The reproduction is faithful with the painted legs, but the arms are no longer painted. Also included is a poster that compiles all the reproduced dolls in a similar style to the 20th anniversary poster, which was a recreation o the original 2001 poster. I love this doll, and I was too young to remember 2005 fashion but it seems very 90s to me, especially with the hat.",  

"331": "The Bratz Pack Meygan is a reproduction of 2002 Xpress It! Meygan. See The Bratz Pack Kumi’s description for an explanation of this line of reproductions. This doll is very faithful to the original release with the exception of the bag, which has been removed. Interestingly, Meygan’s shoes do not have holes in the bottom which were not added to Bratz dolls until 2003. I think this is my favorite playline Bratz doll currently in my collection. I think her second outfit is very ugly but her first ensemble is stunning.", 

"398": "Nevra is probably the most unique of the main series reproduction dolls because unlike the others in her line, Nevra was originally released as part of a playset. In 2003, Nevra was packaged with the Formal Funk Super-Stylin' Runway Disco. This playset was the first to utilize the holes in the bottom of Bratz feet (so they could stand on the runway). The reproduction does not include the second pair of shoes or the purse. Rereleasing this doll came with a dilemma. All the main-line reproduction Bratz came with second outfits, so they needed to scramble to add one to Nevra. Rather than adding an outfit specifically designed for Nevra, they added Jade’s Girls Nite Out! third outfit. I assume this is because Girls Nite Out! was also reproduced at the same time but without the third outfits. That way MGA wouldn’t have to reissue the same outfit twice. Of course, I am just guessing. Since Jade and Nevra have different skin tones, the shoes were altered to fit Nevra. The way this doll was packaged made me mistake her coat as part of the second outfit which is why I didn’t include it in the picture. Honestly It feels very cheap and unpleasant, so I don’t want to retake the picture. Nevra is a really important character to the Bratz universe because she is the only canonically bisexual Brat doll. As a bisexual Brat doll myself, I really appreciate the representation."

 }]