[{
"85": "In 2006, Mattel released this Little Mermaid playset in the scale of Polly Pocket (at least her scale at the time). I got this as a very young child, so unfortunately everything other than the doll is gone. It wasn’t in the best shape anyway because my sister scribbled all over it with pen. I was very upset but it’s not like I have the space for it now. This doll’s face is a bit wonky and her hair appears to be saran in dire need of a boil wash. I thought it was polypropylene at first which resulted in a disastrous appointment with the hair straightener. This doll is very sentimental but I honestly forget her frequently.", 

"88": "Similarly to how Mattel owned the license to Disney Princesses, Jakks Pacific also owned the rights to produce the Hannah Montana dolls (alongside Mattel) during the show’s initial run. This specific doll shows Miley Cyrus’s self-insert character at the beach she frequents in the television show. These dolls are certainly something. As a child, I had many of them because I was completely obsessed with Hannah Montana. All that remains are two dolls who look like the intended celebrity but are still pretty ugly. I unfortunately lost all of Miley’s clothes, but I do have some surviving Hannah pieces that I dressed her in for her picture. I’m really impressed that this doll has kanekalon hair because that is my favorite kind of doll hair. I’m sure I loved this doll very much as a child so I appreciate her but she’s certainly not my favorite now. ", 

"89": "This doll is an absolute joke to me. Unfortunately, I no longer have any of his pieces but my memory was distinct enough to identify him. He is based on Mitchel Musso’s character. I love how they molded on his super 2007 hair; it really makes the doll slay. Sadly, the paint has started to chip on my doll. The joints also feel weird and not very smooth. I guess the budget went into Miley’s kanekalon. I thought it was funny to hide this doll places and see if anyone noticed but nobody else found it very funny.", 

"86": "For the release of High School Musical 2, Mattel released a line of corresponding dolls. Interestingly, these dolls are made in the scale of Mary-Kate and Ashley dolls. To the shock of absolutely nobody, Sharpay was my favorite High School Musical character as a child, but I was also scared of her when I watched the first movie. I guess I was just afraid of seeing myself but blonde. I absolutely love Sharpay’s color palette and fashion sense, this was definitely my favorite High School Musical doll as a child. Sadly, I am missing all of her clothes and accessories, but I have vivid memories of everything except the bag. The silver paint on her earrings have chipped off so that’s why they are a turquoise color. My doll is also in dire need of a boil wash. I wish that her arms didn’t stick out so much but that’s more a fault of the body sculpt rather than this specific doll.",  

"87": "Throughout their original tenure of owning the Disney Princess license, Mattel sold yearly releases of generic slim box editions of the Disney Princesses in slightly altered versions of their signature looks. This is one of those generic slim box editions. When I was in first and second grade, I randomly became obsessed with Sleeping Beauty. I think this is the earliest circumstance where my sister and I both got this doll at the same time. My sister was at that age of wanting to do everything her big brother liked so she got the same doll. I took this doll to school with me frequently and as a result her dress has not fared well over time. Tragically, the neck completely snapped off during the storage era. I was very distraught because this doll means a lot sentimentally, but I was able to repair it. Luckily, my sister is normal and doesn’t care about dolls anymore, so she let me keep the nicer one. I no longer have any of the accessories to this doll but honestly, I don’t have any significant memories of them so I’m not bothered.",  

"90": "The Mattel versions of the Hannah Montana dolls appear to be more forgotten but higher quality than their Jakks Pacific counterparts. In my opinion, they look less like the actors than the Jakks dolls (I think the Mattel Hannah/Miley dolls look like Jana Duggar personally). These dolls are also on the Mary-Kate and Ashley bodies, so they are the same scale as the High School Musical dolls. These dolls are very generic, so I could only mark them by their character name and note that she was sold in the two-pack with Miley. I no longer have any of the clothes but my memories of them are hazy anyway. I really love this doll’s eyes and her kanekalon hair but I forget about her often.", 

"91": "This doll looks identical to the Hannah from her set except for her brown hair. I don’t have any of her clothes anymore unfortunately. Like Hannah, she has the Mary-Kate and Ashley body so she’s a slightly smaller scale compared to Barbie and the Jakks Pacific Hannah Montana dolls. Her original outfit is very Disney Channel so maybe it’s not so bad that I had to redress her. She still looks more like Jana Duggar than Miley Cyrus to me and I’d like to formally apologize to this doll for that comparison because she does not deserve it.", 

"92": "This doll is definitely in the top ten most annoying dolls I’ve identified. I have distinct memories of getting her at a Disney Store my parents didn’t usually take my sister and me to, and that she came in a little plastic case that I kept for several years. My usual doll resources did not have any information since this Aurora is a mini doll rather than a fashion doll. Once I figured out that she was from the Darlings line, which featured the Disney Princesses of the time in this chibi form, it took me forever to find a date because the tags for these dolls had no date. Luckily, there were a couple of playsets associated with this line that made it easier to identify a date for this doll. I got this doll during my Aurora phase, and I still think she’s very cute but Rapunzel is my favorite princess now so I don’t care that much about Aurora as a character.",  

"93": "This is one of my earliest surviving Disney Classic dolls. Disney Classic dolls are essentially the \"signature\" fashion dolls sold at Disney Stores. They are usually budget releases, so the quality leaves a lot to be desired. They are usually updated each year. This is the 2009 version of Jasmine. She’s alright I guess. I no longer have her shoes, headband, necklace, scarf, or Rajah figure. Unfortunately, this doll has polypropylene hair and large, nonremovable earrings that often get tangled in her hair. I must admit I don’t know much about Jasmine as a character. I don’t think I’ve ever seen Aladdin. However, I went through a phase where Jasmine was my favorite Disney Princess shortly after the Aurora phase. It was almost entirely because she wears pants. I also thought Jasmine was beautiful, but I was more focused on the fact that she wore pants. I was easily impressed; dolls with glasses had a similar effect on me. I think this doll is beautiful but all of her pieces are very low quality which is not very slayful.", 

"94": "Along with my Jasmine, this is the 2009 version of the Disney Classic Snow White. See Disney Store Jasmine (2009)’s description for an explanation of the Disney Classic dolls. The glitter on her dress’s bodice has started peeling which is unfortunate. I also straightened her hair to try to take care of the polypropylene and it looks absolutely horrible so I apologize for that. I am missing this doll’s headband, shoes, and dwarf figures. I partially like this doll’s face. I think her makeup looks beautiful, but I’m not a big fan of her head sculpt. Her dress is pretty simple but fairly faithful to her signature dress, minus the glitter. But that will flake off soon anyway.", 

"95": "I cannot find a picture of the version of this doll I bought, so I apologize. I’m almost certain that it is just a repackaged doll with an extra outfit though, so if you close your eyes and ignore the second outfit it’s the right name for the doll. I got this doll at a Disney store in the United Kingdom, so maybe there are British doll databases that can fix this mistake. Anyway, this is the second version of the Disney Classic main release of Tiana. I ruined her hair and I tried to fix it but it went very badly so it’s just straightened out right now. I did not do a very good job and I am very embarrassed. I don’t want to talk about it. I have since lost Tiana’s tiara and shoes, but as I said I do have the extra dress my doll came with. It’s her blue dress. Personally, I prefer her green dress because I think it’s more unique and interesting so that’s what I photographed her in.", 

"96": "Currently I have one of the triplet dolls cleaned and accounted for in my collection, but I swear I still have at least one of the other ones. Regardless, these dolls are interesting because they are fully rooted (with stinky poopy polypropylene) yet only articulate at the neck. The rest of the body is one solid piece. The three triplets are also identical, so this was a very lazy release. Similarly to their mother’s doll, the triplets can also turn into bears, but it’s one smaller rubber piece rather than the hard plastic carrying case. I always preferred the Elinor bear because it was more versatile (basically I could store things in it). I’m not really interested in child dolls but this one is certainly unique.",  

"97": "In promotion for the 2012 Disney Pixar movie Brave, the Disney Store released a line of dolls for the characters. This Merida is considered the \"signature\" doll for the line, as well as her first \"Disney Classic\" doll. I have lost many of her pieces, including her cape, one shoe, her bow and arrows, her sheath, and the archery glove. I’ve had too many adverse experiences with archery that I couldn’t be bothered to learn the official name. It always bothered me that the glove prevented one of her sleeves from having the lace trim. My next grievance is that this doll has the horrible polypropylene hair. Most of my Disney store dolls from this time period have this horrible hair fiber. I’m not sure how I feel about this doll herself to be honest. I appreciate that she’s articulated I guess.", 

"98": "This doll was also part of the Disney Store’s initial Brave collection of dolls. Another version of this doll was released where she did not come with the bear. Not pictured is the bear, which is essentially a case for the Elinor but represented when she turned into a bear in the movie (it’s been a long time since I saw Brave so please don’t ask me to elaborate). The bear comes in two pieces, and I remember using it as a storage container for my doll accessories as a child. This doll suffers from the typical problems of Disney Classic dolls of this era, with her poly hair and her cheap satin gown. My doll is missing her belt and to be completely honest I couldn’t be bothered to learn how to put the ribbons back in her hair. I wouldn’t be able to do it on my own anyway. Another interesting detail about this doll is how short her heels are. The mold for this pair of shoes is odd because for the doll to stand (hypothetically, obviously it’s nearly impossible for a doll with heels to stand on their own) she has to bend her ankles all the way forward. Anyway, this doll is kinda meh for me aesthetically. For a while she had a green stain on the tip of her nose from me shoving her into the bear case but I got rid of it. That stain is what I think of first when I think of this doll which probably tells you how forgettable she is.",

"99": "This doll appears to be the signature release of Cinderella made by Mattel as part of the live action movie line. She has the body of a Barbie collector of that time. Her hair has tinsel which most people don’t like but I don’t mind that much. I got my doll secondhand, so I am missing her shoes. I really love the face sculpt they used for this doll. I had to look up who played Cinderella in the live action movie, but I do think the doll translates Lily James’ face well. She looks a million times better than the live action Belle dolls that came a couple years later. This doll does look a little angry, but I think she looks beautiful. Also, apparently people are charging a lot of money for this doll which is embarrassing because I found her for like $3 at a flea market.",  

"100": "This is one of the many toddler Disney Princess dolls released by Jakks Pacific. She originally came with a play tea set and a Pascal figure that I do not have. Her dress has Velcro all the way down the back for (I assume) easy use. This doll originally had polypropylene hair (yuck) but I rerooted it with saran. Usually, I do not buy toddler dolls because I have no interest in them but Goodwill was about to close and I made an impulse decision. I saw a filthy Rapunzel doll in need of a father who could take care of her so I decided to pay the $3 and adopt her. It wasn’t until I got home that I realized that she had a big chunk of hair missing right in the front. I know how to clean dolls (obviously) as well as take care of poly hair but I cannot make doll hair grow back (yet.). I decided to use this problem I gave myself opportunity to teach myself how to reroot. I learned a lot in this process, most notably that rerooting is a lot of work and I do not enjoy it. I think I would have had a better time if I rerooted a fashion doll because they have much smaller heads and therefore significantly less hair plugs. It was absolutely worth it though because Rapunzel looks so much better. I just wish this project did not take so long.", 

"386": "In 2022 Mattel regained the license to make Disney Princess fashion dolls, and this Rapunzel is from the premier series of slim boxed princesses. I chose Rapunzel because she is my favorite Disney Princess, and I thought the doll was very cute. The bodice of the dress is unfortunately molded on, but I think it is unique and glittery enough to not mind so much. Additionally, this doll comes with shoes. Rapunzel dolls often do not come with shoes to be more accurate to the Tangled movie (or more realistically, save money). This doll has a very pixelated face, but I think it looks cute. She also has polypropylene hair which is disappointing; any child who plays with this doll is going to frizz up the hair very quickly through no fault of their own. It is a decent length for a slim box doll, but Mattel can absolutely afford to use saran, so they get no points in the hair department.",

"440": "This poor hideous doll was the first iteration of the princess dolls sold at the Disney Store. She has a very cheap imitation Mattel Twist N Turn body and a bizarre facial screening that looks nothing like Snow White. The main difference between this doll and the following releases is the shape of her hands, they look like she is attempting to do a limp wrist but forgot to actually bend her wrist. This doll also has polypropylene hair which I despise. This Snow White came with the most basic version of her signature dress that I unfortunately do not have (which is just devastating big frown). I got this doll from my friend Gideon who played with her as a child, so she needed a lot of work but I was happy to adopt her as one of my many daughters. The one touch on this doll I do like is her tiny red stud earrings, I think they are very cute and a pretty color.", 

"441": "This is one of the more unique Disney dolls in my collection. Rather than featuring a Disney princess in an elegant gown, this Aurora came in modern pajamas. She is apparently having a slumber party but the line featured other princesses and Tinker Bell doing other activities so I don’t think she invited anyone. This is a very unique doll for her time, not only for her clothing choices but also because of her hair styling (it is in two braids rather than down) and her lack of earrings. This is the only Sleeping Beauty doll with this hideous facial screening to not have pierced ears. This made identification a lot easier because I could not see her hair thatching well under the polypropylene frizz. This Sleeping Beauty also has the weird imitation Mattel body but I was so distracted by her ugly face that I couldn’t be bothered to complain again.", 

"442": "The Disney dolls I had as a young child were made by Simba toys, which mostly makes \"fakie\" dolls such as Steffi Love. In the early 2000s, Simba temporarily had the Disney license in Europe. One of my earliest memories of getting a doll for Christmas was the Singing Ariel with the original face and an additional outfit. This was one of my favorite dolls as a child and her extra dress became absolutely destroyed. Unfortunately, I no longer have that doll because my mom got rid of her when I was in middle school. Rebuying that doll is one of my grails even though she is not very expensive. Anyway, this doll was a later release, she has a different face from my childhood doll that honestly looks more like Ariel. She came with some charms to put on either a bracelet or on pieces of the doll’s outfit. I cannot find pictures of this doll in the box but I have been able to find pictures of the Cinderella from the same line. I was also able to find a commercial but it was in Polish so I couldn’t tell you what it said. This facial screening seems to be reused but Ariel’s tail appears to be unique in this case. The box date is approximate because I cannot find it anywhere. I have memories of getting the Cinderella from this line in the store around 2008 so I just put that, but it could possibly be in 2006 or 2007. I don’t have her top so she’s wearing my Disney Store Classic Ariel’s top because I don’t have that doll’s tail so she wears a fashion pack. This doll was another gift from Gideon and I really appreciate him for giving this doll for me because she reminds me so much of my favorite childhood doll.", 

"443": "As I’ve shared before, I had a phase when I was in elementary school where Aurora was my favorite Disney Princess probably because her dress was pink. I lost interest after I got older and honestly didn’t give the character much thought after that era. That includes when my sister and I occasionally picked out Disney Classic dolls. Disney Classic dolls are essentially the standard signature versions of each Disney Princess and other extended characters (such as Alice or Tinkerbell) sold at the Disney Store. There’s usually a new version released each year. The changes each year are minor, varying from the shape of the hands to the articulation of the knees. Often these dolls are repackaged in various giftsets. I really hate finding these dolls in the wild because they’re such a headache to identify. The Disney Store doesn’t print box dates on their dolls so I have to do a lot of guesswork and cross reference my sources. It’s not fun. Anyway, this is the 2009 version of Aurora’s Classic doll, and she’s in rough shape. The most obvious thing is that she has cut bangs. Poor girl has TERF bangs. I did my best to even it out but it still doesn’t look great. This doll is also missing all her accessories including her crown, necklace, shoes, hairbrush, and little fairy figurines. Interestingly, her face sculpt has raised eye lids. I do think her makeup looks very pretty but the bangs distract from her face too much for it to be really appreciated. I just feel bad for this doll.",  

"444": "I’ve never been much of a Belle girlie, honestly, I always thought the people who chose Belle as their favorite Disney Princess were super pretentious but that’s probably because someone who wasn’t very nice to me in elementary school was like that. Anyway, I’ve explained the concept of the Disney Classic dolls before but it doesn’t really matter much. This doll is just Belle in her famous yellow ball gown. She has an interesting facial screening that I can’t decide if I like. It just doesn’t immediately scream Belle to me. It’s just giving generic princess. The dress is very pretty but unfortunately the Disney Store is very cheap with their doll clothes so I worry about it fraying. I got this doll secondhand so she’s missing her gloves and various accessories. I don’t mind though, I’m just happy to have her in my collection.", 

"445": "During the late 2000s and early 2010s, Jakks Pacific had the license to produce the Disney Fairies dolls. I was never that focused on the Disney Fairies as a kid, the little dolls I had (which I still haven’t been able to identify from memory) were extremely fragile and fell apart so I quickly lost interest. Anyway, this doll comes from the fairly obscure Flower Garden Party line and features the Fairies in slightly embellished versions of their signature looks. Their wings were attached with Velcro on the back of their clothes. Unfortunately I’m missing my doll’s wings because I got her secondhand. I’m also missing her shoes. Luckily (for identification purposes), the headband was still attached. When I find a new type of doll, I’m always fascinated by their composition. Here, Rosetta has rib articulation but solid legs which I find fascinating. Rib articulation still isn’t standard on Barbie in 2023 so I’m surprised Jakks Pacific included it here. I’m a bit disappointed by the polypropylene hair but I can’t be that surprised. Anyway, I’m not quite sure what the embellishments on this dress mean to the character or the Disney Fairies lore but I think it’s very pretty and looks cute on Rosetta.", 

"446": "What’s funny about this doll is that my sister used to have her when we were kids, but I destroyed her during my haircutting phase. Ariel was my favorite princess when I was really really young but I was a Rapunzel girlie by the time my sister got her doll. This specific doll was a secondhand find, and she was missing her tail. She came wearing her top underneath a dress from a Disney Store Ariel fashion pack. Identifying that was not fun. Usually, I would whine about how I’m missing her original outfit but honestly this version of Ariel’s tail is so cheap looking that I don’t like it and I’m glad she gets to wear the pink dress instead. This Ariel is distinct because she doesn’t have the bangs most Classic Ariels have. The articulation is a little weird looking because Ariel’s feet are tiny. It doesn’t really matter though because she’s supposed to be wearing a mermaid tail.", 

"447": "This was a Disney Store gift set that featured mini dolls of Ariel and all of her sisters in mermaid form. I’m pretty sure the size is similar to the mini Disney Princess dolls from the 90s. Initially, I thought this was a Belle doll because of her hair and color scheme which was very confusing but luckily the pack this doll came from appeared on Google pretty fast. This doll has a miniature version of Ariel’s head sculpt at the time so honestly it makes a lot of sense. The tail is removable and Adella has tiny bend and snap legs which I found interesting. She also has horrible polypropylene hair that makes me very mad. I can’t say I’m surprised though. It’s been many years since I’ve watched the Little Mermaid so I can’t tell you anything about Adella as a character except she looks a bit like Belle. I do feel a little bad for this doll because she got separated from her sisters so I’m going to make sure she’s pampered and taken care of.", 

"449": "By the time this doll and the associated movie came out, I was no longer interested in Disney Fairies so I can’t tell you anything about it. I’m guessing this character is a pirate though. This doll has attached wings and a flutter mechanic, where her wings move if you press a button on her back. I’m missing Zarina’s shoes unfortunately, as I got her secondhand. I also broke her earring when I was identifying her, and it was entirely my own fault. Sorry about that. This doll has a very stereotypical pirate woman outfit, and I worry it’s also inspired by caricatures of Romani women, but I’m honestly not sure. Obviously the highlight of this doll is her wings, which look really cool in my opinion. I’m not very experienced in the world of doll fairy wings so I’m not sure how this doll ranks. The glitter started to flake off as I cleaned her wings which was not very slay. I’m irritated but not surprised by this doll’s polypropylene hair, and I doubt you are either at this point. She also has the smirking facial expression which just reads as being the most insufferable person ever so I’m not a fan."

}]