[{

"101": "Getting Fairest was the third and final line released from Ever After High in 2013. It’s basically the first four characters getting ready for their day. They come in nightgowns and are packaged with specialized shelves to hold their favorite accessories and a hand mirror. Apple comes with pink and gold tiaras. I used to use these shelves as chairs for these dolls when I played with them in secret. My doll has a slight haircut (she got lucky) but her remaining hair is unfortunately completely covered in glue. Her hair looks wet in the picture, but I promise it’s just the glue. This doll has minimal makeup (since she’s mid-yaassification) which isn’t my favorite, but I still think she’s very pretty. I think her apple-shaped hair barrette is really cute and puts her over the edge as my favorite from the line.",  

"102": "Briar is the most unique doll in the Getting Fairest line, as far as outfits are concerned. She wears a romper rather than a nightgown and she has a prominent flower-shaped hair wrap accessory. See Getting Fairest Apple White for my explanation of this line. Briar’s caddy features gaudy pairs of sunglasses. In the Ever After High media, Briar often wears sunglasses to help her sleep during her various naps. See Signature Briar Beauty for a more in-depth description of the character. This doll’s facial screening is supposed to look like her makeup is not yet done. I think this Briar is still very pretty but she is only a partial slay.", 

"103": "Maddie is my favorite doll in the Getting Fairest line, mainly because of her accessories. Her outfit is cute too but I was and still am absolutely obsessed with her caddy. See Getting Fairest Apple White for my explanation of this line because I’m too lazy to repeat myself. Maddie’s caddy accessory is her quirky headbands. Unlike the rest of the dolls, she came with three headbands while everyone else came with two of their accessory. The other dolls each came with their own hair accessory so it balances out. To accommodate the hair accessories, Maddie’s caddy is a different shape. Rather than the three shelves, there is a curved space to place the headbands and one shelf underneath. When I played with my Ever After High dolls in secret, this was my favorite one to use as a chair. I think this Maddie doll is very cute despite how simple she is. I love her light purpley-pink makeup. It looks so pretty. I also love Maddie’s hair because it is a bit shorter than her other dolls and it’s always nice to see a doll with shorter hair. Unlike Apple and Briar, Maddie has not leaked any glue yet which I’m very happy about.", 

"104": "Apparently Raven Queen is one of those girlies who cannot get ready without listening to music, because she is the only doll in this line to come with her headphones. They are very slayful but they made her ears cave in for all those years she kept them on. Of course this was easily fixed but it was just something I thought was important to note. Raven has my favorite robe with the gorgina gothic sleeves and the black lace. Her makeup is very plain but still very delicate and pretty. I would describe it as a more business-appropriate version of her signature makeup. Raven’s caddy accessory are collars and they are so slayful. They’re not pictured because they are buried in my accessory container but the purple one is definitely my favorite even though they’d look ridiculous on this doll.", 

"105": "In the Ever After High universe, Legacy Day is essentially more important than your wedding day. The sophomore students of Ever After High basically dress up and legally bind themselves (with magic) to \"follow their destiny\" or relive the original fairytale they descend from. Apple White has essentially the best \"destiny\" possible because she is the daughter of Snow White and will become the queen of Ever After. It’s not ever explained why Snow White and the Seven Dwarves is treated as the number 1 fairytale but I assume it’s a tribute to the Disney movie for being the first Disney Princess. Apple’s outfit is very of her time. She wears a high-low dress with a crown fascinator (that she is not wearing in the picture because I have to take care of glue seepage). She has fairly simple and delicate makeup which I usually complain about but I think it looks very nice here. Her shoes are a little loose, which always bothered me as a child. I’m guessing they were molded for a doll wearing tights. I really like how Apple’s color scheme looks with this outfit, especially on her bodice and cape. It’s covered by her cape in the picture but one of my favorite details is her cartoonishly large apple ring.", 

"106": "Briar was more of a background character in Legacy Day so I’m not sure why she was included in the first wave. At this point in the series, Briar is on the \"Royals\" side, meaning sticking to the status quo of the whole destiny debacle. See Signature Briar Beauty for more information about her character and see Legacy Day Apple White for more information about the Legacy Day line. Briar looks like she’s going to prom in 2008 in this dress but added a cape to be obnoxious. I’ve always thought this doll looks like Snooki so maybe this vibe was on purpose. I don’t mean this as an insult, I think this doll is beautiful and I don’t have anything negative to say about Snooki, she slays. This dress is very tacky though. Like the leg cut out with the black and pink but the halter top is such a pain. I do like the rose vine motif throughout the look but that’s not unique to this doll, pretty much every Briar doll features this. Despite the dated look, this doll is still very cute. My doll is accidentally wearing Signature Briar’s earrings but I don’t have time to retake it so please just ignore that. Her tiara (along with her cape and belt) are not pictured because I was lazy and they don’t like to stay on. This doll just feels like she’s missing a flip phone.", 

"107": "Raven Queen’s actions during Legacy Day are essentially the inciting incident for the entire plot of Ever After High. She refuses to sign the Storybook of Legends and pledge to relive the actions of the Evil Queen and essentially become public enemy number 1. See Signature Raven Queen for a more in-depth explanation of this and her character. For Legacy Day, Raven wears this elaborate outfit that somehow still reeks of 2013. I mean look at those leggings. I was too lazy to include her collar, cape, or headpiece in the picture because they don’t like to stay on. I also couldn’t be bothered to recreate her original hairstyle. Sorry. This doll has a bit of a factory error with her earrings because one of the hole was put in her cheek instead of her earlobe. I pretend I do not see. I think this Raven has the prettiest makeup of the 3 released in the first year of the brand. She’s also the only one to have painted nails which is always a bonus.", 

"108": "Ever After High has very complicated lore and essentially the whole plot is a metaphor for class consciousness. Apple Whites comes from the highest privilege, she represents the bourgeoise because the way the system of Ever After works gives her the absolute best outcome (she literally becomes the highest ranking and most powerful queen in the fairytale universe exclusively because Snow White is her mother). Apple is the number one supporter of the status quo, which is reliving and retelling their respective fairytales. She is not a bad person for this, and she sees this as the most moral position because she has spent her entire life preparing to be the best leader possible. She’s also really good at solving petty conflicts. If you have any more questions just watch Ever After High because I’m not sure I’ll be able to explain it adequately. This was the first Ever After High doll I received as a child, so she is sentimentally one of my absolute favorites. Her outfit is very dated, it’s giving 2010s British pop girlie. Both of my dolls unfortunately have glue seepage which isn’t surprising because they are both Mattel dolls with saran hair released in 2013. I got my second doll as an adult because I thought I had lost my original, but I obviously (and thankfully) found her. My second Apple is the wonkiest doll in my collection, so she is absolutely hideous. I still appreciate her for being a placeholder until I found my beloved original doll but she’s so scary I would absolutely give Jonah free reign to throw her into a pool as many times as he desires.",  

"109": "As the daughter of Cinderella, Ashlynn Ella is cartoonishly obsessed with shoes and can talk to animals. The way she dresses reads as what Americans think southern British people dress like. I can’t describe it any other way. In the Ever After High lore, Ashlynn is the first character to switch sides during the \"Royals vs. Rebels\" divide after she decides to tell everyone that she’s dating Hunter Huntsman, who is not her Prince Charming (gasp). She still remains in the Royal friend group with Apple and Briar and honestly I think they forgot to do much more with this plot line. Ashlynn’s face mold is probably the most objectively beautiful and I love it very very much. I had to take my doll’s hair down when I cleaned it, and she has some of the worst glue seepage I’ve ever seen. I was able to successfully treat it but I have not yet updated the picture. I’m sorry I’m busy. My favorite part of this doll is her shoes, Ever After High dolls all have fantastic shoes but I love the faux glass of Ashlynn’s. At a glance they’re just simple pumps but the pseudo straps and the heels really enhance the fit. Ashlynn was originally sold in a 2 pack with Signature Hunter but she was later rereleased on her own with the same corner cutting (getting rid of her jewelry and things like that) as all the other rereleases. This doll is so beautiful and I really treasure her.",

"110": "Blondie is the daughter of Goldie Lockes, and runs a school sanctioned (for some reason) gossip show that everyone watches at Ever After High. She is considered a Royal because she wants to follow her destiny but also she lies to everyone and insists that she is a descendant of a queen. My doll has a bit of glue seepage, but her bangs have always been bad. When I was a child and had her I tried to keep them in their factory style with the factory hair gel but my friend came over and pushed them so there was a gap in the middle which upset me a lot but I didn’t say anything because I was too shy. I could fix it now but I have too many other doll projects to worry about. Honestly, this doll’s outfit is so tacky and ridiculous so I would never wear it, but I think it’s supposed to be inspired by Lolita fashion so I’m very sorry to that community for insulting your style. Blondie’s face is mid compared to other dolls like Ashlynn and Cerise but she’s still pretty. Her shoes are very cute and the heels are key-shaped so they’re my favorite part.", 

"111": "Briar was one of the 4 dolls released with the launch of Ever After High. She is the daughter of Sleeping Beauty and also the only doll of color in the main cast. The lack of racial diversity is Ever After High’s biggest problem and it’s honestly really disappointing. Briar is a party girl who has essentially already accepted her destiny of sleeping for 100 years, but she feels constant FOMO so she does a lot of extreme sports and activities while she can. Of course because Mattel is silly, they did not release any extreme sports themed Briar dolls or fashion packs booooo. Briar is Apple’s best friend but she does snap at her for being insensitive during Thronecoming about the whole destiny thing. They make up but Briar slowly made less appearances in doll lines and was replaced more and more with Ashlynn. Hopper Croakington II (son of the frog prince) has a massive crush on Briar but it’s not reciprocated nor is it explored much. Honestly, Briar deserves so much better. I accidentally put this doll’s earrings on Legacy Day Briar, sorry. I also had to take out her hairstyle when I cleaned her and I’ll have to do glue treatments too. Unfortunately there is no way I’ll be able to recreate it, sorry about that. Briar’s outfit is so 2012 and feels really dated but she does look pretty. She looks gorgeous with the rose motifs that are her signature pattern (I’m not sure if pattern is the right word).",  

"112": "Cerise is the daughter of Little Red Riding Hood, but she is also the daughter of the Big Bad Wolf, and this is treated as a big secret that would become a sandal in the lore. This is obviously an allegory for being biracial, but I’d also argue that it’s also symbolic of living outside the gender binary. Cerise is physical proof that the destiny thing is entirely socially constructed and oppressive. I don’t think it was initially intended to be that deep but this is my doll and I’m allowed to extrapolate the media however I want. Cerise also dresses in a queer way, like in my opinion she’s serving lumberjack lesbian meets 2013 Pinterest but she slays. Because she is half Big Bad Wolf, Cerise has magical powers that make her run supernaturally fast and other werewolf-like abilities. Cerise has a really beautiful face mold that I really love. The only thing I’ve lost from this doll is her ring but I’m totally not bitter at all. Honestly the Ever After High rings were a terrible idea because they were constantly falling off. <br><br>&nbsp&nbsp&nbsp funny enough, the day after I wrote this, I found another Signature Cerise, and she had her ring! I was so happy", 

"113": "Cupid exists in Ever After High as the first crossover with Monster High, as she was originally a Monster High doll. Cupid seems to be at Ever After High to be a sort of facilitator for \"true love\" but she is a \"rebel\" that believes that people should love whoever they want (I wOnDeR wHaT tHaT cOuLd Be A mEtApHoR fOr). Cupid is also hopelessly in love with Dexter Charming, who is the less popular brother of Daring Charming and is in love with Raven Queen. Raven reciprocates these feelings which is very unfortunate for Cupid but she gets over it quickly. After this love triangle arc, Cupid doesn’t do much and is honestly forgotten about. She doesn’t even appear in the only surviving part of the crossover, which is the 4th book in the Shannon Hale book series (which are actually unironically good). Despite being essentially ignored halfway through, Cupid has some of the most beautiful faces in the Ever After High line. My doll is missing all of her jewelry which totally doesn’t make me want to cry at all…", 

"114": "Hunter Huntsman is the first male Ever After High doll released, and he was exclusively sold in a 2-pack with Ashlynn Ella. In the Ever After High universe, Hunter and Ashlynn are dating but it is quite the scandal because they’re breaking the tradition of their ancestors. Hunter is destined to be the huntsman from Snow White and Little Red Riding Hood, while Ashlynn is supposed to become Cinderella. This doll is also unique because he has flocking for most of his hair. Flocking is essentially tiny bits of plastic fluff glued to the doll’s head. He also has a long piece on the top and styled to the side. It’s so very 2013. I’m not much of a woodlands girlie and I think his haircut is atrocious so I don’t love this doll. I still appreciate him as for a while he was the only male Ever After High doll.",   

"115": "Maddie Hatter is probably the best character in Ever After High. She is the daughter of the Mad Hatter from Alice in Wonderland (see Way Too Wonderland Apple White for an explanation of the confusing Wonderland lore in Ever After High), and she represents an ally in any civil rights movement. In the destiny debacle, Maddie has a unique position (at least of the characters highlighted in the show and dolls) where she loves her assigned destiny but she strongly sits on the \"rebel\" side because she sees how much destinies can harm others. Raven is also her best friend and she is aways her fiercest defender. Maddie is from Wonderland, so she often speaks in Riddlish which is literally speaking in riddles. Maddie is also in a unique position where she can hear the narrators and also talk to them. The other Wonderlandian characters can also hear the narrators but Maddie is the only one who actually engages with them. Maddie is constantly seen as insane, which is a term she embraces. Personally, I see this as her being autistic but maybe I’m projecting. She’s also the most empathetic character which is why I’m claiming her. Another unique thing about Maddie is that her father is nearby, but he isn’t a teacher at Ever After High. Ever After High is actually a boarding school, unlike G1 of Monster High. The Mad Hatter runs a tea shop in Book End, which is essentially the downtown shopping district of Ever After. Maddie and the other Wonderlandian characters have shorter bodies, which I really appreciate because diversity is always nice. My Signature doll is a little wonky but I think she’s still gorgina. I love the color combinations of this doll and her polka-dot gloves and tights are such a cute touch. I took my doll’s headband off the picture because it doesn’t like to stay on. Also, my doll has lost her ringlets from washing her hair but I would need to redo them anyway because she (and this is a shock to nobody) has glue seepage.", 

"116": "Alongside Apple White, Raven Queen is the protagonist of Ever After High. She is the daughter of the Evil Queen from Snow White. Under the destiny rules that are essentially a metaphor for socialization under capitalism, Raven must reenact her mother’s actions and essentially become the main supervillain of the entire world of Ever After. Raven refuses and essentially leads a revolution of teenagers with names comprised of bad fairytale puns. This represents class consciousness for the working class. Raven really likes music and is shown playing various instruments throughout the cartoon and books. I guess she’s also a \"goth girl\" but I’m not qualified to make that claim. Raven wears a lot of purple and black and I think she slays. Both of my dolls have pretty bad glue seepage but unlike my Signature Apples, neither of them are super wonky. Raven is very caring and feels a lot of guilt for hurting others by refusing to follow her destiny but ultimately she knows it was the right thing to do for herself. She is the biggest advocate for free will and choice, and she is constantly forced to question her responsibility in the \"revolution\" in Ever After for lack of a better word. She’s an incredible character but she also serves so much.",  

"450": "Enchanted Picnic was the second slim box line after Mirror Beach, and like its predecessor, the line has no media association. Raven, Cerise, and Blondie decide to go on a picnic. I have no idea why Blondie was invited, considering she loves tea more than anyone and would absolutely out Cerise on her drama show. Anyway, all the dolls have fairly similar outfits where the dresses almost look like uniforms. I got this doll second hand, so she is missing her purse. This doll has \"classic Raven\" makeup with purple garage doors and a nude lip. It’s very Daniel-core, minus the eyeliner. The dress is a little tacky but it’s camp. I do like this doll quite a bit but she isn’t my favorite.", 

"117": "I’m not really sure thematically why Cerise got a Legacy Day doll because she really isn’t important to that arc. She doesn’t get the same amount of screen time that Maddie or Briar get. However, I’m not complaining because she slayed this look. The only thing I’m missing from this doll is one shoe which is why she’s barefoot in her picture. I don’t really get the V-neck cut of her dress or the high-low skirt but what do I know. I do appreciate that her tights are actually just really thin opaque leggings because it makes dressing her a lot easier. Ever After High dolls suffer from massive feel syndrome, and I don’t mean to discriminate but it makes dressing them harder. This is Cerise’s fanciest hood in doll form outside of her San Diego Comic Con look but that’s not a fair comparison. I just wish there was a little more red incorporated into this outfit.",  

"118": "I don’t want to talk to this doll. I don’t have an explanation for her. On Legacy Day, Maddie is Raven’s number one supporter and is all around a great friend. However, my doll is in absolutely awful shape. I don’t remember why I decided to cut half of her hair off but I did my best to hide it in the picture. I was not successful. I also don’t know what happened to her pants or tank top, so I had to borrow a Monster High dress for the picture. She’s an absolute disaster and I am so sorry to this doll that I did that to her. She looks horrible and it’s all my fault.", 

"119": "Hat-Tastic Party was a line that featured Maddie hosting a secret tea party with her friends. For some reason they all decided to cosplay as 60s housewives which is one of my least favorite aesthetics. At least its not a 50s housewife. The dolls in this line have really unique printing on their skirts that I really appreciate. I also forgot to put the cuffs on this doll for her picture, I apologize for that. Her headband is also off because it likes to fall off. Despite my hatred for this aesthetic, this is one of my favorite Apple dolls because it just really works here. My doll is a bit wonky but I don’t mind that much because she’s my childhood doll.", 

"120": "See Hat-Tastic Party Apple White for my minimal description of the Hat-Tastic Party line. Briar is the most housewife-y with this outfit, when I was younger I always thought she was giving Jackie Kennedy. I was very glad they omitted the bubblecut. I really love this doll’s makeup, the soft pink eye combined with the perfect shade of pink lip just looks stunning. This is further emphasized by the campy gorgina dress. The headband (which is missing from the picture, sorry about that) adds some maturity to the look but doesn’t age Briar. To be honest, I don’t know what I’m saying here, I’m just parroting what I’ve heard people say about fashion. The dolls in this line came with their own themed teacups and teapot, and Briar’s is obviously rose-themed. It’s very cute and matches her look so well while adding a pop of green.", 

"121": "I’m going to include a brief description of Cedar Wood as a character here because I no longer have her signature doll. She was one of the handful that mysteriously disappeared. Cedar is the daughter of Pinocchio, so she is a sentient marionette that is unable to lie. Because of that, she is on the Rebel side of the conflict as she believes in freedom of choice. However, she personally would choose to follow her destiny because she wants to become a human. Cedar dolls have unique bodies where they have a wood-grain texture and little indents for her mechanical joints. It’s really cool especially on the playline level. Anyway, Cedar is serving lewks at the tea party. I love the woodgrain pattern of her top half in combination with the pattern on the skirt. I really appreciate the adorable little socks she wears as well.",

"122": "This is the most meh doll in the line to me. It’s giving a bit of steam punk but also too much red. When I was a child I was always irritated by her because her stockings were never symmetrical, one was always longer. I do appreciate how they changed her hair, swapping the grey stripe for red, but again it’s just too much red. The hood is cartoonishly big to accommodate the cartoonishly large round Ever After High heads, but it looks silly once you take it off her head. This doll has really soft hair, It feels like kanekalon but honestly it could just be really nice saran. Her face is also stunning and I’m thankful her lips are a more nude red, not only because it's so much red already but also because I just love nude lipstick.", 

"123": "The Maddie doll for this line was sold exclusively with the Hat-Tastic Party playset, which is more abstract than the other playsets released in Ever After High. I can’t give a detailed description of my doll playsets because we’d be here all day, I’m sorry. This Maddie doll is interesting because during the end of Ever After High, there was a 28 inch version of this doll released in 2016 (when the brand was about to be discontinued). Bizarrely, the large doll was produced by Just Play rather than Mattel. I don’t have much information about it because nobody cares except me. Anyway, the regular sized doll has the most amazing accessories. For example, her earrings are teabags. It’s so camp. The painting details on her shoes look like old furniture. I’m not sure what they’re supposed to be though. This doll’s face is honestly kinda mid but her accessories make up for it.", 

"124": "Mirror Beach was the first budget line, meaning the doll came in a slim box and did not include a stand. Mirror Beach does not have any media tie in, so all I can say about the plot is that Apple, Ashlynn, and (for some reason) Maddie go to the beach together. All the accessories here are recycled. I had the Ashlynn from this line too but she mysteriously disappeared. For some reason I decided to give this doll a major haircut. I’m pretty sure this one was inspired by Hillary Clinton. Clearly, I did not do a very good job. I also lost this doll’s outfit so she had to borrow Swim Class Venus McFlytrapp’s swimsuit for the picture.", 

"125": "See Mirror Beach Apple White for an explanation of this line. Maddie fared the best of my childhood Mirror Beach dolls as she didn’t mysteriously disappear or get a bad drastic haircut. Maddie has the most interesting outfit in this line in my opinion. For a start, her swimsuit is a romper, but her skirt is also the most detailed with the black trim. It is a lot of blue but I don’t mind.", 

"126": "For the 2014 San Diego Comic Con, Ever After High released this exclusive alternate universe version of Cerise Hood where she is now Cerise Wolf. In the canon, Cerise is the daughter of Little Red Riding Hood, but she is also secretly the daughter of the Big Bad Wolf (I wonder what this could be a metaphor for!?!?!). She has to hide her identity because it does not conform to the original story of Little Red Riding Hood, but after Raven Queen, the daughter of the Evil Queen from Snow White and the Seven Dwarfs decides to refuse to sign the Storybook of Legends and tie herself to being the worst villain in the fairytale world (I don’t know how to explain Ever After High without going into how it’s a metaphor for class consciousness) Cerise and many of the other characters with bad destinies (definitely not the proletariat!1!1!1) decide to join her in not signing. The characters destined to become princesses were not very happy so there was a whole (class war) divide. Anyway, this doll depicts Cerise in a dream where she decided to embrace her identity as the Big Bad Wolf. This doll is much higher quality than the rest of my Ever After High dolls. The details and textures of her clothes and accessories are all very nice. I was a bit disappointed that she came with a standard Ever After High stand (and hairbrush, but we all know that I don’t use doll hairbrushes anyway because they’re too small and cheap). When I was in middle school collecting Ever After High in secret this was the only doll I kept in the box. As an adult I decided to open her because it brought me no joy to keep her inside it. I have no regrets from opening her because I was never going to sell this doll and I get a lot more enjoyment when I actually get to see her.",  

"127": "Dexter Charming is the second most prominent Prince Charming in Ever After. Under the destiny system, there are essentially a million of various prince and princess charmings who have no idea what story they’re destined to be a part of until they sign the Storybook of Legends. It’s never confirmed which prince Dexter is supposed to be, but it’s highly speculated and head-canoned that he’s the Good King from Snow White (Raven’s prince). Dexter is unathletic and nerdy, living in the shadow of his brother Daring. Dexter is also twins with Darling, a princess raised to be the perfect damsel in distress who was confirmed but not confirmed to be Apple’s princess charming (you would understand if you watched it with me, Jonah >:(). Dexter has a massive crush on Raven Queen, and they later get together despite the fact that Dexter is on the Royal side. To be honest I think he just wants to stay out of drama. This doll was highly anticipated for me when I was a child because I wanted to take him and Raven on dates. Unfortunately he is a boy doll so he’s boring and low effort. He’s dressed like a hipster who would mansplain socialism. Like the scarf looks so silly and out of place. I can’t explain it but it’s giving Cole Sprouse.", 

"128": "Holly is the daughter of Rapunzel but she’s also a fangirl of her classmates that writes fanfiction about them. Holly loves her destiny as Rapunzel, but she’s a bit of fa hypocrite because she harbors the secret that she’s actually the younger twin, so really, Poppy should be the one that becomes Rapunzel. Holly has the most beautiful long red hair, but it’s not rooted very well in the front. She wears a purple tiara that I love but it does not like to stay on. This doll has a bit of glue seepage that I’m currently choosing to ignore at this time. Everything about this outfit reads as Aeropostale to me which reminds me too much of middle school thank you. The heels to Holly’s shoes are towers which is adorable and cartoony in the best way. This Holly was exclusively sold in a 2-pack with signature Poppy O’Hair, both in the original release and in First Chapter rereleases.", 

"129": "Lizzie is the daughter of the Queen of Hearts from Alice in Wonderland. Of the 3 main Wonderlandian characters, Lizzie is the only \"Royal\" as she can’t wait to become the Queen of Hearts, but she struggles to behave as she’s expected (as in throwing temper tantrums). Lizzie has a magical deck of cards that can pretty much do whatever she wants. She’s also the star of the Ever After High croquet team. This doll is stunning but like most Ever After High dolls her outfit is a bit dated. It just screams 2012 to me. I don’t think that makes it a bad outfit, but I just don’t see any teenager today wearing it. Unfortunately, I’m missing this doll’s purse but she’s otherwise complete. My favorite part of this doll is her hairstyle, which I managed to preserve. She looks so effortlessly regal and beautiful. The heart on her face is canonically painted on, which is something Lizzie is insecure about because she did not inherit her mother’s birthmark. This parallels to Apple White’s insecurity about being blonde. Her makeup makes Lizzie such a distinct and uniquely stunning face, which makes her one of the prettiest Ever After High dolls.", 

"130": "Poppy O’Hair is the twin sister of Holly O’Hair and one of the daughters of Rapunzel. Poppy has a unique perspective because as the (legally) younger sister, she doesn’t have a destiny to follow, as Holly gets to become Rapunzel. Instead, Poppy pursues a career in cosmetology, running a hair salon as a teenager. Poppy’s hair grows ridiculously fast, so she wakes up each morning with hair as long as Holly’s and cuts it in various different styles each day. I think it’s such a power move and so slayful to have the daughter of Rapunzel be the doll with the shortest hair. I also love the split dye which is so ahead of its time. Poppy’s outfit screams hairdresser. Interestingly, on doll packaging, Poppy is classified as a \"Rebel\", but in the webisodes Poppy refuses to pick a side and decides to be a centrist which makes me like her considerably less.", 

"131": "Spring Unsprung was the 4th Ever After High movie and featured the characters having the Spring Fairest which seems to be some sort of Midsomer fair but fairytale themed. Meanwhile, two Wonderlandians escape from the blocked portal and share concerns about the Evil Queen trying to take over the world again. Cedar is serving lewks here. For most of my dolls, I took their headbands off because I can’t stand the little plastic sticking out of their heads, but also I wanted to be thorough with my cleaning. Cedar’s shoes are an absolute pain to get on and off which is very frustrating. The shoes are still very cute though. I love Cedar’s dress with the wood grain pattern but I wish it was a bit longer. I like the print of the leggings but I wish they weren’t there because it’s just a bit much. Cedar’s makeup looks incredible and I really love her purple eyeshadow. Her lipstick always looks incredible. My doll is in dire need of a boil wash and I apologize for that.", 

"132": "See Spring Unsprung Cedar Wood for a brief description of the line. This Cerise has the opposite problem of Hat-Tastic Party Cerise. There’s barely any red and far too much black, white and gray. The purple looks weird and I don’t like it. I didn’t put her collar on for the picture because I'm lazy but I genuinely forgot with the belt. To be honest, this is my ugliest Cerise, I think she’s wonky but she also looks like she just witnessed some crimes. She looks like she would be really popular on Tumblr in 2015 which is not a compliment.", 

"133": "This is the most irritating doll in the Spring Unsprung line. While Cedar’s shoes are very difficult to get on and off, at least I was able to get them back on. I have never been able to get Holly’s little flower collar thing back on since I took it off to clean. It’s very frustrating because I wish I could’ve included it in the picture. Despite this, I actually really like Holly’s dress. It’s giving princess bride cottage core and I really like the purple to white ombre, but I’d prefer if it was just solid purple. I also wish Holly’s hair was a little longer because it just looks like normal doll hair rather than Rapunzel hair. I think the dark lip looks really nice here, but my doll’s eyes a slightly wonky. I don’t mind though. I think she’s still really pretty.",  

"134": "This doll was sold exclusively at Walmart and is hands down the best doll in the line. I love the combination of colors and patterns here, as well as fabrics and plastic textures. I also think Kitty’s face is stunning, that is her perfect lipstick shade. I didn’t have any spare elastics to redo her ponytails at the time of taking this picture which I apologize for. This Kitty is a million times better than her signature doll and I’m so glad I have her. I’ve heard that she’s very expensive on the secondhand market so I’m extra glad I have her. I really don’t care about the monetary value of my dolls because I don’t want to sell them but I’m also glad I bought her at retail and didn’t have to pay a hundred dollars for her.",

"135": "Unlike the rest of the Spring Unsprung dolls, Lizzie came with a playset. In the narrative, Lizzie made everyone else’s outfits, so it’s a shame she couldn’t make something more interesting and less off-the-rack for herself. She still looks really slay though. I have two of this doll because one was a childhood purchase and the other I got for a really good price as an adult before I found the first one. I don’t mind having duplicates, but I don’t go out of my way for them. When I first got reintroduced to Ever After High, I was obsessed with having all my dolls complete so I jumped at every opportunity to own complete versions of as many dolls as possible. That was not a healthy mindset both for my mental health or my wallet, and I soon got distracted by other dolls anyway so I don’t focus on that anymore. Ever After High is still my favorite fashion doll line though. Anyway, I love the gold accents on this doll, Lizzie is so pretty. I do prefer her signature doll but that doesn’t mean I don’t adore this one.", 

"136": "Thronecoming was the third Ever After High movie and follows Raven as she questions the consequences of her actions and its impact on her friends and peers. Fans were able to vote online who they wanted to be Thronecoming Queen out of the 4 main dolls in this line. Because I’m an Apple apologist, she is my favorite doll in the line. I love everything about her, including the stupid high-low skirt (it’s not a true high-low, which is why I’m so forgiving). Her hair features a lot of tinsel which normally I don’t like but I think it looks so good here that I forgive it. The gown is absolutely stunning and works so well with her hair and makeup. The only thing I’m missing is one of her earrings but I hid that in the picture. I love love love the pearlesent gloves and I love how all the colors mesh together. This is one of m favorite Ever After High dolls.",  

"137": "This is the campiest ball gown doll I’ve ever seen. Blondie styled her hair so her ponytails look like bear ears. That’s so funny but also really slays. The gown reminds me a little bit of Disney’s Cinderella but it still really reads as Goldilocks so it’s not a problem. Usually I complain about prominent blues but it looks really nice and regal here. The bangs feel very gelled and stiff which used to bother me a lot but I don’t mind that much anymore. The mask isn’t really molded for an Ever After High face so it looks very silly but I wouldn’t want to cover Blondie’s stunning face anyway. I’m not sure why Blondie was nominated because she’s a bit of a mean girl that constantly shares tea to literally everyone via broadcast so you’d think she wasn’t very popular but what do I know.", 

"138": "Briar was not nominated for Thronecoming queen, so she doesn’t get an elaborate ballgown here. Rather, as a party planner she gets a playset that features her bedroom and the party itself. Briar’s dress is very hoco (I think, I never went to homecoming) and she once again looks stunning. However, she pales in comparison to the ballgowns in the rest of the line. I really like the use of tinsel in her hair here and her makeup. Interestingly, there was a second wave of Thronecoming dolls released in allegedly 2017 (I doubt it, it was probably 2016) that also featured Briar. The three dolls all had the same silhouette and featured recycled accessories, including ones from the first wave of Thronecoming. They also have the unsettling reboot faces. The first Thronecoming Briar is significantly better. The doll you are seeing here is actually not my childhood one, who mysteriously disappeared. The one I have now is a gift from my dad who found the whole set still in the box.", 

"139": "See Thronecoming Apple White for background lore on Thronecoming. Cupid looks stunning here. For once, I will forgive the high-low skirt because it’s more of a curtain that reveals the most gorgina gladiator boots. In 2014, those kind of shoes were pretty mainstream so it really had to be dramatized for an event as extravagant as Thronecoming. My favorite little detail about this doll is her earrings, which are bronze elf ears. I love the hair and makeup on this doll, making a high ponytail look so fancy and chic is very impressive to me. I could do without the bangs but I’m a bang hater. Going off of outfits alone, Cupid should’ve won Thronecoming because she undoubtedly looks the best.", 

"140": "Despite winning Thronecoming, Raven is in my opinion the weakest doll in the line. But I am a hater who hates all things asymmetrical. The pattern of this dress is probably couture but I don’t like it. However, I love the collar because it’s very dramatic and slays. Her hair accessory does not like to stay on or stay together so I don’t like that. The makeup is probably the best part of this doll with the little gems around her eyes. The purse is so small and square shaped it’s kinda camp but also detracts from the look in my opinion. The cuffs are also very dramatic and matches the collar so I like them. I also really like the shoes, they look fantastic.", 

"141": "Rather than a full movie, Through the Woods was part of a multi-episode arc that followed pretty much all the characters doing various connected things. Here, the dolls in the line were misdirected by Faybelle Thorn after she wasn’t invited to a party. Ashlynn’s dress has a weird cut where the skirt is square-shaped when you push it out, but it’s still a really pretty color and looks great on her. This doll also has a stunning mug with incredible makeup. Unfortunately, I somehow lost both of her shoes; they mysteriously disappeared alongside two of my other childhood Ashlynn dolls. I don’t want to talk about it. Despite her lack of shoes, this doll still slays. Mine might have a slight haircut but I honestly can’t tell. I think Ashlynn is my favorite in the line.", 

"142": "See Through the Woods Ashlynn Ella for a brief description of the line. Blondie is kinda giving cottage core here, which I apparently picked up on as a child because when I played with this line, I made this Blondie Poppy’s girlfriend (from the same line). I don’t know why I picked her specifically, but they were consistently a couple when I played dolls in secret in 6th grade. I honestly didn’t know what her accessories were until I looked it up now (apparently it’s a notebook) but it’s not in the picture so don’t worry about it. This doll has weird bangs that are very narrow and look strange. I usually kept her cape on when I played with her for that reason. I really like this doll’s dress despite how 2014 it is.", 

"143": "In the events of the Through the Woods arc, Cupid finally gets over her crush on Dexter Charming, and immediately loses relevance to the plot. However, she was determined to make one final serve and she absolutely delivered. Cupid is dressed to be an American menace in Paris but she will look gorgeous doing it. Her dress looks like it should be a shirt and skirt, and the pattern on pattern is a bit Disney Channel but it really works here. I love how the belt looks with the heart-shaped buckle. I also love the bronze accents of her boots and necklace. The necklace attaches Cupid’s wings to her but unfortunately I was too lazy to include that in the picture so you’re just going to have to trust me on that one.", 

"144": "When I was 11, I decided this was my lesbian doll. I also had signature Poppy but I don’t think it extended to her. I didn’t have a reason for this other than the fact that she had the shortest factory hair which therefore made her butch. Now I would consider her a straight person’s idea of a queer woman. This doll is very \"not like other girls\" and she looks like she’d be insufferable talking about her cosmetology license all day. I mean her jewelry are all hair tool themed like give it a rest bestie. I get it, she’s the daughter of Rapunzel but like get another hobby please. She looks like she runs her Tumblr blog like she’s the editor in chief of a major news publication. I’m definitely being too mean here I’m sorry Poppy. I still love you and you have the most interesting hair of any Ever After High character. Please forgive me.", 

"145": "By the end of 2015, Mattel and Ever After High started cutting corners with their dolls. Starting with this line, some dolls featured simplified arm articulation and molded-on clothing. Unlike previous dolls, this Raven cannot bend at the elbow or wrist. This line is also especially lazy and cheap because it doesn’t have a proper name. \"Basic\" is just a commonly used fan term. It’s unfortunate that Ever After High reached such a flop era only two years into the brand because the concept has so much potential. This is the only Ever After High doll I got secondhand, so she is missing her crown and necklace. My doll also has various prominent stains on her face she received in storage that is unfortunately a pain to get off. I apologize that those stains are constantly visible in the picture.", 

"146": "Book Party was another line that did not get any media tie in. It featured Ginger, Lizzie, and Kitty having a party to celebrate their original stories. I don’t see how this is any different from any of the other parties at Ever After High. For some reason, Ginger is not wearing her glasses here, I don’t know why. Like her signature doll, Ginger has lovely hot pink kanekalon hair. Her dress is a little corny but it’s very soft so I don’t mind that much. The highlight here is definitely the shoes with the book heels. I took her headband off for the picture because it refuses to stay on. Her bag is literally just a stack of books which I think is cute but I wish it had some painted details.", 

"147": "At this point, Dexter Charming and Raven Queen finally start dating and they decide to go see a movie. For this, Dexter decides to wear the worst thing possible for this date with shorts, a tank top, and a blazer. It’s very \"my father owns a boat\" couture. The various shades of blue do mesh well together. It also goes well with the gold, I must say. It still looks ridiculous and I don’t like it. It’s slightly worse than the hipster fit of his signature outfit. This man just doesn’t know how to dress. After this date, and Dexter and Raven’s relationship starts, Dexter is no longer important to the plot and he doesn’t do much else. This is the second and last doll released of this character. Unfortunate.", 

"148": "On her date with Dexter, Raven decides to show the world that she’s not like other girls with her fit. Her purse is shaped like a guitar to show how much she loves music. I’m being mean here but this outfit really isn’t that bad. She still looks very pretty. Her makeup and jewelry look gorgina and she’s definitely the highlight in the set. Date Night Raven and Dexter were sold in a 2-pack exclusively at Toys R Us. My doll unfortunately had an accident in storage. Her neck snapped, so this was one of my first interests of repairing doll necks. I don’t think it looks too bad but it certainly could be better. You can probably see it in the picture but please pretend that you can’t.",  

"149": "Dragon Games was the 6th Ever After High movie and featured Raven’s mother escaping from her mirror prison and attempting to take over Ever After again. The students also participate in a dragon-riding sport, I’m guessing it’s inspired by Quidditch but I’m not giving the wizard franchise any more attention on my website. If I got any details wrong please direct your complaints to Jonah because it’s his fault I haven’t watched it recently. In the movie, the Evil Queen disguises herself as a student named Mira Shards (pronounced \"mirror\") and is able to take more power after gaining the trust of Snow White and Headmaster Grimm (I think, again, blame Jonah). This doll is on the taller body to hint at the fact that she’s an adult or at least older than Raven. And I genuinely do believe that, based on nothing. Anyway, this doll’s outfit is giving dark fairy more than Evil Queen to me but I really like it. I do with the skirt was a different shape because I think it looks silly and childish which is not the vibe. The belt and matching shoes slay though. I like the vine details, it’s giving Briar meets Raven. The pink hair is also a slay with the head piece, although mine is slightly off-center.", 

"150": "Just Sweet was a one-off doll line sold exclusively at Target. It just featured Blondie in an elaborate outfit as she did a mirrorcast (a livestream show) reviewing the Beanstalk Bakery (a local bakery in downtown Book End). This fit is essentially a yaassified version of her signature look. The associated webisode features Blondie giving Raven dating advice and reveals that Blondie is a perfectionist and for some reason prejudiced against left-handed people. This doll is a great example of printed-on designs done right because it’s layered under actual textures. This doll has so many tiny details such as the cupcake heels that I really appreciate. It’s not my vibe but I can appreciate how good this doll is.", 

"151": "Bunny Blanc arrived at Ever After High after slipping through the Wonderland portal during the events of Spring Unsprung. She’s the daughter of the White Rabbit from Alice in Wonderland but she gives rabbit cosplay rather than being a rabbit herself. Her skin tone is the exact same as Draculaura from Monster High which is very odd because I don’t think vampires are supposed to look like white rabbits. Her outfit is very steam punk for some reason but I get where the designers are coming from. Bunny’s bob is very blunt and for once I’m not feeling it. Canonically, Bunny has a reciprocated crush on Alistair Wonderland, the son of Alice. I used to have the Alistair doll but he mysteriously disappeared. I’m very grumpy about it because he is very expensive on the secondhand market. It’s fine.", 

"152": "Duchess is basically the first Toralei Stripe of Ever After High, but she was quickly replaced by Faybelle Thorn. Duchess is the daughter of the swan princess and she’s bitter that her destiny is to be a swan forever, so she teams up with Sparrow Hood (Robin Hood’s irritating and lazy son who insists on everyone listening to his terrible band) for various schemes. Once she was replaced with Faybelle, Duchess faded a bit and was forgotten about. Duchess is on the taller body and she has one of the most beautiful faces. Everything about this doll is stunning and I love her very very much. Honestly she deserves so much better and I wish she was more prominent in the Ever After High cartoon and books.", 

"153": "Ginger is the daughter of the candy witch from Hansel and Gretel. She doesn’t want to be evil, she just wants to be a chef. I’m sure that’s a really common problem people have. This puts her on the Rebel side of the main conflict but she doesn’t get to be a driving force in any part of the conflict. Ginger hosts a cooking show called Spells Kitchen, which is a parody of Hell’s Kitchen. This doll has a really bizarre outfit with the thinnest sheer cape ever and the most 2012 outfit ever. I do think Ginger is very pretty but the highlight of this doll is certainly her hot pink kanekalon hair. Ginger didn’t get to do much in Ever After High, the main thing she got was being the star of the Sugar Coated line.",  

"154": "Kitty Cheshire is the third of the main three Wonderlandian characters in Ever After High to get a doll. Kitty is a rebel in the sense that she doesn’t like to follow rules and she loves to cause problems but she doesn’t stray far from her original destiny. Kitty can hear the narrators of the story like Maddie, but she ignores them because she couldn’t be bothered to care about the plot. An interesting fact about Kitty’s signature doll is that she was supposed to come with arm bands as you can see if you look up the stock photos, but the final product does not have them. I heard that this was due to production delays or something like that but I don’t have any evidence for that. At this point, it’s a rumor. This doll has a unique face mold because she has a dramatic smile that would later become universal with the soft reboot, but it works for Kitty due to the nature of her character.", 

"155": "Rosabella Beauty is the daughter of Beauty and the Beast, and she was introduced as Briar’s activist cousin. I interpreted her as almost a caricature of the \"social justice warriors\" from the early 2010s but without the malicious intent. Rosabella is mainly concerned with animal rights, which translates to workers rights in a real world interpretation. Rosabella isn’t really a quirky girl but she has the quirky girl glasses as you can see in the picture. At the end of the series, it’s revealed that Rosabella’s prince charming is Daring Charming, the narcissistic popular prince (in the literal sense, he carries hand mirrors around to just stare at his reflection all day) everyone originally assumed to be Apple White’s prince. Although she doesn’t do that much until Epic Winter, Rosabella makes lots of appearances in later Ever After High lines, but this is the only Rosabella doll I have. I do really like this doll but her silhouette is honestly a little boring and dated.", 

"156": "Way Too Wonderland was the 5th special or \"movie\" I guess. Before I go into detail, I need to give a bit of a background about Wonderland in the Ever After High universe. So basically, Wonderland is a separate universe that can be accessed via magical wishing well from Ever After. Wonderland has their own school and is essentially a parallel world to Ever After. Several years before the Ever After High stories start, Raven Queen’s mother invaded Wonderland to gain more power. It was going \"off script\" so the Evil Queen went to mirror prison for it but it was an \"in character\" move so Headmaster Grimm (who is honestly the worst) encourages the behavior. To prevent the spread of the Evil Queen’s power, the Wonderland portals were closed off so nobody can get in or out. Madeline Hatter, Lizzie Hearts, Kitty Cheshire, and the Mad Hatter managed to get through the portal before it closed so they get to stay in Ever After for the time being. In the previous special, \"Spring Unsprung\" two Wonderlandians (Bunny Blanc and Alistair Wonderland, the daughter of the White Rabbit and the son of Alice respectively) escaped through the portal. Through a variety of events that I won’t detail because I’m still bitter Jonah refused to watch any doll media with me, Apple, Briar, Kitty, Lizzie, Maddie, and Raven get transported to Wonderland and are forced to go to Wonderland High for a day. They have to outsmart Wonderland rules to get home. Apple is my fvorite doll in this line because I think she’s the prettiest, while still being far more interesting than Raven. I really like the touches of blue that were added to her color scheme here. She also looks amazing with the red eyebrows. Her shoes are also adorable, and they are enhanced gold mary janes that look a little weird in the picture because I took her headband off (keeps falling off) but I still really like them. All the details to this doll are adorable and this is one of my favorite Apple dolls.", 

"157": "Courtly Jester is the antagonist of the Way Too Wonderland movie. She’s the daughter of the Joker Card from a Wonderland deck of cards. She basically caused a lot of problems for the main characters plus Kitty and Lizzie when they got stuck in Wonderland. Afterwards she gets sent to prison. Thankfully, this was Wonderland prison and she was eventually let out and sent to Ever After High. My doll has a defect where one of her legs doesn’t bend properly. Also, my doll was missing her stand in the box so I borrowed one for display. Despite transferring to Ever After High, Courtly doesn’t do much after Way Too Wonderland so she never got another doll. This doll doubles as her signature doll. I think she’s alright; I like her outfit but her face is a little off-putting to me.",  

"158": "This is one of the last Ever After High dolls I got as a child. When I was really into Ever After High in middle school, I would obsessively save up to buy each and every doll but by the time of Way Too Wonderland, it was no longer my top priority. I think by then I was getting too embarrassed by the thought of anyone possibly knowing that I still liked dolls as well as entering my emo phase so collecting dolls was no longer a huge deal for me. I now regret that decision because I only have half of the Way Too Wonderland dolls and they are now very expensive secondhand. See Way Too Wonderland Apple White’s description for my explanation of the lore. I really like this doll but I wish there was more light blue in her makeup. My doll is also in dire need of a boil wash. I plan on redoing her curls because the boil wash will loosen them. I absolutely love this outfit, I love how the jacket is more of a robe and I love how the mini dress looks with the tights and shoes. I also adore the hat headband and how ridiculously huge it is. The only thing I’m missing for this doll is one of her cuffs, but I took off her jewelry and headband so they wouldn’t fall off in storage. I think this doll is very pretty but mine is slightly wonky.", 

"159": "This Raven doll is visibly simpler than the others in the Way Too Wonderland line. This is because she came with a large playset. It has an unconventional clock shape that is hard to store. Of course, I have two (my childhood one was partially broken and missing pieces so I bought a second one I found for very cheap). This doll has a stunning mug. Her makeup looks incredible and her face is certainly the highlight. I also really like the green stripe in her hair, I think it looks really nice with the purple base. Both of my dolls have glue seepage but that’s to be expected. The shoes are also really cool and unique but they are one solid color so it loses points. Undoubtedly, the dress is the worst part of the doll. It looks straight out of Dr Seuss. I think it would be worse if it was longer because then it would be impossible to move in. I know it’s supposed to serve Evil Queen meets Wonderland but it’s just giving Whooville. See Way Too Wonderland Apple White to see a detailed description of the movie because I don’t want to repeat myself (I am lazy).",  

"160": "In the desperate effort to revive the brand in 2016, all the Ever After High dolls got new face molds. To showcase this, both the signature dolls and the Basic line were rereleased (the signature dolls were previously rereleased multiple times). Unfortunately, the new faces were horrible and scary looking. The Basic dolls were already simplified versions of the main characters in molded-on bodices and with unarticulated arms but now they have the unsettling smiling faces. This pivot in physical appearance mirrors Monster High’s shift to Generation 2 where the dolls had softer, younger looking faces. It was almost universally a downgrade. Ashlynn looks significantly worse with her new face. I’m very sorry to this doll but her face is horrible. She also has glue seepage so she’s a big flop.", 

"161": "Epic Winter was the last Ever After High movie, and the series was canceled shortly afterwards. It’s unfortunate because the show ended on a cliffhanger but I’m not sure what Mattel expected. This movie focuses on Ever After High’s Elsa equivalent, Crystal Winter. I think this was a terrible decision because there was no way Mattel could win a popularity contest against Frozen. Other than the horrible rebooted face, I don’t think this doll is that bad. A lot of people complained about the molded tights, but I don’t mind them. The accessories included with this doll were quite lazy, as there are absolutely zero painted details on any of them. The paper media is also just a card. At this point Ever After High had phased out the doll stands which is frustrating. I think this doll is still very cute but could have been so much better.", 

"162": "Madeline Hatter is the only Ever After High doll that looks good with the rebooted face. I still prefer the original, but I don’t mind this one. This Maddie also has more painted detail than the Ashlynn from her line so I’m a bit more forgiving. I’m probably a bit biased though because this doll has a lot of purple in her color scheme which I automatically gravitate towards. If this line was made even a year earlier I think it would have been much higher quality and have a lot more effort put into it. ", 

"163": "This is one of the couple of gimmick dolls released by Ever After High. This specific doll is supposed to emulate archery. If you attach the bow and arrow to Raven’s hands and then press the button on her back, Raven can shoot an arrow. It’s a little weird because she can only shoot arrows to her side and her arms are extremely limited in articulation. She also has a gimmick where her cape can double as a skirt. This doll has the later Raven face mold, which I do not like very much. I think it doesn’t fit her personality at all. It just looks a lot more childish. Also, this doll is my only Ever After High doll with polypropylene hair which is upsetting. I don’t like how much of this doll’s outfit is molded on. Honestly, I don’t know if I like anything about this doll but because I love Ever After High so much and want to collect them all I’m not going to get rid of her.",  

"164": "Nina Thumbell is one of the last characters to be released in Ever After High. The brand was on the verge of death as Disney’s Descendants became popular. This doll only has one accessory: her purse, and she has no stand or hairbrush. Her \"diary,\" which the early Ever After High dolls were known for, was just a small card. It was very disappointing. However, this doll is a hidden gem in the last year of Ever After High’s releases. She is shorter than any of the other dolls, and she is one of the very few non-white dolls. I absolutely love the green that accents her outfit. I feel like if it was any lighter or darker then it would be very ugly. It’s such a shame that this character got such little screen time in the Ever After High cartoon (I believe it was only one webisode) and never received another doll.",

"456": "Birthday Ball was a unique line released in the later period of Ever After High. Despite not featuring any tie-in media, the line included both slim box and standard release dolls. The standard dolls were released in 2015 as a Target exclusive while the slim boxed dolls were a universal release. The Target exclusive dolls were also scented. I can’t tell you what they smell like because I don’t have either of them. If you want to know more about scented dolls, I recommend researching Strawberry Shortcake. Unfortunately, Ms. Shortcake has not made any appearances on this website at this time. Anyway, the Birthday Ball dolls (with the exception of Cupid) all have uniquely-colored hair that fits with their color palette. Cupid’s hair is already pink. Blondie, who you can find more about if you look at her signature doll (and ignore the state of her bangs) has blue hair, but it looks kinda washed out. It’s unfortunate because the pastel colors look really good on all the other dolls. I really like the dress though, and she has really nice accessories for a budget doll. I must say her hair is undoubtedly the lowest point for this doll and the entire line. I’m not sure why this shade of blue was picked but I’m sure it’s related to the hair fiber.",

"454": "Faybelle was a major villain character in the Ever After High media, but you wouldn’t know that from the dolls. This was her only release. Major fumble on Mattel’s part in my opinion. Faybelle is a beautiful doll with a gorgina face. Her outfit is a little dated but I don’t think it’s that bad. She looks like she’s cosplaying as her Legend of Zelda O.C. (that means original character, Jonah). Faybelle is an overachieving cheerleader that takes her destiny as the daughter of the Dark Fairy from Sleeping Beauty (Maleficent is not in the public domain) very seriously. In the cartoon, Faybelle eventually becomes indebted to the fairy mob. That’s my pitch to get Jonah to watch it with me, I hope it works. Faybelle really deserved more dolls because she became a major character in the later movies and arcs. She even had her own special outfit in Epic Winter which usually means the character gets a doll. My favorite detail about the Faybelle doll that was actually released is her purse because it’s shaped like a pom-pom. The cartoon seemed to forget that Faybelle is a cheerleader but it’s a major part of the books.", 

"458": "This doll is scary and probably the ugliest Ever After High doll released. Along with Nina Thumbell (who I have at the time of writing, so you can see her on this website) and Meeshell Mermaid (who I do not have at this time, and yes that’s how her name is spelled), she is part of the last wave of signature dolls. Because of that, she has very little associated media and therefore almost no canon details but I shall do my best. She’s the daughter of Jack, of the Beanstalk fame which she seems to embrace but is a Rebel for reasons I remain unaware of 7 years later. For some reason, Jillian has a British accent. It feels very out of place. I don’t know much about her personality due to Ever After High’s cancelation but according to the wiki she has a crush on Tiny the Giant. We only see Tiny’s feet in the cartoon so I can’t judge. Apart from her scary face, I really like Jillian’s fit. The green, gold and brown look really nice together. Unfortunately, I accidentally bought this doll without her tunic which I am very embarrassed about. I just wish I could tell you more about this doll but there’s really nothing about her. I’d say Jillian deserves better but I genuinely don’t know.", 

"455": "I will always associate the 12 Dancing Princesses with the Barbie movie I grew up with, but I absolutely love and prefer Justine’s design. Justine is the daughter of the 12th princess and is one of the few (and I emphasize few here) Ever After High dolls of color. Justine loves dancing and theatre and identifies as a Royal. Despite being introduced about half-way through Ever After High, Justine never really got to do much, and she never got to be the main character or everything except one little 5 minute webisode. Very much not slay. In my opinion, Justine is one of the most beautiful Ever After High dolls in my collection. I would prefer if her skirt was longer but that’s entirely based in my own fashion preferences. Justine still slays. I love love love her top and her silhouette is gorgina. I really wish she got more dolls because I would love to see what the Ever After High design team would have done with her color palette and motifs.",  

"493": "I got very lucky when I found this doll. She was released super late in Ever After High’s run. You can see this clearly from her rebooted smiling face and printed on leggings. This line is both called \"Powerful Princess Club\" and \"Powerful Princess Tribe,\" but it says the former on the membership card so that’s what I go with. The name of the line comes from Ever After High’s second motto \"Where Princesses are Powerful\" which basically marked the shift from the class consciousness metaphor to just bland girlbossing. Anyway, this doll, along with the other dolls in the line were sold with membership cards for said club. Apple is a member because of her leadership skills. I still don’t know how Maddie qualifies because she’s not a princess or even close to royalty. Despite the corner cutting and the unsettling faces, I like this doll a lot. I think her outfit is really cute despite the 2-in-1 gimmick. The longer skirt is removable but I think the dress looks incomplete without it. I’m pretty sure all the accessories are reused molds but I’m honestly not that surprised at this point. I appreciate how there are at least some painted details because they weren’t completely guaranteed at the time. I got very lucky finding this doll because she’s somewhat race, as most reboot-era Ever After High dolls are. This is because nobody wanted to buy them when they were in stores.", 

"457": "I’m not really sure why Ever After High was so obsessed with archery in 2016. None of the media is that focused on archery. There absolutely were previous instances of archery with Cupid’s signature doll and Hunter’s Tricastleon doll but there was never any lines solely dedicated to it. However, in 2016, Archery Club was released alongside the single Magic Arrow Raven Queen doll which had a special gimmick body. You can read more about that Raven on her page. Anyway, Ashlynn is apparently a member of this club, maybe because her boyfriend is an archer but that’s my best guess. The dolls in this line have painted on and textured leggings which is always a half disappointment because it’s a major form of corner cutting but it’s also cool to see what patterns they use. Because Ashlynn is the daughter of Cinderella, her how and arrow are made of glass. Of course, the piece is plastic but it’s a translucent plastic that gives a glassy effect. Usually Ashlynn’s shoes would have the same affect but it seems like Mattel gave up on that by the time this doll was made. Interestingly, the stock pictures for this doll (and the others in her line) feature full articulation, which makes much more sense considering the theming, but the actual doll has the limited articulation with the removable forearms. Holding the bow is very awkward so I didn’t even try for this picture. I hate it. I especially hate how the dolls can’t bend their knees at all because it makes them look wooden and static. The dress is very simple and the pattern is very mid but it’s expected for a Mattel doll released in 2016. I love the shade of green that’s associated with Ashlynn which is prevalent on this doll. It’s unfortunate that this doll has the reboot face mold because Ashlynn’s original face is the most gorgina thing ever.", 

"459": "I’m going to start this with a clarification. At the very end of Ever After High, a slim box budget line of Thronecoming dolls were released years after the first dolls. The line has the same name, so it could be considered a very late second wave. However, for the purposes of this website, I’m going to call the line Thronecoming II so Jonah doesn’t get confused and I don’t make things harder for him. I happened to get the doll of the character who appears in both lines so it would just be even more confusing. Now that’s out of the way, it’s my time to complain. This is very clearly a budget release. The articulation is very odd, as there is elbow articulation but no wrist articulation. I thought that is my only Ever After High doll with this kind of body, but the Archery Club dolls also have this articulation. Interestingly, the forearms are removable which I don’t understand because the point of the removable limbs is to make clothes and jewelry easier to put on and off but jewelry was practically nonexistent on 2016 Ever After High and tight clothes are a nightmare to push up to the elbow so what’s the point. There’s also no knee articulation Also, all the dolls have the same silhouette with the exact same dress in different colors. It’s very lazy. The accessories are all recycled and repeated with all 3 dolls (again in different colors) with the exception of the shoes, but to be fair Ever After High was reusing molds as early as Mirror Beach. I can’t say that this is a hidden gem or anything super special. However, this was an extremely lucky find for me because these dolls are almost impossible to find. I’m sure you can imagine how excited I was to find her boxed. Before you come for me for opening the box, I don’t care and also keeping a doll in the box isn’t necessarily good for them anyway. It doesn’t matter though because this is my doll and I prefer to actually be able to hold them. Since I also have the original Thronecoming Briar, I’ll ask Jonah if he can put up a comparison picture of the two dolls.", 

"451": "Alistair Wonderland is the son of Alice that came to Ever After High from Wonderland (shocking news). He’s basically a male Alice but like most Ever After High characters he’s completely forgotten about half the time. I used to have Alistair’s signature doll as a child but he mysteriously disappeared. Very unfortunate news for me because that is a very expensive doll on the secondhand market. Anyway, I have lots of complaints about this doll. If you want to learn the barely existing lore of this set, just look at Bunny. The most egregious thing about this doll is entirely a product of my negligence and wanting to find the pack for a good price, because he is so wonky he looks horrible and scary. He’s not supposed to look like that, and I display him looking to the side because it’s the only way he looks good. Now that’s out of the way, I have more complaints about the INTENDED flops with this doll. First of all, the shirt and shorts are sewn together, creating the most gaudy romper on earth. The shirt pattern could be camp but it looks hideous as part of this bizarre one-piece ensemble. Next, the suspenders and bow tie are attached, which is reluctantly acceptable except for the fact that it’s ONLY ON THE FRONT. That destroys the whole purpose of suspenders in the first place. It was absolutely laziness and corner cutting on Mattel’s part and it just shows how little they cared about the brand at this point. Also, his shoes are blue for some reason, and it really clashes with the rest of his outfit. However, it is a new shoe mold as far as I know which confuses me. Why waste money on that if you’re not going to even try with the clothes? Although he’s a total flop and my doll is so misprinted that he’s scary, it’s still cool that Ever After High made more than one Alistair doll. They should’ve put more effort into him though.", 

"452": "Because I spent most of my Alistair description complaining about him, I’m going to go into more detail about Carnival Date as a line and a set with Bunny. She and Alistair have finally admitted their feelings for each other and go on a date to a carnival. I can’t confirm but the Ever After High wiki claimed this set was a Toys R Us exclusive. The packaging for this set has space for doll stands, and one of the stock photos show the dolls on stands, but like most dolls released in 2016 (they’re box dated 2015, but they were released in 2016. I try to go by box dates when I can because it’s an undisputable number.), they were omitted. This is very frustrating because it is very difficult to find male doll stands. Luckily, my childhood signature Alistair Wonderland doll mysteriously disappeared while his stand remained so I have one extra male Ever After High stand. I was really surprised with this pack because the dolls themselves are fine, nothing interesting. Their hair is very similar to their signature dolls. Bunny’s bob is a little longer and curved at the end but that’s about it. The clothes are extremely lazy attached one-piece frocks. At least the print is on both sides. The single piece dress makes sense for Bunny. See Alistair for more complaints about his hideous romper. Bizarrely, if I’m not mistaken, all but one of the plastic pieces are new molds. Bunny’s necklace is a recolor of Maddie’s signature piece. Even the little plastic stuffed bunny is a new special mold with the Ever After High logo engraved on the back similar to the Care Bears heart stamp buttons. Her shoes are really cute but the stock photo featured molded on socks so it sucks that they were removed. Her headband is nice but it doesn’t stay on without the t tabs and you know how I feel about the t tabs. Everyone seems to hate Bunny Blanc which I don’t understand, but I don’t think she’s anything special or exciting either. This pack’s aesthetic is giving twee and the most insufferable hipster white couple in 2011. They definitely posted a million pictures of this date larping that they live in the 1920s. I still really appreciate seeing these characters because Ever After High forgot about them for a while so this was both character’s’ first appearance since their signature dolls, but they desperately need a new stylist. Their hipster fits are dated for 2016, let alone 2023. ", 

"453": "Besties, this is a reunion episode. Who cares about the actual lore about this doll (if you care that much, see Carnival Date Alistair Wonderland, who I got before this one), instead I’m going to talk about me. This was one of the last dolls I bought (with my father’s money, I was 11) during my secret middle school Ever After High collector era, so I didn’t spend much time with him. Unfortunately, within the period of being too normie and cool for dolls, he mysteriously disappeared. Either my mom accidentally donated him to a thrift store or my sister’s friend \"borrowed\" him. Cue the tiny violin music and Jonah’s version of My Heart Will Go On. I found a lucky-ish deal for this doll online but I still paid too much. I won’t tell you the number but it was about half the price most people charge for this doll. He’s so expensive because he’s just a boring white boy. For some reason he has a flask in place of a bag and he looks super pretentious. His boots are very cool, I must say, but his vibe is insufferable. Like he looks like he writes poems on LiveJournal that nobody reads. My doll is slightly wonky but compared to my Carnival Date doll he looks fantastic."


}]