[{

"278": "Following the start of the OMG spin-off line, there was a short-lived LOL line that featured the younger sisters of series 1 of OMG wearing cartoonishly high heels and extravagant costumes. Diva’s older sister is Lady Diva. I asked Gideon to share his opinion which starts here. Cheetah print is OUT and somebody didn’t get the memo. Imagine wearing such an atrocious outfit and it’s not even comfortable looking. The shoes are so extra and she definitely can’t walk in them. Also her hair is basically a mullet. Why would you curl the top and straighten the sides? (Daniel’s note: It’s a reference to the original ponytail Barbies) Girl needs to get herself together. I might be too mean but she deserves the truth.", 

"414": "See LOL JK Diva for an explanation of the LOL JK line. M.C. Swag’s older sister is Swag. Here is Gideon’s description. The swaggiest doll you’ve ever seen. Except not really because her hair is inconvenient. These dolls could never survive in a fast-paced environment with hair that goes so far past their feet. Those highlights are ugly too. Plus her shirt doesn’t even fit properly and is that a full length tracksuit skirt? Not cute and it doesn’t go well with your eyes. 3/10 would talk behind her back.",

"415": "Queen Bee is the younger sister of Royal Bee. I am not a fan of Royal Bee because she is a landlord. Look at Diva from the same line to see an explanation of the LOL JK line because I do not want to go over it again. Gideon likes this doll a lot more than I do and I don’t get it. Here’s Gideon’s description. It’s giving antique Bratz. This doll is fierce and deserves the world. The proportions of her outfit are kinda weird but I think the whole franchise is like that. The colour scheme is nice and simple but elegant. She looks like she would be really kind to people who deserve it but absolutely savage to meanies. 10/10 would get coffee with.", 

"279": "This is the only LOL Surprise doll I got in one of the stupid blind boxes. Usually, LOL tots come in big plastic blind balls which stress me out because that takes up so much space. However, this line decided to innovate in how much plastic it wanted to waste because rather than a ball, the Remix Hair Flip line come in turn table/speakers that can be combined with the corresponding pet blind boxes to make a plastic boom box. If you inserted batteries the playset could play music and the dolls came with little plastic records that I believe played something unique to each doll but I never put batteries in mine. I also had to take out part of this doll’s original hairstyle because it got messed up in the package but it’s all high-quality nylon so its easily fixable. Here's Gideon’s description. This doll is serving looks. She did her edges and everything and I love the different shades of pink in her hair. HOWEVER, her hair is way too long to be convenient. Like, it’s going so much past her feet, it would drag through everything. Imagine getting home and the bottom of your hair is covered in street juice and trash. Maybe she could make a huge bun or something? The earrings and makeup slay though.", 

"280": "In 2021, some of the early released tots were rereleased in visible packaging with various quantities of characters. They kept one of their original accessories but their drink cups were removed. This doll does not like to keep her tiara on which is very frustrating. Fancy is the younger sister of Fancy Gurl from series 1 of the Tweens. I am a much bigger fan of her older sister. Here is Gideon’s description. It’s giving princess peach. She looks like she’ll never work a day in her life and if you told her you were depressed she’d tell you to drink more water and quit your job because she doesn’t understand you have to work to survive. She would also have brand deals on Instagram with pyramid scheme diet pill companies just for fun. But one redeeming quality is that she would definitely give you her hand-me-downs.", 

"281": "See LOL Surprise One Pack Fancy for an explanation of this line of rereleases. Line Dancer was originally released as part of series 1. I let Gideon write his opinion which starts here. \"She looks like Miley Cyrus in that one Hannah Montana movie\" (Jess W).The freckles are cute. She looks like she’ll grow up to be homophobic but then she’ll become a lesbian later on in life. The fringe is kinda appalling but she’s a toddler so I can’t blame her. Also the pink boots with the red shirt is not a good look. Her caregiver did her dirty.", 

"282": "See LOL Surprise One Pack Fancy for an explanation of this rerelease. M.C. Swag is the younger sister of Swag, who is personally my favorite of series 1 of the OMGs. Here’s Gideon’s opinion because he is much funnier and more inciteful than I am. This doll is a full send. Whoever dressed her is probably the coolest person ever. I absolutely love a good jean jacket, and the coordinating hat and onesie? Chefs kiss. The tims also slay, plus her eyes are green which is my favourite colour. This 2 year old has more swag than I could ever dream of.", 

"283": "Roller Sk8er was rereleased just like the other One Pack dolls in my collection, see Fancy’s description for the explanation. Gideon gave some detailed commentary here. This doll has two mums who do roller derby and you can’t convince me otherwise. The way her eyes match her jacket and skates, and her hair matches her shorts and the top of her skates itches my brain (in a good way). I want to go over to dinner with her lesbian roller derby mums and I’d bring them a house plant that they’d keep alive FOREVER.", 

"359": "The Present Surprise line contained a couple of birthday-themed dolls. Miss Celebrate is the second one. I love love love this doll. Gideon gave a much more interesting opinion which starts here. She’s giving Patricia but she hates her name so she goes by her middle name which is Gwendolyn, but she doesn’t like that either so she just goes by G. She’s getting ready to go to a gay bar with all of her straight friends and say \"slayyy\" to anyone in a crop top. But she also writes poetry and performs at slam nights and her poems actually kinda slap. I’d love to get coffee with her, but she would not be welcome back at my apartment.",  

"285": "Dance Dance Dance was a line of (shocker) Dance themed OMGs. They included a blacklight gimmick where if you shine the included blacklight on different parts of the doll’s clothes and face, you can see additional little designs. This doll has an interesting hair texture because it is probably nylon like the rest of the OMGs but it honestly feels more like kanekalon. I know it isn’t kanekalon because fashion doll-grade kanekalon was discontinued before this doll was manufactured. Here is Gideon’s opinion of her. I’ve definitely noticed this doll before in Daniel’s room because the hair looks like ice cream with a silly floral flavour like lavender bubblegum. Her outfit has too many colours but they kind of work together I guess. Her dress would be much nicer without the pink extra bit and the yellow. Overall she’s ok but could improve.", 

"284": "Series 4 of the OMGs was the first of the BFFs lines. It contained two new character dolls that are designed with opposite aesthetics. Sweets is the doll with the hyper girly bubblegum pink vibe. This is one of my favorite OMG dolls. I think she is absolutely stunning. I got Gideon to go into his own opinion and I got some additional opinions which start now. \"Cotton candy\" - Jenab \"I love subtle pride messages\" - Jess W \"Was she a rabbi in her past life? Where’s her top hat?\" - Jess W (because Gideon pointed out that the curls on the front of her head look like payos). Her pose is everything and I want to be best friends with her. I love the matching colour split with her hair and her shoes. She’d be mean to me, but it would be so valid. 10/10 would accept a punch in the face from.", 

"286": "Following the recent trend of miniatures in the toy world, MGA started releasing mini versions of LOL Surprise dolls. The Families series contained larger orb container mini playsets and multiple micro dolls. There was also a pet included. I included these mini dolls as dolls in my collection because I like padding my numbers and making Jonah’s workload larger. Here is Gideon’s opinion of Precious. She’s giving… boring. I thought the official picture on the wiki would make her look better but actually she’s worse. What the actual heck is that hairstyle?? It looks like Oompa Loompa hair but with weird little braids coming out. The outfit is… fine I guess. I’m just kidding, it’s hideous and she deserves better, I was just trying to be nice, but she can’t hear me. At least it’s practical for a little stroll in the park though.",  

"287": "See Mini Families Series 2 Precious for an explanation of the mini Families line. Ewwww. Not a fan. Who does her hair–if you can even call it hair. If you’re going to have sparkly pink hair and a sparkly pink shirt then at LEAST make them the same shade. And then we have the salmon coloured gaps in the hair. This is a slimy doll and I do not like her.", 

"288": "This doll was released in the second series of minis. This is different from the mini Families series because it only included one mini doll and one accessory. In this case, the accessory was a mini guitar. Punk Grrrl was originally released in a 2-pack with Rocker Boi as part of the Remix series. I’ll let Gideon give his opinion of Punk Grrrl now but I will quickly add that Rocker Boi is scary and I don’t like the male OMG dolls. Her makeup? Terrible. Her hair? Cool colours but the fringe is a no from me. She looks like she hates her fans and makes her PA wash her feet for her. Her guitar could be a redeeming quality but unfortunately it’s an ugly colour, especially with her hair. I looked at the big version and somehow it’s worse. The hair is terrible and it looks like she’s wearing socks and sandals. Her dress reminds me of something I would have been rightfully bullied for wearing in middle school. So, ultimately, girlypop is a flop.",

"289": "ALT GRRRL is a rerelease that tied in with the LOL Surprise House of Surprises web show. This doll was not sold with the purse and bracelets of the original release. However, this release made the doll’s face visible still in the packaging while the original committed to the \"surprise\" gimmick. ALT GRRRL is very obviously inspired by Kurt Cobain and the general grunge movement of the 1990s. Her sunglasses are a direct reference to a pair Cobain famously wore. I really appreciate the tiny details of this doll, such as the real chain straps of her dress. I had a phase in high school where I was obsessed with Kurt Cobain and Nirvana, like all edgy 15-year-olds, and I would’ve kept this doll on display with my records even when I was no longer interested in dolls.",   

"388": "Western Cutie was one of 2 dolls released in Series 7 of the mainline OMGs. As of the time of writing, this was the last series to just feature 2 dolls, and to be completely honest with you, I’m not really sure how the two are tied together. I wouldn’t even call them opposites. Anyway, I’m sure Gideon’s commentary is much more interesting that mine, so I’ll stop talking and let him share now. I told Daniel not to buy this doll but he never listens >:(. This one has some redeeming qualities but a healthy hand full of flaws. Her hair is cute I think, especially the streaks because they’re a little bit green, but it’s too long to be practical, especially since she clearly works on a ranch. Her outfit is mostly nice but the tassels on the pants are NOT it and the harness doesn’t fit properly. The boots are a slay and they go with the bag, but that, unfortunately, is not a slay. I think she needs something more practical to carry her bits and bobs like a backpack because she’s presumably riding horses. Her hat is cute and pulls the outfit together, but it doesn’t need the bunting. I love how her lipstick pops and contrasts with her eyes and hair. Western Cutie is a little extra but overall a slay. 8/10 would ride horses with her.",

"387": "Sunshine Makeover was yet another color change gimmick line, only rather than temperature or water, the pieces to these dolls change color in the sun. Personally, I don’t like taking my dolls outside much because I am terrified of UV damage so my Sunrise has only featured her default color scheme. I happen to prefer it so it works out for me. Sunrise has a 60s go-go dancer aesthetic which really stood out to me when I first saw her. She’s also very purple which gets bonus points from me. Gideon does not seem to agree with me though, as you can see here. First impression is \"oh honey no,\" but Daniel tells me she has a colour changing gimmick which gives her lots of extra credit. I have a tenuous relationship with Sunrise. The colour changed version is more slaytastic, especially because it makes her lips look less silly. About her makeup—the eyes and the cheeks are 10/10 full sending. The pointy bits on her eyelids make her look like she could take charge of any room. The lips are not so lovely. They look weird with the hair and they stand out too much because they’re so light. Let’s talk hair—the colouring is gorgina and the edges are giving, but the style looks like she did her own hair for second grade picture day. It’s at least a reasonable length though so she won’t trip. As for accessories, the earrings look like eggs, the belt is confusing and a flop, and the shoes look like something my mum bought me for school as a child but at least mine were black and not ugly bathroom yellow. The dress and the socks are 11/10 though, before and after the colour change. The little mesh bit is fun and the rest looks like a robe but surprisingly I vibe with it. I am obsessed with the fun socks matching the dress. They do look like they’d slip down and I’d get very upset with them, but fortunately she’s a doll and doesn’t have sensory issues (Daniel’s note: she also has rubbery legs so they wouldn’t slip down). 10/10 would go to a trendy brunch spot with Sunrise (but she’d pay because she definitely makes double my salary).", 

"290": "The LOL Surprise Tweens were first released in 2021 as an in-between of the LOL tots and the OMG adult dolls. The Tweens have in my opinion some of the most gorgina and high-quality fashions of modern fashion dolls. However, Cherry BB is one of my least favorites. Cherry BB has a 1950s aesthetic which I have an irrational hatred for. Anyway you didn’t come here for my opinion so here is what Gideon had to say. Cherry BB is a little bit of a mixed bag. Her earrings and choker are kind of adorable and I think I like her shoes. They actually look comfortable, unlike many other dolls in this collection.  Her pants are also cute even though the bottoms are rolled up in a weird way and the pockets are kinda dumb looking. I also like the shirt and it kinda slays that it matches the pants. The jacket is cute too–I would probably even wear it myself–but it doesn’t match the rest of the outfit at all which is unforch. The purse is hideous and should be thrown in a fire immediately. It is also too small to carry all the practical things like a water bottle, almonds, chickpeas, meds, a book, a screwdriver, two portable chargers, and another smaller backpack that contains the same items just in case. I guess it wouldn’t fall over when you put it down at least, but the negatives definitely outweigh the positives. I almost forgot to mention how ATROCIOUS her hair looks. I cannot imagine how they could make it uglier–the style is ridiculous in a bad way, the colour is abominable, and the highlights aren’t even done well. At this point even a Jonah haircut couldn’t fix it.", 

"291": "Fancy Gurl was released as part of Series 1 of the Tweens and is by far the standout of that line. She is very obviously inspired by Ariana Grande, but in a different style from Kitty K, an OMG also inspired by the singer. Fancy Gurl’s younger sister is Fancy, who I also happen to have (and you can read about on her page). I feel bad saying this but Fancy Gurl is a million times better than her sister, she’s much more interesting and has much better style. I’ll stop talking now so you can hear what Gideon has to say about her. My fight or flight instinct gets activated when I see Fancy Gurl and I can’t decide which I would do first. She is going to inherit $40 million, start a clothing business, and truly believe that she pulled herself up by the bootstraps. Daniel really likes this doll so I feel a little bad being so mean about her, but I truly don’t dislike her outfit that much, I just think she’s a trust fund baby who doesn’t recognize her privilege which makes me mad. In terms of outfit, I’ll try to be nice. The colours are very coordinated and the earrings are a big slay. I do not like the purse (sorry Daniel). A tote bag would be more practical and it could have pictures of Jonah playing tennis and silly pictures of Gideon and Daniel. I would try to be nice to her for Daniel’s sake but my patience would be limited.", 

"292": "To be honest, Freshest is the most forgettable doll in Series 1 of the Tweens but she’s still very cute. I don’t even know what her official vibe is referencing, I’m guessing it’s e-girl. I’m sure Gideon will have a better explanation. This may be my favorite doll so far. She’s 100% serving and I have no critiques. The shoes look super stylish and also really comfortable which is important, especially for her long-term back health. Her pants and the fishnets are a fantastic combo and the black stitching with the white-ish jeans is everything. The shirt is also super cute and I think it’s shiny which makes it so much better The jacket pulls the look together perfectly and also looks nice and cozy and warm (even though the zipper is a little impractical). Her makeup is giving and it matches her hair perfectly and also her outfit. Her edges are adorable and her hair is phenomenal–the style and colour. Keep on slaying Freshest!", 

"293": "Hoops Cutie is a basketball slash sneakerhead (I would just put / there but I’m not sure if that will mess coding things up) themed doll. She also features her natural (well she’s a doll and her hair is plastic but you know what I mean) hair which is really great (Rainbow High take notes). This doll features \"BTW\" branding, which was the original name for the Tweens, but this was quickly dropped. I don’t know why. Here’s what Gideon thinks. Her purse is the worst purse I’ve seen yet. It is UGLY, it is IMPRACTICAL, and it is TOO SMALL. It couldn’t even hold a sappy gay YA novel because the pages would get all bent up. It also takes up her whole hand when a tote bag from Shutterfly would leave BOTH hands available for tasks such as playing songs on the guitar and playing actual basketball. The shoes are pretty good and seem to have good arch support. They work well with the rest of the outfit too. The sweatpants look comfy but the lettering is unnecessary. The windbreaker(?) would be cuter if it weren’t cropped, but the colours are fun! Her makeup isn’t extravagant but it looks nice and her earrings are perfect. Her hair is super cute mostly but the braids are a little silly because they’re so rigid. Overall she’s alright but not my fave doll.",

"294": "Goldie Twist was released as part of Series 2 of the Tweens and she is by far my absolute favorite. She has a very mod 1960s aesthetic which I adore. I’m much more of a 70s girlie but I can’t deny how amazing her Twiggy makeup looks with that outfit. This doll also essentially has two outfits because she has a two-piece underneath her dress. Anyway, here’s Gideon’s opinion. Surprisingly I like this doll. I think she works at a coffee shop that sells overpriced drinks and also plants but she likes to give discounts just for fun. Her purse isn’t my favorite thing ever, but it leaves her hands free and definitely has space for plenty of chickpeas and probably even another smaller purse. Unfortunately, it is round so a self-help book would not fit well, but she probably has a Kindle. The little flower tights are really fun even though they’d be a sensory nightmare. The shoes could use a lot of improvement; they are ugly, impractical, and look uncomfortable. They should probably just be switched out for white Doc Martins. The dress is fun and exciting and probably also waterproof which is very convenient. The purple and green go surprisingly well together and I like that they’re muted so they don’t overwhelm my eyes. Her earrings are nice and simple so they don’t overwhelm the outfit. Her hair looks like a nightmare to brush but it is very pretty and looks soft. I would buy plants from her for sure.", 

"296": "This doll is a part of Series 2 of the Tweens, but she was weirdly rereleased in a 5-pack with all of series 1. That’s how I got her and the Series 1 dolls but they’re exactly the same as their original releases, so I didn’t bother mentioning it repeatedly. The box date for the Series 1 dolls might be different though, I have no idea. This doll is giving some kind of harlequin vibe which I don’t really understand. Anyway, here’s Gideon’s much more engaging opinion. I’m not sure what to say about Lexi Gurl. She looks like she has no self-awareness or any other kind of awareness. Her shoes would be cute if they weren’t such a weird shape and the colours could be a little more pastel. The socks look like a pair I wore for like 10 years because I loved them so much and I still kinda love them. Her dress is on the verge of being cute but it misses the mark. It is simply too much and I don’t like how asymmetric it is (and I’m guessing Daniel doesn’t either.) The cats are confusing and look silly but at least they’re cuddly and soft. Her hair has potential but the bangs are ugly and don’t add anything. The curls are stunning though and the colours match the shoes flawlessly. The bows are cute but would be better as clips. I have a feeling she has some stuff to work through and I would absolutely support her on her journey.", 

"484": "I think this is one of my new favorite dolls of all time. Normally Gideon writes the descriptions for these dolls but I got so excited that I wanted to do it myself. Wildflower is a part of Series 8 of the main OMG dolls, which just means they don’t have a gimmick at this point. Wildflower is very cottagecore country and I love literally everything about her. Her sleeves and her corset are all separate pieces from her tank top which is always nice. I love the little ombre on her bell bottoms, which can I just say THIS DOLL IS WEARING BELL BOTTOMS!!!! It makes me so happy. I also love how her hair looks, it curled a little more after I washed the gel out. Like there’s literally nothing bad about this doll. I also love her unique green eyes and her nose blushing. Her butterfly-like eyeliner is flawless too. I love her very very much. This is probably one of my new comfort dolls.", 

"481": "Fierce was a short-lived spin-off line to the OMG dolls that immediately flopped. I think the idea was to make yassified versions of the OMG dolls. The dolls are taller and have hard plastic legs that bend at the knee. Weirdly, the feet seem to be a separate piece from the leg but there is no articulation. Also the stands are massive and it’s honestly really unnecessary. The main downfall for these dolls was the price point. They retailed for $36 each, and I doubt anyone wants to spend that much on a new type of doll. The first (and only playline) series of Fierce dolls featured the characters from series 1 of the OMGs. Honestly, I picked Neonlicious because Swag was sold out. Swag is by far the best doll in this line up as far as I’m concerned. There was going to be two dolls released in series 2 (Candylicious and Kitty K) that are sooooo gorgina but because nobody wanted to pay $36, they were scrapped. However, before that there was a collector Fierce doll released for the 2022 holiday season. What’s most interesting about that doll is that rather than being an original LOL Surprise character, MGA decided to create a doll of the historical figure Cleopatra. MGA did not learn their lesson here because this doll retailed for $100. Usually MGA is much better at pricing their products than their main competitor Mattel so I’m honestly surprised about that. Anyway, let me get into the actual doll I DO have. Neonlicious is super clumsy so she’s a relatable queen but she’s also a fashion designer so she’s not that relatable. This doll has more detailed makeup than her original OMG, but I’m notestly not completely in love with it. I really don’t like the bandaid-on-the-nose thing, it’s a sensory issue for me. I just feel like it would be super uncomfortable. However, I do like the rest of her face a lot. The squiggly eyebrows are so camp and draggy, I love it. I don’t really get the outfit, when I was younger I tried to pair that kind of jacket with a dress and it didn’t work very well but maybe I’m just jealous. My favorite part of this doll is her crimped hair because I think crimped hair always looks good. I really love the color combinations here, it just all looks really nice together. I don’t really get why her purse is shaped like a milk carton but I’m kinda living for it.", 

"483": "So I fully intended on being a completionist collector for the LOL Tweens but… I just didn’t. I just haven’t prioritized them even though they’re all so good (at least until Series 5 when the budget cuts came in). This doll is such a stand out even in the sea of standouts that is every Tween doll. Anyway, Olivia Flutter is part of Series 4. She has a butterfly motif that really reminds me of Bratz Fashion Pixiez. It’s very y2k on TikTok and I love it. I love the lace on her jeans, even though it looks like a sensory nightmare for me. Her makeup slays, I love the icy lip. The flip phone is so cute too, but I never know what to do with doll phones because you have to rubber band them on. They usually end up in storage. Anyway, this doll slays and she’s the best doll in Series 4.", 

"480": "Ok so I did not intend on getting 2 Fierce dolls, BUT Swag was the one I really wanted and my Target sold out of her first so I picked Neonlicious. Miraculously, I went to Walmart about a month later and they had a ton of Swags. Oh see OMG Fierce Neonlicious for more information about the Fierce dolls. Swag is in my opinion the best Fierce doll. Her face card never declines, her shoes are so unique and her outfit is such an upgraded yaassification of her original fit. I just love Swag so much. She’s definitely my favorite Series 1 character. It’s a shame that Fierce was canceled but I’m glad I was able to get this beautiful doll out of this short-lived line.", 

"482": "While she isn’t the highlight of Series 4, Jenny Rox still slays. The first thing I must say is that her undershirt says \"Rawr\" with a couple of cat doodles which I find very funny. This outfit is very cute but the detached leg warmers? Pant sleaves? Confuse me because I feel like they’d constantly cause issues. I love the makeup, especially the nose blush, I think it’s so cute. The hair dye looks a little bit out of date but I’m not sure. I love purple dolls and this one is no exception."
}]