[ 
{
"351": "This tiny doll was released in 1996 in a McDonald’s promotion for the Barbie Dolls of the World line. The Dolls of the World are a showcase of traditional fashion around the world. This line also included Kenyan Barbie, Japanese Barbie, Mexican Barbie, and American Barbie. Her pieces are non-removable, like most McDonalds dolls. This was one of my favorite McDonald’s toys as a child even though I got it second hand. I would rather have the full-sized doll but this one is still nice.<br><br>-Daniel",  

"311": "Princess Graciella is the unintentional antagonist of the movie Barbie: A Fairy Secret. She is a fairy princess who falls in love with Ken at first sight and kidnaps him. She then forces Ken to marry her. Barbie and Raquelle need to get over their conflict and work together, with the help of their two friends who happen to be secretly fairies, to save Ken. This does not take place in the Life in the Dreamhouse universe. This doll comes with detachable wings that I lost a long time ago. Despite the polypropylene, I really like the bright pink color of her hair. I also really like her wedding dress, although the high-low skirt is very early 2010s. The dress is completely molded on, but I wouldn’t expect more from a McDonalds toy. The only thing I wish was different is that wish this doll had cute little fairy shoes molded on.<br><br>-Daniel", 

"312": "Kayla is one of Merliah’s (Barbie) sidekicks in the critically acclaimed film \"Barbie in a Mermaid Tale\". For an unexplained reason, she has a British accent. This mini doll is a modified minature version of the 2009 Color Change Kayla. Interestingly, The character in the movie is blonde while both versions of the dolls are redheads. Another interesting thing about this doll is that she seems to sometimes be Barbie’s friend Summer as Kayla, when Barbie has had multiple friends named Kayla throughout the past thirty years. I don’t know the reason for any of this. I am unwilling to rewatch any Barbie movies unless Jonah sits through them with me; I’ve decided this just now. Anyway, this McDonalds toy mimics the full-sized doll’s color change feature on her tail, but it’s just a couple of small shapes rather than the entire tail. Shockingly, this feature no longer works. This doll has a full range of motion at her hips but is otherwise very limited. She’s very low quality but I put a lot of effort into collecting her as a child so I don’t have any desire to get rid of her.<br><br>-Daniel", 

"313": "This McDonalds toy depicts Barbie as Merliah in her mermaid form. She is the only doll in this line with a fabric piece (her tail). This fabric tale is non-removable, but her legs are one solid piece so it would be pretty horrifying to look at if it did come off. This doll is in the worst shape of all my McDonalds toys because when I cleaned her, a good chunk of her hair plugs on the perimeter came out when I was detangling it, so she has a massive bald spot on the side. Losing hair plugs is inevitable, even with new dolls but because these dolls are so small and have such few plugs, it’s a lot more noticeable. I also did a lackluster job with the hair straightener (from lack of skill plus not wanting to lose any more plugs). This doll is very cheap, but she was very important to my childhood so she’s very special.<br><br>-Daniel",  

"314": "This doll is the only human mini doll released as part of the Barbie in a Mermaid Tale line. It depicts Merliah, Barbie’s character, as a surfer. In the movie, Merliah is a competitive surfer who discovers she is a mermaid princess. 2009 Barbie in a Mermaid Tale \"pink swimsuit\" Barbie #R4199 id the full-sized version of this doll released by Mattel. I had the big doll as a child, but she mysteriously disappeared. This is also the only doll from this line to come with a separate accessory, being her surfboard (that doubles as a hairbrush). Additionally, this doll has neck and waist articulation. All the dolls have neck articulation, but this is the only doll with the Twist N Turn-like waist articulation. Like all McDonalds toys, this doll has polypropylene hair but as a Happy Meal toy, I can’t complain. I have a lot of childhood memories of this doll, so she is very sentimental.<br><br>-Daniel",  

"315": "Xylie is Merliah’s second mermaid sidekick in the Barbie in a Mermaid Tale universe. She is also weirdly British. This is a miniature version of the 2009 Color Change Xylie. She seems to also be marketed as being played by Teresa. Unlike the McDonalds toy, the full-sized Xylie has the same amount of articulation as the full-sized Kayla. The mini Xylie does not have the waist articulation, rather she has the equivalent of ankle articulation with her tail. She also has a color change feature that also no longer works. She has always had very loose limbs which frustrated me a lot as a child but she has my favorite color scheme of all the Mermaid Tale characters. Her face is identical to all the other dolls but it doesn’t offend me too much.<br><br>-Daniel",  

"316": "The Liv McDonalds toys are dressed in miniature versions of the It’s My Nature outfits. Hayden was my favorite Liv character (after she was introduced) because I thought she was very pretty. Unfortunately, I no longer have any of my full-sized Hayden dolls. I love this doll’s little cowboy hat, but I wish it was removable because 1. It would be easier to see her face and 2. It would make her hair so much easier to take care of because I would be able to use the hair straightener on it. Another complaint is that her legs are unarticulated, she just moves at the waist, shoulder, and neck. Although it’s molded on and a bit dated, I think this doll’s look is very slayful<br><br>-Daniel",  

"317": "In the Liv universe, Katie is the athletic tomboy character. She is the first character to adopt a dog. I’ve always been very girly, so she’s never been my first choice. This mini doll has a molded on version of her \"It’s My Nature\" ensemble. I think this outfit is fine but I would never ever wear anything like that. However, I am less irritated by her attached hat compared to Hayden because the shape does not cover her face as much. Also, this doll has braided hair so I didn’t need to worry about using the hair straightener on her. This doll is honestly really meh to me I don’t really care that much about her.<br><br>-Daniel", 

"318": "Considering this a doll is a stretch but this is my collection and I do what I want. I’ve honestly never been that interested in doll styling heads. I never cared that much about hair gimmicks. I certainly enjoyed dolls with interesting hair, but I wasn’t that interested in customizing or learning elaborate hair styles. I was too busy making sure my dolls had realistic living arrangements (Ka. Chow.). Having a Liv doll styling head is interesting to me because the actual dolls had wigs. Both of my remaining full-sized Liv dolls no longer have any of their wigs (they were all destroyed by 8 year old me), so this sparsely rooted polypropylene styling head is the best I can do with Liv hair. The first edition version of Sophie was the first Liv doll I got, under the same glasses logic as Molly. However, this styling head doesn’t hold much sentiment to me."
}
]