[{

"165": "Before I look at Daniel’s notes or make any other impressions, the first thing I need to say is \"rawr.\" Anyways, as Daniel tells me, this is the signature version of this character. Because this doll is an initial release, she has an elastic waist rather than plastic, so she’s more likely to break. Fortunately, she has made it through Daniel’s childhood in one piece. Just kidding actually. The waist is fine, but Daniel has lost one of the forearms, so the one in the picture is borrowed from the reproduction’s. Clawdeen is a werewolf, not a vampire like I had hoped. She likes fashion, and I think the colors she has going are very fun. I’m not sure what the necklace is exactly, but if she’s a fan, I’m a fan. Her hair looks like it’s standing up a bit, and I think that’s Daniel’s fault, but we forgive him.<br><br>- Jonah",     

"333": "This is the first Monster High doll I ever got, and she certainly shows her age. This Cleo doll is from the initial lineup of Monster High dolls released in 2010 (they are box dated 2009). While most of the dolls were sold individually, Cleo was exclusively sold in a 2-pack with Deuce Gorgon, who is her boyfriend in the first generation of Monster High. Cleo De Nile is the daughter of The Mummy; I’m not sure which one. She’s a very dramatic character who loves attention and glamour, but she cares for the people she loves more than anything in the world. I like to say that this doll is very me-coded, but most people don’t get what I’m referencing. Anyway, I got this doll new from the store (I’d say bought, but my parents paid for it) along with her boyfriend. I have lost almost every piece to this doll. All that remains is her romper, belt, shoes, purse, and pet snake. Both of her lower arms are missing. Monster High dolls have removable forearms and hands to make dressing easier. The early dolls are notorious for losing their lower arms because they did not stay in very securely. Additionally, for the first year or so of Monster High as a brand, the dolls had elastic strung hips which are also notorious for breaking (see G1 Core rerelease Draculaura for more on that). The elastic hips become very loose over time, so the early Monster High dolls have trouble sitting properly. Another problem with this doll is that she has a huge chip in her eyebrow paint. I had to borrow another Cleo doll’s lower arms for the picture, but they would not stay in. That is why Cleo is standing in an awkward arms crossed position. I really wish I could do more to restore this doll but considering all she went through, and all the manufacturing disadvantages stacked against her, I think this Cleo doll has cleaned up pretty well.",  

"166": "This doll was released in a 2 pack with Cleo de Nile. His matching green hair, eyes, and tattoo are stellar, but rumor has it he’s nothing but a himbo and a simp (source: Daniel). Like his mother, Medusa, Deuce has snakes for hair, but they just kind of look like a poorly kept mohawk. I’m a big fan of the original vest with grey, black, and white stripes, but I still don’t understand what the point of a vest is — are you cold or not? The pants are fantastic, but rumor (aka Daniel again) has it, these pants will not be represented on the site. But the original ones are black with a lovely grey design of diamond shapes scattered on each leg. (Daniel’s note: I used Howliday Love Edition Deuce’s pants for the picture and Jonah said it looks silly). Continuing with the way that Daniel’s version of this doll seems to disappoint, both of his legs fell off when Danny was 9, and one of his feet broke off. He claims the leg fell off because he has \"strung hips,\" and I guess we will just have to take his word for it.(Daniel’s note: I have physical proof it was entirely the elastic girrrrrrrrr) <br><br>- Jonah", 

"334": "This, folks, is the main character of the first generation of Monster High. Everyone is obsessed with her, so she has quite a few love interests. That being said, she is only 15 days (yes, days. I don’t exactly understand doll lore) old, so she’s quite naïve. The shoes slay. I love the high heels, but they look like they’d be impossible to walk in. Beauty is pain I guess. And the stripes are fun with the polka dots and plaid in her clothes. Also, the materials going on the fit are amazing. We’ve got what looks like a metal and leather belt, a knit tie, silk shoulder pads, lace sleeves. Like come on. They could’ve stopped half way and I’d be impressed still. Although, the effort they put into the clothes they dropped on the legs. Because they’re elastic, they fall off easily. Also, Daniel would like it to be known that the stain on her face was, in fact, not his fault. <br><br>Note: this doll uses they/them pronouns in the third generation, but the first generation uses she/her. Because we consider the different generations different people, we have decided to use she/her for this doll. This is a contested subject.<br><br>- Jonah", 

"167": "This doll was a rerelease of the first wave Dead Tired Draculaura doll bundled with a rerelease of the Jewelry Box Coffin playset. This was released in 2013, I assume the box date comes from the original release. Both the doll and the playset differ from their original release, as the playset no longer has the tv and the doll’s shoes have changed to a solid black. Draculaura also does not come with her little \"Scary Human Movies\" accessory. This is one of the most iconic Draculaura dolls to me with her bat-like hairstyle. Draculaura has never been my favorite character but getting this doll was always a priority for me as a child. I was so excited to find out it was rereleased with the playset because that was also very cool to 11-year-old me. The sleeves never stay on Draculaura’s shoulders, but I don’t mind that much. This doll is very camp, and I love her.", 

"168": "The first wave of Dead Tired is so iconic to me. The playsets are SOOOOO slayful and unique. For the most part, they doubled as some sort of gimmick, and this one was a sort of lava lamp type of thing. This doll came bundled with her \"Hydration Station\" and you put Lagoona behind this little tank and you could press buttons to make bubbles or lights. I got this playset for Christmas and my sister thought it was very cool but I was awful and didn’t want to share it with her. She was still interested in dolls at the time and I took it for granted so shame on me. But honestly I was a terrible brother because I just didn’t want her to play with it because it was mine rather than because I wanted to play with it (pretend I put the \"mine\" in italics, Jonah told me to not even bother because I’m hopeless at learning any coding stuff). So, my parents bought her a second playset and I was not happy. I was very silly. Unfortunately, I no longer have either of the actual playsets minus some of their accessories, but as you can see, I still have both dolls. I don’t know where one of their outfits are or where any of the slippers are but that’s ok. I absolutely love this doll’s makeup, even though it’s very silly (and bad for your skin) to go to sleep with that much eyeshadow on. I also love her shorter hair but I love every time dolls have shorter hair. Lagoona is the athlete of the main character group so she’s never been my favorite and I never really connected with her but I think she’s absolutely gorgina. Also, G1 Lagoona’s calf fins constantly fall off so I just left them off for all the pictures on this website. Sorry about that. Lagoona is also Australian so that’s something else to note I guess. Her boyfriend Gil is the worst and she should leave him. I don’t have any Gil dolls though so I’m not going into detail about him. The very mean person that made this website refused to watch the Monster High movies with me so I don’t have recent memories of Gil anyway.", 

"335": "For whatever reason, Clawdeen’s first pajama doll was not a part of the Dead Tired line. Instead, she was this one-off release that came with her bunk bed playset. This bed is also unique for the early beds because it doesn’t double as some other toy for kids (a mirror, jewelry box etc.). Instead, it showcases doll-sized dog bunk beds and various accessories. Clawdeen decided that bedtime does not mean mid time because she slays here. The purple garage doors compliment her brown eyes so well. Her pajama shirt is purposely ripped to look like she clawed at it in her sleep to emphasize that she’s a werewolf, but it’s also incredibly chic. I’m not sure why there’s a scale pattern throughout this outfit, it reads dinosaur to me more than wolf. I also have no idea where her slippers are right now, sorry about that. A recurring theme for this doll is subtle couture, as the only color in her hair is purple hidden in the back, similar to the lesbian pride flag hidden in Bratz Jimmy Paul Pride Roxxi’s hair. I also appreciate the small detail of having pierced ears but no earrings because naturally, Clawdeen would take them out to go to bed.",  

"353": "Frankie dresses for Draculaura’s Sweet 1600 by wearing her 2008 prom fit. It’s so camp. The hair is a big abstract design with a beehive and a LONG ponytail. Because this is a special occasion, her hair also features lots of tinsel. I haven’t been able to recreate the original style but what I did gives a similar vibe so I’m happy with it. This doll has asymmetrical earrings which I usually don’t like but they’re her stitches and the gimmick works for me so I’m happy with it. By far, my favorite piece to this doll is the shoes because they don’t really have a heel and they’re such a unique shape. I forgot to add the extra pieces this doll came with, I have no idea where the key is, but I purposely didn’t include the dress she gave Draculaura as a gift because I didn’t know how to display it. I’m happy to exclude it though because it is very ugly. If you want more details about the tie-ins to this line, see Sweet 1600 Draculaura.", 

"354": "Because she is a vampire, Draculaura lives for thousands of years. Celebrating her 1600th birthday is the equivalent of her Sweet 16. This celebration is shown in the movie \"Why Do Ghouls Fall in Love?\" but I cannot tell you the plot because Jonah said no to watching it with me so I refuse to do it myself. This line also featured accessories to be used in a tie-in iOS game where you got plastic keys to tap onto the screen. I don’t remember it much but I remember not being impressed. This line also featured Draculaura’s hearse roadster that she got as a gift from Dracula. Anyway, this doll has a very 60’s inspired beehive hairstyle that I could not accurately recreate sorry. Her makeup is also special, as her little heart on her cheek features \"1600\" in the middle. Her outfit is also cute, as rather than a dress she wears a leotard and a tutu. The skirt’s material is really soft and nice. She also came with a massive birthday cake and an extra skirt she got as a gift from someone else. This is one of my favorite Draculaura’s because she is so stunning and has such a unique silhouette.",  

"169": "I think she gets all A’s. If other people cheat off of her, she will rat them out, so nobody likes her. She wants to go to Harvard but won’t get in because she’s boring. Now that we have gotten Gideon’s judgements out of the way, let’s offer some Lore from Daniel. She is a barista. She came with a playset. Though she is called Coffin Bean, she was released years before the actual coffin bean line. Another version of Coffin Bean comes with an extra doll, but that is not the one Daniel has. Daniel claims one of her knee joints has always been loose, but I would guess it was his fault. Daniel wants me to clarify that she came in the box like that. Sorry Danny. I know she is a werewolf, but I feel like the ears are a bit odd. The purple dress is very regal, which I appreciate, and the gold accessories complete the royal look. I thought the highlights in her hair was pink, but Danny tells me they’re just light brown. Oh well. Gideon would also like to add that her belt looks like it’s sitting too low, and Daniel shares that’s because she is so skinnyyyyyyyy<br><br>- Jonah", 

"358": "With the second core line, released a year after the initial release, the original ghouls got new fits in addition to new characters. Abbey is one of the new characters, and for some reason, she is the only new character that consistently got incorporated in the main friend group. Abbey Bominable is a new student at Monster High at the start of volume 2 of the webisodes. She replaces Frankie as the new and clueless character, but rather than just being completely naïve of the world, Abbey is more of a xenophobic punchline. As the daughter of the abominable snowman, Abbey is portrayed as vaguely Russian and it is as accurate as my Russian accent when I tell Jonah to go sleep on the couch. This is very problematic and was remedied in G3, where Abbey is now Nepalese. Abbey’s doll is slightly taller than the standard Monster High doll, and she has this glitter layer all over her skin which looks really nice but gives her body a rougher texture. It didn’t bother me that much when I was a kid but I definitely noticed. Though I’m autistic so I don’t exactly have a normal grasp on sensory prevalence. Abbey dolls also prominently feature tinsel in their hair which looks really nice but snags so easily so it’s just a pain to maintain. It is a higher-quality tinsel but it’s still tinsel. Aesthetically, I love absolutely everything about this doll. Her dress is far too short for me to even imagine feeling comfortable in but it is very chic. I also adore the matching headband, arm and leg warmers that are all very soft. It does suck a little that her \"purse\" is attached to her dress but it’s whatever. Abbey has asymmetrical earrings which you’d think I would hate but I absolutely love because it just looks really good. The earrings are two different colors, with a blue icicle and a purpley-pink snowflake. Abbey’s mug also slays, purple eyeshadow always looks gorgina. Today, if you wanted to buy this doll on the second-hand market still in the box, you will have to pay hundreds of dollars but that’s honestly super silly and delusianna because this doll retailed for like $20 and very likely has glue seepage. Also the value is going to go down with time, just please do not give scalpers any money I promise it’s not worth it.", 

"170": "The Core dolls of the original Ghouls were rereleased multiple times throughout Generation 1 of Monster High. I somehow missed all the rereleases as a child but I guess I’m making up for it as an adult. I believe this doll is the second release but I am not certain. This doll was still strung but she had a black elastic which tends to indicate she is a rerelease (But this is not irrefutable!!!! I am just guessing here). Unfortunately, right before I cleaned this doll I broke the elastic by stepping on her. Oops. I don’t mind that much because I hate the elastic hips anyway. Obviously I got this doll used or else I would know which exact rerelease she was. My doll was missing her umbrella, pet, and diary. Her necklace was also broken so it cannot be worn without falling off but it’s not a big deal to me. I think this doll is very beautiful and signature Draculaura is absolutely iconic. This outfit is one of the first things I think of when I think of G1 or Monster High in general. I do think that the G3 signature doll is better but I still think this one is great.", 

"368": "Dance Class was a line that featured random characters taking a dance class, and judging by their outfits, they were all taking classes for different forms of dance. This was a slim box line but there was a 5-pack rerelease that featured two new characters in addition to most of the original line. Howleen appears to be taking a hip hop class and wears this ugly leotard but she accessorizes it well. My favorite thing about this doll is her hair because it’s hot pink kanekalon so it’s really soft and pretty. The makeup is also really beautiful. The only thing I’m missing from this doll is her earring which I lost many years ago. It was a yellow safety pin.", 

"173": "See Dance Class Howleen Wolf for a brief description of Dance Class as a line. This is my only Operetta doll so I’m going to give a brief description of her as a character. Operetta is the daughter of the Phantom of the Opera. I don’t know anything about that story so that means nothing to me with peace and love. Operetta hides in the catacombs all day to avoid interacting with other people. Operetta is a bit of a mean girl so sometimes she’s considered a secondary antagonist but I never noticed as a child. To be honest, I never cared much for Operetta as a character. Another important fact about her is that she dresses in the 1950s aesthetic which I despise. I think the 50’s aesthetic is the ugliest form of fashion in the world and I wish it was illegal. This doll isn’t the worst offender of this aesthetic because she’s taking a swing dance and she’s just wearing a leotard and a skirt. The outfit is just ok. I don’t know anything about swing dance so I’m not sure if that’s the right attire but I think it’s cute. The skirt and the headband are very soft which I appreciate. I always remembered this doll’s hair as rough and cheap feeling, so I assumed it was polypropylene until I cleaned her when I realized it was saran. This doll, like all Operettas, this one came with an eye mask but I lost it.", 

"337": "The second wave of Dead Tired dolls were all slim box releases, and featured a new Draculaura, Clawdeen in her first (officially Dead Tired) pajamas, and Abbey’s first night-time appearance. She has this cute little nightie and comes with a tub of ice cream that you can’t open. This doll’s makeup is very similar to her signature doll, but you can easily tell the difference with the shorter hair and lack of earring holes. I think I got this doll before my signature Abbey but I don’t remember. I remember playing with her a lot even before I got her bed, which is kinda lame because it’s just a block of ice but it’s cute.",

"174": "Ghoul’s Alive was a gimmick line where the dolls all had electronic features that correlated to traits of their monster species. In this case, Spectra is a ghost so her doll lit up, glowed, and made noise when a button was pressed on her stomach. These dolls are uniquely built because they have new articulation to accommodate their electronic features. With this doll. They don’t exactly articulate but her legs connected at the knee and her arms connected at the elbow. They could not bend though. Her legs were (and still are) constantly falling off. I still cannot find one of her legs; it might be with the remaining childhood playsets I haven’t cleaned yet but I’m not sure. That’s why she only has one leg in the picture. I can’t body swap this doll, otherwise I would’ve put her on a regular Spectra body. Because of the electronic features, this doll has limited articulation in her neck and like I said, her head cannot come off. All the Ghoul’s Alive dolls have modified and simplified versions of their signature outfits. It’s ok I guess. I’ve never really been a Spectra girlie. This doll is just ok, to be honest. I would like her a lot more if her legs did not constantly fall off.", 

"365": "Ghouls Rule is one of the few Monster High movies I remember because it was the first one I watched when I got really invested in Monster High. It’s basically a racism metaphor that if I’m remembering correctly, is really well written. The movie is kinda dark at times, like I can’t go into detail but there’s a happy ending so it’s ok. At the end of the movie, the four main characters plus Abbey (who’s also a main character but I’d consider her after Lagoona who did not get a doll for some reason) get these fancy new outfits. Clawdeen’s hair also magically turns purple and the sides get shaved. She has a death hawk that honestly slays. Her hair is one of my favorite shades of purple which I love. The majority of the flocking is also that shade of purple but there’s also some animal print. I might have accidentally rubbed part of it off while I was cleaning her. Her outfit also features a ton of faux fur that’s attached to the bodysuit on the arms but not the ankles. The bodysuit is absolutely hideous and I hate it. The gold accents are pretty but they look silly. Her makeup really slays with the purple lip and I like the green molded gloves but I just really hate the bodysuit. The mask isn’t really a mask because it just covers her forehead and nose so it’s not a very good mask. I don’t know where her shoes are at this time, sorry about that. Overall, she’s pretty but far from my favorite.", 

"175": "See Ghouls Rule Clawdeen Wolf for information about Ghouls Rule itself. Mother De Nile looks absolutely gorgina in this outfit. Her dress is so campy I love it. Her cape thing doesn’t really stay on but I still really like it. I did mess up her hair when I was a kid and outside of the style it looks a little silly. I miss the original fabulous bob. I also really like this doll’s makeup, it looks absolutely incredible. The jewelry is really cute and I love the asymmetrical earrings. Sorry you can’t see them. By far, my favorite part of this doll is the shoes because 1 they’re snakes, and 2. They’re those high heels that don’t have a physical heel. Instead there’s this weird shape, I don’t know what it is exactly. I’m pretty sure my doll is a little wonky but I don’t mind. This was the first Monster High doll I got when I first started really focusing on and obsessing over Monster High as my main doll brand of choice. She means a lot to me because of that.", 

"366": "I did not give this doll enough love when I was a kid. Draculaura looks stunning in her Ghouls Rule ensemble. Her facial screening is super unique and I love her makeup. Her outfit is also really really cute. However, I don’t love her ombre tights or her Victorious-core boots. One big outfit piece missing from the picture are Draculaura’s giant bat wings which attach to her back with a harness. Unfortunately, one side of that broke so she can’t wear her wings. I don’t mind though because I think she still looks fantastic. My doll has a weird kind of saran hair that I don’t love the feel of but I know it’ll look so much better once I boil wash it.", 

"338": "Frankie really slayed this one. See Ghouls Rule Clawdeen Wolf for lore information. I love her dress so much and the accessories all look so good together. Usually I prefer gold to silver but here it looks really really nice. Her boots are like Cleo’s shoes sin the way that they’re high heels without any heel which I’m obsessed with. Of course, I would never be able to walk in those shoes but my dolls don’t have to worry about that. An important thing to note is that this doll’s body is supposed to have the chrome silver bolts but mine is on a borrowed body because the neck split on the original one. It was weird because rather than the plastic cracking and snapping, the seem where the two halves meet just split. I tried to fix it with the patching but it didn’t work and I haven’t figured out how to fix it yet.", 

"176": "I Heart Fashion was a Toys R Us exclusive line that featured dolls with two extra full outfits that you were encouraged to mix and match. Initially, the line included core characters (Frankie and Abbey), but later centered on unique minor characters that debuted as San Diego Comic Con exclusives, making the characters more accessible to consumers. Most of the accessories are reused from previous releases, but with painted details because this wasn’t a budget or G2 release. I used to also have the Abbey from this line, but when I first started cleaning my childhood dolls her neck snapped, and I didn’t know how to fix it so I threw her out. I am not a big fan of this Frankie. Her main dress is so ugly to me. The bright yellow looks and feels awful. It's not the right size for her. Speaking of things not being the right size, Frankie’s tie is too short and too wide. It’s sewn on so tying it is thankfully not my responsibility but it’s still not the right size. I’m not a big fan of this doll’s makeup either, it’s too much blue. Her hair is also drenched in glue which makes me mad. She just doesn’t slay at all.", 

"177": "Picture Day was a sort of pseudo signature line, meaning the movies treated these looks as important enough to animate. The actual lore of Picture Day is that the characters are dressed to get their school pictures taken. Each doll came with a little yearbook (well actually it’s a \"fearbook\") the size of the diaries that commonly often come with G1 Monster High dolls. Abbey’s look here is so 2013 it makes me really nostalgic for elementary school. Like this fit is straight out of Justice. For some reason, Abbey only has one earring for some reason but it’s a really pretty and interesting earring. The only thing I don’t really like about this doll is her bangs. I don’t like how they look at all. I think she would look so much better without them.", 

"371": "Cleo was very blue here. See Picture Day Abbey Bominable for more information about Picture Day as a line. Her hair blend is interesting here, I’m not sure if I like it. What I definitely love is her outfit because it’s absolutely fabulous. It’s definitely dated and I would never wear that now but I still think it slays. I also really love the new purse sculpt used for her purse. Also, this Cleo’s shoes are really iconic because from afar they look fairly simple but have a really detailed heel if you look closely.", 

"339": "See Picture Day Abbey Bominable for a description of the line. I’m going to start this with the disclaimer that I can’t recreate her original hair style and I’m sorry about that. Draculaura’s style is very cutesy but I’m not exactly sure what label to use. When I was a kid I really didn’t like it. Now, I’m still not the biggest fan of the top but I really like the skirt. Her headband does not like to stay on which is very much not a slay. I also wish she had heels instead of platforms but I’m not that upset about it.", 

"178": "Spectra is dressed as the absolute epitome of 2012 white girl fashion here. Like I’m surprised she isn’t wearing an infinity scarf. An interesting thing I noticed while fact checking is that this is the only time Spectra wears pants, even though they’re technically just leggings and she’s wearing a skirt on top of it. I don’t think there’s any reason for this but I thought it was interesting. I lost one of her earrings after I cleaned this doll by accident but her hair covers it up so I can tolerate it.", 

"179": "Released as an exclusive to Target, this Clawdeen (as well as the rest of the line) is themed after classic fairytale characters, in this case Little Red Riding Hood. \"Little Dead Riding Wolf\" also came with a purse, which is not pictured because I do not own it. I also do not own the booklet that retells the original fairytale (thank you public domain) with additional werewolf puns. I think this doll is gorgeous and I particularly love the glitter eyeshadow. It’s very unfortunate that she has glue seepage but it’s easily hidden by the cape. The cape does not like staying attached but it cooperates enough if you really need it to.", 

"180": "Scaris: City of Frights was the seventh Monster High movie and it featured the characters going to Scaris (Paris), France as Clawdeen works at a fashion internship. I never watched this movie as a child so I have no memories of it and Jonah said no when I asked him to watch it with me so that’s all the lore you’re getting. Because this was a big line, it featured both slim box and deluxe dolls. The deluxe dolls included new characters that happen to transfer to Monster High at the end of the movie. Skelita is one of those new characters. She’s originally from Hexico (Mexico) and is a skeleton. She has a very unique body that I’m always afraid is going to snap because it’s so thin. The head is a normal Monster High-sized head so it looks a little silly.I love this doll’s outfit because you can remove the skirt and there’s a dress underneath which also slays. I also really love the shoes. Because this is a deluxe doll, she came with a diary and a big suitcase but nothing to put in the suitcase so you’ll have to pretend. Skelita is a very pretty doll but I’m constantly afraid of breaking her.", 

"181": "This doll was released in a 2-pack with her younger sister Howleen. See Sisters Howleen Wolf for more detail. This doll is weird because she doesn’t really fit anywhere. There’s no media featuring this look and the line it’s commonly associated with already has a (much better) Clawdeen. I love the hair and makeup on this doll. Mine has a slight stain on the chin I’m formally asking you to please ignore. I really love the gold makeup and the simple gold jewelry. I honestly don’t really understand the fashion here with this sleeveless dress and one single sock (that I couldn’t find for the picture, sorry) but Clawdeen knows more about women’s fashion than I do. This doll is honestly really overshadowed by her sister but she’s beautiful and deserves her own recognition.", 

"182": "Howleen Wolf was introduced in a 2-pack with her older sister Clawdeen. Interestingly, Clawdeen’s original name was Howleen and Mattel owned the copyright, so it was repurposed for the younger Wolf sister. The 2-pack was sold exclusively at Target and some categorize it as part of the Campus Stroll series but I don’t because Clawdeen already has a doll in that line and characters usually do not make more than one appearance in a single line. Anyway, Howleen got dressed in the dark with her eyes closed because nothing here matches and she looks silly. I hate hate hate this outfit. I really do love the base doll. When I was a child and bought this set, I really wanted any core doll I could find because I missed out on some of the original ones (and the re-releases of Cleo did not meet my standards because budget cuts took some pieces away), so I prioritized this set despite the horrible fit. I believe this is the first Monster High doll to be on the smaller body which is interesting. The smaller bodies indicate the character is younger than the main ghouls. Despite my numerous complaints, I think this doll is absolutely stunning and I love her hair and makeup. I really appreciate that Mattel made a Monster High doll with some sort of textured hair in the early 2010s. It’s a shame they won’t do that for Clawdeen in G3. Anyway, another interesting fact about this doll is that she is the only Howleen appearance where she has orange and yellow hair. During the 13 Wishes movie, she changes her hair to hot pink and it stays that way for the remainder of the franchise. Her signature look is even changed to match that. It’s a bit problematic because Howleen is Black and her new look straightens out her hair. This doll also suffers from the Early Monster High problem where the Velcro on the pants refuses to stay together when you make the doll sit. It’s very annoying. This doll is so pretty and I just wish she wore something less horrible.", 

"357": "Most of the pieces to this doll mysteriously disappeared so she doesn’t look very presentable at this time, and I apologize for that. I don’t love this outfit much because it’s an ugly green but I do appreciate the (nearly) full head of purple hair. For some reason, the bathing suit did not come with any straps but honestly the bathing suit itself is so ugly it should be thrown away. Clawdeen was sold exclusively in the 5-pack, which was a Target exclusive. She’s definitely the worst doll in the set because of her outfit, but I do think her face is very pretty. I also like her shoes a lot but I have no idea where they are at this time.", 

"183": "I love this doll. I love this doll. I love this doll. Cleo De Nile knows how to slay pants and a bob, usually separately but they’re combined here for one of the most fabulous bathing costumes ever. The actual bathing suit is fairly simple gold with the little fascinator on the top, but the cover up pants (which is such an iconic choice) has a gorgina pattern that goes perfectly with her accessories. The worst part of this doll is the bob because for some reason the bangs are green while the rest of the bob is just black. It’s a different shade of green that kinda clashes with the rest of her outfit. Her makeup is so slayful, Cleo always looks good with a gold lip. Unfortunately, this doll was only sold in the 5-pack despite being the best doll in the line.", 

"184": "Unlike the rest of the Skull Shores dolls in my collection, Draculaura was also sold separately. I happened to get the slim boxed doll on sale before my sister and I were given the 5-pack. Interestingly, the two releases have lots of little differences. The most noticeable is the different facial screenings used on each doll. Their faces look drastically different. The single release is a lot prettier. Another interesting difference is the 5-pack version has a pink stripe on the hat headband. I’m aware that nobody cares except me. The sailor theme of this bathing suit is cute but it’s a bit overdone so I’m like meh. I don’t think I’m the target audience for this one.", 

"185": "Frankie Stein is the star of the Escape From Skull Shores movie, where she’s mistaken for her human doppelganger by the definitely offensive caricature inhabitants of the island who worship her. There’s also a new love interest that never does anything of note after the movie so don’t worry about who he is because it literally doesn’t matter. For the single slim box release, Frankie was completely in greyscale and released separately from the other dolls. Mattel intended for this to be a Friday the Thirteenth release but it was a total disaster and she was released a month early. For the 5-pack, rather than rereleasing the greyscale doll, the designers decided to make an exclusive version of Frankie that’s in color. The blues and greens look gorgina on this doll. Of course I don’t know where her wrap or shoes are at this time so she’s not wearing them in the picture. The highlight of this picture is definitely the mug because her makeup looks sooooo stunning. The light blue lip is perfect. Frankie also has a fabulous slightly asymmetrical bob which looks nice but kinda goofy.", 

"340": "See Skultimate Roller Maze Lagoona Blue for more information about the line. I love the green on Frankie here. This shade of green just looks so good on her. I do have her outfit and accessories, but I’m not sure where it is at this time. Also, I broke one of her legs when I was an older child. Monster High dolls are very skinny so their limbs get fragile with play and age. Their joints can snap so easily, which is a huge bummer. I need to get this poor doll a new body so she can actually stand and have all her limbs. For my picture I had to borrow another G1 Frankie to be a body loaner. I used I Heart Fashion Frankie’s extra outfit pieces for this picture. They don’t go well with her makeup in my opinion, but at least they’re themed to the right character.", 

"186": "I have absolutely abysmal balance so the idea of roller skating is the scariest Monster High has ever been for me. This doll, and the entire Skultimate Roller Maze line were associated with the 2012 television special \"Friday Night Frights\" and the 2012 video game \"Skultimate Roller Maze\", where Lagoona wears this ensemble. This line was unique because rather than the standard black stand, each Skultimate Roller Maze doll came with a neon green one. Not pictured but included with the doll are knee pads and a helmet, both the same color as Lagoona’s shoes. The doll also came with a card featuring a close-up illustration of the character. I no longer have this card. Personally, this is my favorite Lagoona doll. I think she looks stunning with that shade of green.", 

"341": "Catty Noir was released as kinda part of 13 Wishes but also as her stand alone thing, and this is her signature outfit so I classified this as her G1 Core doll. Catty is a teenage pop star who (take a wild guess) transfers to Monster High. She’s a black werecat with the most stunning face. Her hands are molded a little weirdly to accommodate the microphone she comes with that I miraculously have not lost yet. I love the long train of her skirt matched with her long hair. The shoes are also really interesting because they’re hard plastic that splits in half and they are that weird kind of heel where there’s no physical heel. I love this doll very very much.", 

"367": "13 Wishes was the 8th Monster High movie and starred Howleen Wolf in her quest to become popular, but it was a whole mess with two genies and probably cultural appropriation. Because this was a huge line there were multiple sub lines and related playsets. For some reason, there was a sub line where Cleo goes to a hot spring and wears a bathing suit. I don’t know why because I’m pretty sure it doesn’t happen in the movie. This doll is uglyyyyy. I have the variant with the bad facial screening. I don’t know where any of her pieces are sorry. Her hair is also very gluey which is frustrating. I wish Cleo got a fabulous gown but Cleo nation did not get lucky this time.",  

"342": "Twyla was introduced in the movie 13 Wishes as Howleen’s best friend. She’s the daughter of the Boogeyman and she’s very shy. Like Howleen, she’s a freshman so to show that she’s younger, she’s on the shorter body. This doll’s outfit is so iconic and slayful that Mattel doesn’t want to let it go. For G2, she has the same signature look, and her G3 Core doll has a very similar ensemble. I used to have this doll complete but while I was cleaning a group of doll accessories, I dropped one of her earrings down the sink so I no longer have it. Very sad. Unfortunately this doll is notorious for her glue seepage, and mine was not spared. That’s why her hair constantly looks horrible. I planned on fixing the glue seepage before taking pictures but Jonah told me to hurry up so I had to postpone it. Just kidding he didn’t say that, but I would’ve deserved it if he did. Twyla is a very special character to me because in G3 she’s canonically autistic and I’m autistic (if you couldn’t tell by after spending any time on this website) so it’s really special to have a doll that I can look at on the shelf and feel so connected to. Of course she’s not currently allowed on the shelf because of the glue but someday she will be.", 

"194": "In the 13 Wishes movie, Lagoona wishes to become a freshwater monster so her boyfriend Gil's parents will accept her. It does not go well obviously and is reversed at the end of the movie but while Lagoona is a freshwater monster she gets a new look. This doll is unique because her skin is a darker blue so she looks less grey. Her hair is also YELLOW rather than blonde. I don’t like this doll’s outfit so much but the jewelry is nice. My doll has really really bad glue seepage, the way it looks in the picture is after two treatments. This doll honestly just gives me a headache with her hair so I’m kinda mad at her right now. This doll was part of the main 13 Wishes line, so it was a pseudo core doll.", 

"187": "The main subline for 13 Wishes was Haunt the Casbah, which featured the main three ghouls plus Abbey (who was sold exclusively at Walmart) while they were trapped in a genie lamp. Don’t ask because I don’t know. It’s Jonah’s fault. Anyway, the dolls in this line feature the genie motif that is definitely cultural appropriation, so I apologize for that. There’s also gold detailing on the doll’s body. Her bolts and stitches are gold instead of the usual matte silver. My doll also has pretty bad glue seepage, which is extra unfortunate for Frankie because sometimes the glue can stain her white hair. I think this doll is really pretty but I feel uncomfortable praising her with the knowledge that the entire theme of the line is potentially offensive.", 

"370": "This is the bigger playset doll from 13 Wishes. It’s essentially a pop-up club where Spectra is a DJ. Speaking of, this Spectra is so stunning and I love her. Interestingly, this is my only Spectra doll with saran hair. I really like this doll’s outfit, it would do so well on Tumblr. This doll looks like she listens to Lana Del Ray and goes to Coachella every year. But she looks gorgeous while she does. I’m such a middle part girlie so I love this doll’s hair. She also slays that purple lip color. This doll is essentially what I thought I wanted to look like in middle school before my emo phase.", 

"188": "See Classroom Ghoulia Yelps to learn about this pack because I’m lazy and don’t want to repeat myself. This doll is so gorgina. She’s one of my favorite Cleos because she has kanekalon hair which always makes me happy. Her outfit is absolutely fabulous and super slayful while also being silly and campy. I love how Monster High incorporates the various monster motifs into fashions. It’s not always successful but I still think it’s fun. I’m missing one of her bracelets because I dropped it on the floor and couldn’t find it but it’s just a simple bangle so it’s whatever. I forgot to mention this in my description for Ghoulia but both dolls have really cute periodic table earrings. I want a pair for myself.", 

"375": "This is my only remaining childhood Ghoulia Yelps doll. Ghoulia is Cleo’s best friend and she’s the smartest character in Monster High, but because she’s a zombie she can’t speak English. Some people have interpreted that as her being non-verbal but that’s not true, she just speaks zombieish. I used to also have Skull Shores Ghoulia but she mysteriously disappeared. I broke one of her legs so my mom probably threw her away. I still have some of her pieces though. Anyway, this doll was released as part of the Classroom 2-packs, as the respective partners are working on some project in class. This set is also called \"Mad Science Lab Partners\" but the wiki considers this set and the other 2-pack a part of the Classroom line. I don’t know where the diary is but I can only assume that Ghoulia is doing all the work while Cleo stands there in her fabulous outfit and looks pretty. Ghoulia is dressed as zombie Miss Frizzle here, it reminds me a lot of Teacher Barbie from 1995. She and her kanekalon hair slay.", 

"189": "Unlike all my other Monster High dolls, Headmistress Bloodgood is an adult so she has an adult body. She is the principal of Monster High in G1. I’m pretty sure she’s only called headmistress because it’s alliterative. In G1, Monster High is a public school. She looks otherwise human but her head can come off because she’s the daughter of the headless horseman. I really liked the idea of a \"human\" looking Monster High doll so I often played with her while she had her head on. That’s probably not the intended way to play with her oops. This doll was a Toys R Us exclusive, but it was originally teased as an option for the San Diego Comic Con exclusive for 2012 but it came in last place for the votes so it got a playline release instead. Bloodgood was sold exclusively with her horse, Nightmare. I did not photograph Nightmare because I consider him and all other doll horses as playsets. If you really want to see my playset collection take it up with Jonah.", 

"190": "Along with Spectra, this doll was a later wave of slim box Dead Tired dolls. Although they have the same box date as the previous wave (the one with Abbey), they were released about a year later. This is my only Robecca doll so I’ll give a brief description of the character here. Robecca Steam is a 19th century robot that’s revived and begins attending Monster High. She has very bad time management skills and is a boomer when it comes to technology. Robecca dolls have really unique bodies because they have textured on bolts and other old machinery. Also, on the backs of her calves, Robecca has gears that you can spin which is such a cool but pointless detail. For her Dead Tired appearance, Robecca wears a cute little ruffled shorts and tank top pajama set. Her makeup is a bit jarring with the bright red lip that I don’t like very much. It just doesn’t go with the outfit at all. However, this doll is redeemed because she has kanekalon hair which is a slay. Not pictured is her cute little phone speaker which is in the shape of a phonograph. Those kinds of speakers are so outdated and useless today but they remind me so much of when I was in middle school so I appreciate it.", 

"374": "See Dead Tired Robecca Steam if you have any confusion about the waves of the series. Spectra is honestly super overshadowed by her bed playset which is a \"floating\" bed. I don’t have that playset but I wish I did because it’s really cool. I do love her makeup a lot, I wish I could pull off purple lipstick. The nightgown is also nice but I’m not obsessed with it. This doll has kanekalon hair which makes me really happy. It’s even better that it’s purple kanekalon so I don’t know why I don’t love this doll more. I guess I just don’t have a lot of childhood memories with this doll so I’m not as attached to her. That being said, I do love this doll and think she’s really beautiful. She’s just a bit forgettable.", 

"377": "I Heart Shoes was a weird line with no associated media that featured the characters shopping for shoes. The name I Heart Shoes is technically a fan term but it’s pretty much universally used by fans so that’s no problem. The shoes and accessories are all reused molds but I don’t mind because I think they’re cohesive with both dolls’ outfits. This doll is quite infamous because of her illustration’s hair proportions. For some unknown reason, Cleo’s hair looks way too big in the official art for this doll. It looks really funny. Cleo’s outfit is interesting because her top is a leotard. Also I really like the little bit of purple in her outfit. It shouldn’t work but it does. Another interesting fact about this doll is that her stock photos features a purse that isn’t in the final release. The accessories are also different colors in the stock photo but that’s very common. These dolls also came with cardboard shopping bags which I’m not a big fan of because I destroyed them as a child. I wish they were made of a more durable material.", 

"191": "See I Heart Shoes Cleo De Nile for all the boring objective information. I don’t think it’s boring but I assume most people do. Anyway, Draculaura is cosplaying as girlboss Sherlock Holmes here and she did a fantastic job. For some reason, Draculaura has Mickey Mouse gloves molded on her hands. I’m not sure when these gloves made other appearances but I doubt they were a new mold made especially for this release full of recolors. I do have the little shawl thing but the Velcro doesn’t work anymore because I took it off so much. I really like the fabulous businesswoman skirt here, it makes Draculaura look so gorgina. I also love the yellow tank top because Draculaura just looks so good in yellow. I get that the pink girlies eat up Draculaura’s normal color scheme, and I do that with the purple Rainbow High dolls (mostly), I really like when there’s a slight change to the characters’ color schemes. Especially this case. She just slays so hard.", 

"192": "See Scaremester Jinafire Long for an explanation of the Scaremester line. Catrine was originally introduced in the movie Scaris: City of Frights. She is a French artist that eventually moves to the United States and attends Monster High. Catrine is one of the many many werecats in Monster High. She is the only completely white cat though. She has a beauty mark (that’s what the wiki calls it) under her eye which reminds me of Yasmin from Bratz. Catrine is very beautiful but despite the purple (which I still appreciate), her aesthetic is not really my thing. I’m don’t dislike it at all, I don’t have any complaints but it’s just not my vibe. Sadly, my doll has some glue seepage that got worse after I washed her so I’ll have to take care of that soon. Catrine made a couple more appearances after this doll, with some interesting appearances, but I can’t say she made much of an impact on me as a child.", 

"343": "The Scaremester line was sort of a pseudo-signature line for characters that were introduced in various Monster High movies. Clawdeen was also there for some reason. However, their Scaremester looks were not the default cartoon looks the characters had in the G1 media. The dolls came with diaries and school-related accessories to really emphasize the theme. Jinafire Long was initially introduced in the Scaris: City of Frights line. I no longer have the body for this doll because her neck broke when I was a child. As you can see, this is the only Jinafire doll I own so she cannot borrow one of her sisters’ bodies for the picture. I would just buy a new body but due to the doll collector bubble at the time of writing this, I cannot justify spending $15 on a naked doll body plus $20 for the forearms and hands. I don’t even like this doll that much. I still have her outfit so this could have been a much more tragic situation. The original body is textured to mimic scales and I apologize that you cannot see that on the borrowed body. Like I said, this doll is just ok. She has nice saran hair but it’s sticky from the leaky glue. I think she has a beautiful face but providing for this doll has been such a headache. Being a father is such hard work", 

"193": "Swim Class is actually a fan name for this slim box line. The packaging doesn’t feature a name for the line so fans just make up their own names. When I was a kid who watched Monster High doll reviews on YouTube, I picked up the name Swim Class so that’s the name I always associate with this line. Another big one was Beach Beasties. A lot of people were not happy with this name Swim Class because there’s no indication, whether it be media or information on the box, that indicates the ghouls are taking a class. I don’t think it’s that serious but I’m still going to exclusively use the name Swim Class because this is my website. If the characters are taking swimming lessons, then that’s very silly because Lagoona is a sea monster. She knows how to swim. Regardless, I think this is one of the prettiest Lagoona dolls in my collection. Though I seem to say that about most of my Lagoona dolls. Her bathing suit does give me the ick though with the weird sleeve but that’s 100% a me issue. My doll has quite a bit of glue seepage but it’s mostly in the back.", 

"376": "See Swim Class Lagooona Blue for more information about the line and the related drama. Venus is the irritating environmentalist character in Monster High. She’s a plant monster with an eco alt aesthetic. I’m not sure if that’s a real thing but that’s what she’s giving. Venus dolls are unique because she has a half-shaved head, so all of her dolls have hot pink flocking on one side of their heads. Interestingly, the shaved side changes depending on the doll. This is my only Venus doll at this time, so she was really special to me when I was a kid, even though she was my sister’s doll. I like her bathing suit a lot more than Lagoonas. I also really love her kanekalon green hair, it looks very pretty. I’m not sure what the logistics are for a plant monster to go swimming but I shouldn’t think too much about it.", 

"379": "Frights Camera Action! Was the movie where the Monster High characters travel to Los Angeles and I’m not sure what happens because Jonah wouldn’t watch it with me. The Black Carpet sub line featured slim box dolls of most of the main characters. Their outfits are meant to be what the characters wear at a movie premiere. Clawdeen absolutely slays this look. This is probably one of my favorite Clawdeen dolls. Everything about her is perfect. I love love love her dress and her hair looks so good. Her makeup slays, I really love the pop of green eye shadow.", 

"378": "See Frights Camera Action! Black Carpet Clawdeen Wolf for information about the lore of this line. This Cleo absolutely slays, I love her very much. Her dress is absolutely stunning and works perfectly with her makeup. I mean look at this gorgina queen. My only complaint is that her head piece does not stay on without the evil plastic t ties but that’s to be expected with most head pieces. This doll is sooooooooo mother.", 

"461": "Viperine was one of the new characters introduced in \"Frights Camera Action!\". The Hauntlywood subline was the main release and featured additional accessories. Viperine is a makeup artist from Spain that works closely with Elissabat, who is a famous actress apparently. I wouldn’t know because a very rude person refused to watch the movie with me. Viperine is Deuce Gorgon’s cousin but I don’t think they interact much do to the fact that she lives in Spain and is employed. I got this doll secondhand so I’m missing most of her pieces. I’m missing her sunglasses, headband, long plastic snakes, and makeup case unfortunately. My doll has gorgeous Farrah Fawcett hair that luckily does not have any glue seepage at this time because it’s very soft. Viperine dresses like a Disney Channel star but the colors look really nice together.", 

"380": "Power Ghouls was a Target exclusive line that featured some of the characters in superhero personas. This line was sold exclusively at Target and released in two waves of two dolls each. Clawdeen was released as part of the first wave as Wonder Wolf, who is probably a Wonder Woman parody. I’m not entirely sure because I couldn’t be bothered to read the included comic book. I don’t care about superheroes. This doll has really cool accessories and clothing but I just don’t care at all about superheroes so I find this doll meh. She’s beautiful though.", 

"460": "See Power Ghouls Clawdeen Wolf for more details about the line. I’m not repeating myself. Spectra is Polterghoul, some sort of ghost superhero. I got this doll used so I don’t have a physical copy of the comic book but I wouldn’t read it anyway because Jonah is a big meanie who wouldn’t watch any of the Monster High movies with me so I refuse to do it myself. I don’t know what kind of superhero Spectra is parodying here; please do not tell me, I do not care. Like I said, I got her secondhand, so I’m missing her headband. My doll also has glue seepage, which is unusual for a doll with kanekalon hair. I’m choosing to ignore it for right now. My favorite part of this doll is her eye makeup because it’s really unique and interesting. I also really like her weird chain wings/jewelry thing. I don’t know what it is exactly but it slays. This is one of my favorite Spectra dolls in my collection.", 

"381": "Inner Monster was a sort of spiritual successor to the Create-A-Monster line, which allowed consumers to customize and rearrange various monsters. These monsters did not have names or personalities, the whole point was for the child playing with them to come up with that on their own. Originally, my Create-A-Monster dolls were included on this website until I remembered that many of them did not come with complete bodies so they were missing too many parts for me to include. This is before even considering the fact that I probably lost many of the parts as a child. In 2014, Inner Monster was launched. Inner Monster had similar customization features but the options were more physical pieces rather than temporary tattoos. For example, there were face plates to give various elaborate makeup looks and there were tiny pieces that could be inserted onto the dolls’ skeleton torsos (similar to Skelita Calaveras). So the dolls can wear regular Monster High clothes and to protect the tiny pieces, there’s an opaque shell that attaches to the torso. Probably the most notable thing about these dolls is the eye gimmick. If you press the brain button on the top of their heads, the dolls’ eyes change. There’s three options each. I believe this concept might have been made for the purpose of helping kids who were non-verbal but I have no evidence of that. It could also be helpful for any child that has trouble expressing their feelings, but that’s something I’ve never had a problem with so I have no idea. Anyway, this set was a \"starter pack\" that featured a doll with a full outfit and various accessories. I don’t know where her wig is but I thought it would be better to show the brain sculpt anyway. This character appears to be some sort of fire elemental but it’s left very ambiguous. For whatever reason, this doll’s outfit has some plastic elements to it, which is not very pleasant sensory-wise but it looks cool. I really like the silhouette though. These kinds of dolls are not really my thing but I think they’re still really cool and interesting.", 

"382": "See Inner Monster Fangtastic Love & Firefully Feisty for an explanation of these dolls. This doll is some sort of squid or swamp monster, which slays. I love the orange ombre of her ekin color. Unfortunately, I couldn’t find her top when I took the picture but I used one of the Inner Monster fashion packs for the dress. I like this dress more than the original one but that’s probably because of my weird asymmetry aversion. It’s a shame this sub line didn’t take off because I think it has an interesting gimmick and could’ve gone further.",  

"195": "Freaky Fusion was one of the last Monster High movies I cared about. The doll line was huge so it was pretty unavoidable. Does that mean I could tell you anything about the movie? Absolutely not. All I know is that the Hybrids and the fusion is a thinly veiled metaphor for being mixed race. The Hybrids subline featured new characters that have two vastly different monster parents. This doll is the daughter of a centaur and a harpy. It seems like the centaur had the dominant genes here because other than some feather textures on her forearms and some wings I lost, this doll is all centaur. Avea has a stereotypical horse personality of being stubborn. She and the other hybrid characters seem to move schools a lot because of totally-not-racism. Avea has a unique body to accommodate the centaur features, and since she can’t sit like a traditional Monster High doll, she has an additional chest joint which later became the standard in G3. I think this doll is really pretty and unique, I love the way her ears are sculpted and her makeup is sooo slayful. Unfortunately, like the other Hybrids characters, this is Avea’s only appearance. She was essentially just a gimmick and not treated like a real character. I get that she’s not very versatile for play but if Mattel put all the time into the mold you’d think they’d give the character more love and attention. But what do I know. This doll unfortunately has a bit of glue seepage but I forgive her because her hair is such a pretty color.", 

"196": "See Freaky Fusion Hybrids Avea Trotter for an explanation of the line and the whole Hybrids gimmick. Sirena is the daughter of a mermaid and a ghost, I wonder if that differs from the ghost of a mermaid but I probably shouldn’t think too much about it. When these dolls were first released, Sirena was the stand out for me even though Avea was a whole horse (well half a horse, or maybe it’s a quarter horse if she’s only half centaur). I thought Sirena was so beautiful but also really unique. I love love love her hair and her face. I love the inky look of her limbs, it makes me think that she’s a ghost in smoky waters. This was the first Monster High doll with a tail which I also thought was really cool. This doll really deserves more love because she’s so beautiful. I did lose her stud earring but you wouldn’t be able to see it anyway.", 

"344": "Freaky Fusion was one of those large movie lines where there were lots of sub lines. This sub line was just this Frankie doll with the playset. In the movie, Frankie has to be revived with this recharge chamber which is a weird premise for a playset but I choose not to think about it. This is one of my all-time favorite Frankie dolls because I love this shade of blue on her, especially combined with the yellow shoes that I can’t find at this time. This doll has kanekalon hair, and the static electricity or something with the playset makes it stick up which looks really cool. I took the batteries out of my playset and I don’t know where the base is anyway so it won’t stand up but I had a lot of fun playing with this doll as a child. My one complaint is that her dress is a bit cheap but she’s otherwise lovely. She has a special body where the stitches are blue but I have no idea why that is.", 

"197": "Toralei Stripe is one of the recurring villains in Monster High in the sense that she’s their peer who has beef with everyone because she loves the attention. Toralei is a werecat (like a werewolf but with a cat instead of a dog) whose only friends are Purrsephone and Meowlody, who other werecats that mainly just exist to participate in her schemes. I didn’t care that much for her as a kid, so this is the only G1 Toralei I ended up with. It was probably my sister’s but I don’t remember. The premise of Freaky Field Trip is that the ghouls go on a different field trip each. That’s usually not how field trips work but ok. Toralei goes to an aquarium and it’s implied by her accessories that she either eats some of the fish in the tanks or they sell the fish from the tanks in the gift shop or restaurant but I don’t know. This doll has weird printed stripes stamped into her hair which has completely worn off mine. I thought it was dirt so I scrubbed it out. It was messed up anyway so I’m not bothered. For some reason, Toralei has a green streak in her obnoxious bob but I like green on Toralei. It’s one of those color combinations that you wouldn’t think works but it does. The dress is very simple but it’s cute. The shoes are also really nice but honestly pretty forgettable.", 

"198": "This Cleo is serving bob and executive realness and she slays. She’s the social chair of the student council which makes a lot of sense for her character. This is a very simple doll with reused accessory molds, but it just looks so good. I love the collar because it gives such a nice extra touch and I love the red highlights in her accessories and hair tinsel. This is also the shortest bob I’ve seen on a Cleo and she looks sooooooooo slayful.", 

"345": "For a long time, Gilda Goldstag was a background character in the Monster High cartoons, and this 5-pack was her first appearance. So, this doll actually features her signature, or core outfit, which is bad. Gilda is a Ceryneian Hind, which is a type of deer monster. I don’t know what this means specifically. This doll has a pixie cut, so I’m surprised I didn’t like her that much as a kid. Her horns kinda get in the way of her hair though so maybe that had something to do with it. It’s also very likely that I was put off by her horrible boring outfit. She also has no personality in the series so I don’t care about her at all. Apparently she is the treasurer on the student council. I do like her face mold though, minus the horns, it looks cute. If only the horns didn’t get into the way and she wasn’t so boring.", 

"385": "As the vice-president of the student council, Lagoona’s job is to serve lewks and she’s very good at that job. This Lagoona is absolutely gorgina and slays with the purple lipstick. The dress is giving 2009 teenage art girlie but she hemmed the dress to be more college. I’’m not sure where her necklace went and at the time of taking pictures I could only find one shoe but the shoe is just a recycled wedge mold so you’re not missing much. I don’t appreciate Lagoona’s beauty enough and I deeply apologize for that.", 

"199": "Scarah Screams is one of the background-ish characters that debuted in doll form at San Diego Comic Con. In this release, she is festured as the secretary of the student disembody council. This doll (along with Cleo and Lagoona in this 5-pack) is very simple but so beautiful. Her makeup looks absolutely gorgeous. Her dress is patterned with screaming faces which represents her monster identity as a banshee. Scarah has an Irish accent but for some reason I misremembered her as Scottish. It doesn’t matter though. This doll unfortunately has the worst glue seepage I’ve ever seen. I’ve already done three treatments with the oxyclean and she’s still gross. It’s looking a bit better but I’m still mad about it. This doll deserves a head of hair that isn’t leaking glue.", 

"384": "Slo Mo is Ghoulia’s boyfriend, and he is also a zombie, but he is a more stereotypical zombie than Ghoulia is. He is stupid and his only personality trait is loving Ghoulia. Insert joke about being the best kind of man here. As part of the student disembody council, Slo Mo wears 2015 Youtuber white boy couture. It’s just purple pants and a tee shirt. I don’t know what you want me to describe here, there’s nothing interesting. Somehow he’s the president of the student council. Sure, Jan. This is the second Slo Mo doll that was released, the first being a part of the slim box Ghoul Spirit line from G1 (obviously). He later would appear in the Love’s Not Dead 2-pack with Ghoulia. He’s boring but he isn’t awful like Lagoona’s boyfriend Gil,", 

"462": "This is my first G2 Monster High doll. In 2016, Monster High was rebooted because the brand was failing. The narrative changed, making Frankie and Draculaura create a new high school for monsters ran by Draculaura’s father Dracula and the ghouls going on adventures to find and rescue other teenage monsters in hiding. It was cute I guess but pretty mid. The dolls also got a face lift. The facial screenings were changed to make the dolls look younger and cuter. This was not received well. Interstingly, this reboot was a year after the infamous 2015 Bratz reboot which took a similar route to similar levels of flop. The doll bodies were also altered, giving them slightly thicker limbs and torsos but retaining their original lordosis shape. Each character received new molded on features to emphasize their monster identity. Draculaura did not need any changes because she’s a vampire. The biggest problem with G2 of Monster High is that many of the dolls, especially the budget dolls lacked the detailed articulation that was universal among G1 dolls. Losing the articulation was a huge disappointment and extremely noticeable. The clothes also became a lot lazier and cheaper, often lacking hems and featuring the trademark modern Mattel printed on textures. Shriekwrecked was one of the bigger lines and featured a couple of sub-lines, such as the Nautical Ghouls line Draculaura is from. The story confused me because apparently it was scrapped but there’s some stop motion. You know why I haven’t investigated further (Jonah’s fault). I got this doll used so she is missing most of her pieces, including her shoes but I don’t mind that much. I really wanted to experience a G2 deluxe doll to see how the brand changed when they bothered to put effort into it. Draculaura has the same articulation as the G1 dolls but for some reason her arms are painted, I’m guessing to simulate gloves. This has happened in G1 but it was more obviously gloves then. I prefer the G1 facial screenings but this Draculaura is still very pretty.", 

"200": "Boo York Boo York was Monster High’s first \"musical\". It involves the characters visiting Boo York City and an arranged marriage. To be honest I haven’t seen it yet. We’ll see if I can convince Jonah to watch it with me. Anyway, Mouscedes is one of the characters introduced in this film. She’s the daughter of the Rat King who must’ve been inspired by Squidward when naming his daughter. She appears to be a socialite with lots of connections in the city. Despite all these connections, Mouscedes does not have a stylist or any friends close enough to tell her how horrible her outfits are. This doll isn’t the worst; the other Mouscedes doll from the Boo York Boo York City Ghouls subline is much worse. Another problem with this doll is that she always looks wonky because her facial screening makes her look in two opposite directions. I think that this can look beautiful but did not translate well on a Monster High G1 doll. I hope this is redone in G3 and translates better. My doll is missing her crown, belt, and tail. Her shoulder piece never stays on so I did not bother to include it in the picture. This doll is very unique but I feel like she fits better in Ever After High.", 

"201": "Great Scarrier Reef was the last movie in G1 of Monster High. I have not seen it but I heard it was awful. Perri and Pearl were introduced in this movie and they are the daughters of the Hydra. This doll portrays conjoined twins in a unique and creative way which I appreciate but I’m not sure if this is represented respectfully in the Monster High Media. I got this doll used so I am missing their necklace, belt, and diary. I am continuing my refusal to watch doll media without Jonah for the duration of this project so I cannot find out at the time of writing this. Because this doll does not have legs, her clothing options are limited which I understand, but their top is very ugly and early 2010s and I don’t like it. I’m sure it looks better with the jewelry but I don’t have that luxury. Despite this, I think this doll is very beautiful I am so so glad I bought them. This was the first Monster High doll I bought second hand, and I got them for a couple dollars alongside my 2002 Birthstone Collection Amethyst Barbie.",  

"202": "In 2021, Mattel noticed the wave of Gen Z Monster High nostalgia as well as the success of MGA’s Bratz reproduction line so they decided to release their own small line of reproductions of four of the original Core ghouls. However, Mattel also forgot to produce more than five of them so they sold out quickly and never restocked. I was so lucky to catch the Clawdeen and Frankie dolls on a small online restock. It’s funny how that worked out because Clawdeen and Frankie were the two dolls of the four rereleased that I also had as a child. This Clawdeen is both a faithful recreation of the original while somehow also being a million times better. I can’t compare 1-to-1 because I lost most of the parts to my original doll but the reproduction has so many quality of life improvements. First of all, the legs are no longer strung so Clawdeen can sit and stand on her own, and her arm joints are more secure so her forearms don’t constantly fall out. Also, Clawdeen’s hair (which is still saran, thankfully) is slightly longer and has no glue. This doll is absolutely gorgeous and if I wasn’t struggling to find space on my doll shelves, she would be prominent in the (currently non-existing) Monster High Section. Unfortunately, there is a small stain on her face from contact with something in storage but it’s hard to see in the picture. I’m still bitter there was no Cleo reproduction in this line but I am still very happy with this Clawdeen.",  

"203": "See Boo-Riginal Clawdeen Wolf for an explanation of the Creeproduction dolls. I really appreciate having this reproduction because my childhood doll is not in the best shape and I didn’t play with her much as a child because she was my sister’s doll. Frankie’s signature G1 look was never my favorite because I always thought the tie looked silly but she’s grown on me as I’ve gotten older. I love her accessories, especially the purse. It reminds me so much of my childhood, both the kids play purses I had as a child but also that style was popular at the time. It’s so 2008. Obviously, the purse is solid plastic but I always thought that if it was real, the purse would feel really nice and foamy. I’m pretty sure my doll is wonky but honestly I don’t care at all because the sentimental value is so strong. I used to keep her on display but I unfortunately do not have the space for her anymore. I hope that can change in the future.", 

"204": "This doll is so boring compared to the Frankie he was sold with. He’s literally just Ken. This was the first male G3 doll I got, and I honestly only got this set for Frankie. I do appreciate the changes from the previous iterations of Deuce but I really don’t like how his snake mohawk is swept to the side. This is not because of my weird asymmetry phobia. Rather, the way the mold is shaped makes his sunglasses sit weirdly on his face. As a gorgon, Deuce is supposed to wear sunglasses all the time so he looks perpetually silly on display. In this set, Deuce is working at the Coffin Bean as a barista while Frankie is picking up their order. Deuce is dressed horribly. Why are his sleeves mesh? Why is he wearing neon yellow sneakers? And why do they have wings? His pants are also atrocious. I hope he got dressed in the dark because I can’t imagine wearing this outfit on purpose.", 

"205": "SLAYYYYYYYYYYYYYYYYYYYY> This doll is so so good. They blow their G3 core doll completely out of the water. For a start, they have a side glance which gives them a million slay points from me. Their makeup looks absolutely stunning. I used to do asymmetrical makeup a lot more when I was in high school but I haven’t appreciated it much as an adult. I know, it doesn’t make sense it’s just my autistic little brain. Anyway, Once again, Frankie’s fit is super stereotypical non-binary and I absolutely love it. It’s giving Vivienne Westwood on the top and the biker shorts are so chic. I also really love the asymmetrical boots, although I definitely wouldn’t have as a child. I actually like the asymmetry here because the shorter boot showcases Frankie’s prosthetic leg rather than hiding it. I think that’s really slayful. The boots don’t look like they’d match but I still think it works. My sole complaint for this doll is that their belt is reused from their core release which is pretty lazy so early on. It still works in both releases but it’s just a little disappointing.", 

"208": "In G3 of Monster High, Clawdeen is the main character. At the start of the cartoon, Clawdeen is a human that discovers that she is half werewolf. She then finds out about Monster High and starts attending. I haven’t watched much of the G3 cartoon and Jonah won’t watch it with me so I’m not going to watch any more for the duration of this project. Because she is a werewolf, Clawdeen’s ears are on the top of her head. This wasn’t a problem in previous generations but in G3 Clawdeen wears glasses so there’s an obvious problem. To accommodate this, Clawdeen’s face mold features molded-on tufts of fur to hold up her glasses. Unfortunately, the glasses that came with this doll are bulky and goofy looking with their think lens-less frames. It reminds me of the weird 2010 trend of taking movie theater 3D glasses home and popping the lenses out to wear as a fashion statement. Speaking of fashion, this doll’s outfit is atrocious. I do appreciate the purple, but I despise overalls and the fur vest is a sensory yuck. The worst part of this doll is that she and the majority of G3 Clawdeens at the time of writing have polypropylene hair. I don’t understand why Mattel couldn’t be bothered to give the MAIN CHARACTER saran hair. It honestly feels racist because Clawndeen is Black (specifically Afro-Latina). I know I’ve complained a lot about poly before but I can’t remember if I ever explained why it’s so bad. I’ve written so many of these descriptions at this point that I can’t remember. Polypropylene is the cheapest, driest fiber of plastic used for doll hair. No matter what, poly hair will frizz. This is exacerbated with play. It also decays significantly faster than the other fibers. On a pettier note, poly feels horrible because it’s so dry and plastic-y. Polypropylene is very cheap, so it’s understandable for smaller companies to use it early on (but I will still give it the side eye). Mattel is one of the biggest toy companies in the world so Monster High using polypropylene on their core doll releases is honestly unacceptable.", 

"206": "The G3 version of Cleo De Nile is very relatable. She is super dramatic and a total girlfailure. She’s also gorgeous and in my opinion Cleo is always the best doll in every line. To be honest, I haven’t watched much of the G3 cartoon because I have a short attention span and I don’t have a lot of time to watch Nickelodeon. G3’s version of Cleo is pansexual and dates Frankie. They are very cute together. Cleo will always be my favorite Monster High character but that doesn’t stop me from complaining about this doll. She commits the biggest sin of having polypropylene hair, although it’s in a blend with saran and tinsel so it could be worse. Also, the dress this doll comes wearing is hideous and horrible quality. It feels like a disposable tablecloth you get at the dollar store. It’s also ugly. For whatever reason, this is not the outfit she wears in the cartoon unlike the rest of the signature dolls. Apparently kids (with poor taste, might I add) preferred Cleo in a dress rather than pants. Not very slay. I love this doll’s face, her makeup is stunning. Another thing about Cleo I love is that her G3 body features mummy wrap textures that were introduced in G2 but the G3 doll has a curvier body that’s just more aesthetically pleasing and (ironically for a monster doll) more realistic. Gideon said the G1 dolls looked like they had a specific disease I forgot the name of because of the weird way their backs are curved. I’ll try to remember to ask him what it was. Anyway, this doll slays but has some bad quality of life problems.", 

"207": "I feel like discussion of this doll is super mainstream at this point so I’m not going to spend too much time talking about the objective stuff about this doll. Instead I’m going to be sentimental and emotional. Draculaura’s signature doll for G3 is absolutely perfect; I have absolutely no criticism of her. I think she’s absolutely adorable and I love her. This doll means a lot to me not because of Draculaura as a character, but because of the memories I associate with her. There is absolutely no way he remembers this, but I had this doll with me when I met Jonah for the first time so I always think of him when I see her (which is very weird because they bear absolutely zero physical similarities). I definitely met other people at the same time, but they aren’t as important (that was a joke). Sometimes I bring dolls places to use as fidget toys or just general appeasement for my silly goofy anxiety, and I happened to bring this Draculaura with me that day. Obviously, I am very grateful that this happened because Jonah is a wonderful friend who dedicated so much time to indulging in my special interest and making this website.",  

"346": "Ghoulia’s signature doll for Generation 3 of Monster High was sold exclusively at Target. She seems to be a skateboarding gamer girl. Unlike Clawdeen, her glasses have frames, I’m guessing this is because her glasses are much smaller than Clawdeens, but it makes Ghoulia’s eyes look foggy. Honestly, I don’t mind that much because Ghoulia’s G3 face is a bit ugly. I think it’s mostly the eyebrows but it’s very unfortunate. I also hate this doll’s skirt with the horrible plastic non-moving zipper on the side. It looks horrible. It’s a shame because I really like this doll’s jacket and her accessories include lots of cute callbacks to G1 (the most prominent being the Dead Fast cartoon on the back of her skateboard) which is really nice. Another interesting thing about this doll is that she and Frankie appear to have swapped skin tones. The original Ghoulia has a greyish-blue skin tone and Frankie had a mint green but the G3 versions have them flipped. I’ve heard things about copyright issues with Frankie, but I don’t know for certain. I think this doll could have looked so much better so I can’t lie and say I’m not disappointed but there are still many redeeming qualities to this specific Ghoulia.", 

"347": "I think this is one of the most culturally important dolls in my collection. For the third generation of Monster High, it was announced that Frankie Stein, one of the main characters, was non-binary and used they/them pronouns. They are also visibly disabled as they have a prosthetic leg. G3 Frankie’s signature outfit is undoubtedly an updated version of their G1 counterpart. They still wear lots of plaid and the look is still best described as preppy, but it no longer screams 2009. Frankie now wears wedge sneakers which unbalanced girlies like me appreciate. They have also doodled on their prosthetic leg which I find adorable, but I can tell it will wear off over time. The only thing I really don’t like about this doll is that their eyebrow piercing is printed on rather than molded because dolls in G1 had molded on eyebrow piercings. This doll was an amazing introduction to the first non-binary lesbian character in the Monster High universe.", 

"209": "For the thirds generation of Monster High, none of the characters strayed far from their original designs with the exception of Lagoona Blue. She received a drastic new look and her ethnicity was switched from Australian to Honduran. There was a bit of controversy from locals because Lagoona’s skin color was changed from blue to pink. There was little to no outcry for Frankie or Ghoulia’s new skin tones but their changes were more subtle so I’m guessing people didn’t notice. To be honest, I’ve never felt connected to Lagoona as a character because there is not an ounce of athleticism in my body. However, I have always thought Lagoona was exceptionally beautiful, so I love the new Lagoona. Her face card never declines. The paint on her calves commonly chips which is annoying but I don’t mind that much. Her hair blend is extremely beautiful and the colors look really nice together. I am so thankful it’s saran because I would be very grumpy if it was polypropylene.", 

"348": "This doll was released as the Walmart exclusive of the initial launch of G3. She features a similar face mold tuft mechanic as G3 Clawdeen so see her core doll for more information about that. Toralei Stripe is kinda the peer antagonist in both G1 and G3. What sets her apart in G3 is that Toralei is British and the lead singer of a rock band called \"The Hissfits\". I can’t tell you what their music is like (you know why) but I’m guessing it’s a kid-friendly riot girl vibe. In the cartoon, Toralei has a bob. I don’t know why it was changed for the doll. Another interesting mystery is that Toralei is packaged in G3 as just \"Toralei\", no last name. However, I categorized her with her last name to be consistent with G1 Toralei and to make Jonah a little less confused. We decided to consider the different iterations different characters (as you can see with our pronoun usage for Frankie Stein), but I figured that having a slightly different name would make things even more confusing. This doll reminds me of Gideon because he’s also a redhead and (unlike me) he still has a British accent. You can probably tell from his British spelling. Personality-wise the two have nothing in common because Gideon is the kindest most considerate wonderful friend and Toralei is awful.", 

"400": "As a Walmart exclusive, Ghouls Spirit was released as a 6-pack that featured various characters at some kind of sports event, presumably a basketball (\"casketball\") game. Clawdeen is the only doll here actually playing a sport, as she is a basketball player. She’s also the only doll in the set to be rooted with polypropylene. You know how I feel about that. I don’t know why, but Clawdeen also has a knee brace. I don’t think that’s ever explained. This doll has an ugly outfit, and I’m not just saying that because I have no interest in sports. The weird fur shoulder pads(?) look silly and are the wrong shade of orange. At least her glasses have lenses this time, but they have the same foggy look as Ghoulia. Presumably this pair is in sports mode. Although you can’t see it with her glasses on, this doll has a beautiful face and looks adorable with her freckles. I also really like her shoes. This doll could’ve been so much better if a little effort was put into her.", 

"401": "See Ghoul Spirit Clawdeen Wolf for an explanation of this release. At this sports event, Cleo is spectating with her partner Frankie. I’m not sure if they’re dating yet when this pack is set but I’m going to assume it is. Cleo is cheering Clawdeen on, as her outfit prominently features Clawdeen’s team number. Cleo’s dress reminds me of the modern Barbie Fashionistas because it has the horrible plastic-y material on the front and Mattel couldn’t have been bothered to continue the design on the back. Her jacket has a similar problem but I must say it is higher quality. Cleo also came wearing a headband that does not like to stay on but I did cut off the plastic t ties so it will stay on if you leave them. Outside of her clothes, this Cleo slays. I love her makeup but apparently that’s an unpopular opinion. Also, at the time of writing this, this is the only Cleo to have fully saran hair and it feels so so soft I love it so much. It’s a really beautiful shade of dark blue. Her shoes are also very cute but could’ve included more painted details. As a Cleo girlie, this is definitely my favorite doll in the set. I like displaying her with Frankie because they look super cute together.", 

"405": "Well. I don’t know what you want me to say about this one. See Ghoul Spirit Clawdeen Wolf for an explanation of the Ghouls Spirit set. Deuce is the school mascot, so rather than sunglasses he comes with a Skullette mask. It looks ridiculous. Probably the most interesting thing about this doll is that he has a little bit of face paint, but it’s for sports reasons boooo. You can’t even see it under the mask so what’s the point? Something that would also be interesting if it was unique within the pack is that Deuce’s socks are molded-on as a part of his shoes. Draculaura’s are too so who cares. Deuce’s shorts are the same cheap rough material as Draculaura’s fearleading uniform. The shirt is the same thin, printed cotton-y fabric. He’s just so blah and lazy. If this wasn’t a 6-pack, I wouldn’t have this doll. He’s definitely the worst in the set.", 

"402": "See Ghoul Spirit Clawdeen Wolf for an explanation of the 6-pack. Along with Toralei, Draculaura is cheerleading (\"fearleading\") at Clawdeen’s casketball game. Unlike Toralei, Draculaura’s uniform is a dress but it’s the horrible cheap picnic cloth fabric. Its design is cute but very plain. Unlike her core doll, this doll’s hair blend mixes the black and pink just like G1 Draculaura. It makes me a bit nostalgic I must say. I also really like her hair accessory. As I briefly mentioned with the Deuce in this pack, Draculaura’s socks are molded-on as part of her shoes. It’s very lazy considering they didn’t bother to paint the socks, so it just looks like the shoes are one solid strange shape. This doll also came with the most bizarre plastic pom-poms that are only half a pom-pom each and are so heavy that they don’t like to stay on her hands. My doll is slightly wonky, but considering this is a 6-pack and I got it online, I’m not complaining that much. If I’m being honest, I bought the set for Cleo so it doesn’t matter anyway.", 

"404": "See Ghoul Spirit Clawdeen Wolf for an explanation of Ghoul Spirit. Frankie is spectating with their girlfriend and cheering on their best friend during Clawdeen’s casketball game. This doll slays so hard. Their makeup is gorgina and combined with the half-shaved head reminds me of Kate McKinnon’s later look as Weird Barbie in the Barbie movie. This doll was released nearly a year before the movie so I’m not sure which one came first, but they’re both Mattel designs so it doesn’t really matter. Speaking of their hair, the unshaved side is a lovely shoulder length otherwise bob with very soft saran. The shaved side is interesting because the texture is molded on rather than flocked. The haircut is emphasized by the asymmetrical jewelry, as this Frankie has only one earring on the shaved side. The shoes are a little odd because they look like Frankie stepped in two blobs of Jell-O but they do have some details if you look closely. For me, the outfit is the highlight of this doll because it is so non-binary couture. It does have the problem of the printed on design on the sweatshirt but I forgive it because it slays so hard. If I wasn’t a Cleo stan, this would be my favorite doll in the set.",  

"403": "See Ghoul Spirit Clawdeen Wolf for an explanation of this pack. Along with Draculaura, Toralei is cheerleading (well \"fearleading\"), but the two have personalized uniforms. Toralei’s entire fit and aura makes her look like she would bully me. She isn’t dressed like the people who bullied me in middle school because this fashion style didn’t become popular until I was in late high school but she’s still giving the vibe. She also looks like how Americans think British girls dress. The fabric of Toralei’s outfit feels very cheap and thin; it’s giving plastic tablecloth with a matte finish if that makes sense. The printed design is cute but doesn’t make up for the cheap quality. The top isn’t hemmed which is a huge disappointment because it’s inevitably going to frey over time but this doll was released in a 6-pack so I can’t complain too much. This doll’s makeup does not match her outfit in the slightest with the green eyeshadow but I love it very much because I adore heavy eyeshadow under the eye. It’s my favorite step when I put makeup on myself. The yellow socks also feel out of place but they are an eye sore. This doll does not remind me of Gideon like the other one because there’s just too much mean girl energy.",

"210": "While being part of the Creepover Party line, this doll also doubles as Twyla’s signature doll. She comes with sleepover accessories but also signature pieces such as a sleep mask and a book (Twyla’s special interest is reading). Her outfit is very similar to Twyla’s G1 signature look but it’s slightly modernized (Mattel didn’t bother to redesign Twyla for G2). In G3 of Monster High, Twyla is introduced as being canonically autistic. Not only is this amazing (and accurate) representation for autistic children, especially autistic girls, but this doll means the absolute world to me. I was diagnosed with autism as an adult, and I know that if I had characters like Twyla in media as a child my journey of realizing I’m autistic would’ve been so much easier. I had no idea I was autistic until I was an adult, but the stigma around autism made me afraid to even consider the possibility when I was a teenager, let alone a child. Seeing a Twyla in a franchise I’ve loved since I was 8 years old appear visibly and unashamed about the fact that she’s autistic was such a powerful and emotional moment for me. I will forever treasure this doll for that reason. I have two of this doll because I broke one of the hand joints of my first one when I tried to put all my G3 forearms together (because they can be connected like that indefinitely) to make one doll with really long arms and it made me very sad because this doll means a lot to me. ",  

"211": "This doll came with e child-sized \"Caboodle\" set, as in a carrying case for makeup and hair accessories and things like that. I already have too many actual Caboodles so I definitely could’ve gone without this one. However, this doll is so breathtakingly beautiful and stunning that I bought her as soon as I saw her in person the first time. While her core doll has the split dye, this Draculaura’s hair reminds me of the color pattern of her G1 doll, and I think the pink and black always look nice like that. This doll’s outfit is relatively simple, but I think simple dolls is where Monster High is at their best. Draculaura’s outfit reminds me of the e-girl look combined with the fashion combo I saw constantly in high school in 2019. Dracualuara comes wearing a headband that matches the child sized hair clips that came in this set. The headband constantly falls off because I cut the evil t tabs off. Similarly, the hair clips do not stay in my hair. My hair is saran-coded and the last time I tried it was a lot longer so maybe I’ll have better luck with the 1998-Nickelodeon-child star-surfer shag I have now. Anyway, this doll has by far the best makeup of any Draculaura doll. I’m not a Draculaura stan like most locals (and apparently Jonah) but I’m not blind and I can appreciate gorgina when I see it. This doll has white heart-shaped freckles that remind me of a makeup style I used to do before I got my nose pierced. I also used to do the black heart stamps on my cheeks when I was younger and thought I was being edgy. Draculaura looks so much better than I did back then. The only complaint I have about her is that she came with that stupid playset.", 

"407": "This is probably one of the worst \"collectors edition\" Monster High dolls, which is why I was able to get it in stock. Cleo was sold in a 2 pack with Deuce, mirroring their debut release. Unfortunately for Cleo, her original doll is a million times better than her. For a start, the dress on this doll is atrocious and vile. It’s giving Miss Frizzle if she shopped at Hot Topic in 2007. The dress’s print features Cleo and Deuce’s skullette logos in the tired mermaid cut dress style. The corset belt thing is very pretty though. It does not belong with that ugly dress. Cleo also has ridiculously asymmetrical bangs that make her visible eyebrow look goofy. It’s just too drastic so it looks horrible. However, this doll’s saving grace is her facial screening. Her makeup is stunning and she has a side glance which gives back some of the points she lost with that garbage dress. The shoes are also really cute, I always love a classic pump in Monster High form. I just wish this doll wasn’t burdened with that dress because it belongs in the garbage.", 

"408": "As a cash grab for zoomer nostalgia, Mattel started releasing overpriced collector G1 dolls in the past couple years (from when I wrote this). This set, which is part of the Howliday series, is probably the tackiest. Cleo and Deuce, who are a couple because this is the G1 universe, both wear the tackiest clothes possible. Deuce wears this bizarre snakeskin printed suit that even Jonah thinks looks ridiculous. He has a very weird facial expression with a raised eyebrow to convey some sort of disgust or confusion or maybe both. It’s probably his reaction to Cleo’s outfit. This doll is interesting because compared to my original signature Deuce, he has a more detailed tattoo, so I guess he had it touched up. Also, and this is not unique to this doll because this change was made during the G1 era, my newer Deuce has wrist articulation while the core doll does not. Obviously, I prefer the articulation. His shoes use the same mold as the original core pair, but I lost those, so you’ll have to look on another website to see it. But would anyone want to look at a website not made by Jonah? I doubt it. Anyway, I mainly bought this pack to have a Deuce with a body that wasn’t broken, for my collection but also to take pictures for this website. I am a fool that makes bad choices.", 

"410": "At the time of writing this, the Monster Ball arc of the G3 cartoon hasn’t aired yet so I cannot give you any lore context, but that hasn’t stopped me before. Apparently I will not be doing any rewatches of Monster High because Jonah refuses to watch it with me >:(. Anyway, this doll slays BUT she is the only doll in the line to have polypropylene hair. Poly hair is unacceptable to be but at least it’s cartoonishly long. An important addendum I need to add is that there are later variations of this doll that have saran. I’m very jealous of people who have that variant because it’s not fair. The prototype for this doll and the illustrations show her with bangs but for whatever reason the final doll does not have bangs. I am personally a hater when it comes to bangs so I’m happy with this decision. Her shoes really made me say \"Monster High is SOOOO back\" because the heels are cute little snakes. You can’t see it in the picture sorry. Just look it up. This website is for Daniel showing off more than Daniel educating. This isn’t a review blog, it’s a sad loser flexing his hoard. Regardless this doll slays so much but the poly hair is very upsetting. Despite that Cleo is still my favorite doll in the line.", 

"411": "Skulltimate Secrets is the unboxing gimmick dolls from Monster High. The whole idea is you open the compartment with the doll and there’s a little plastic key taped to the side. You’re supposed to stir the key in water so the paint dissolves and reveals the actual color of the key. You’re supposed to use the key on the door of the corresponding color. Inside of the compartment is a little bag with clothes and accessories to the doll as well as another key. The consumer is supposed to repeat the process two times until you find the last key, which does not have any dissolving paint. While this is a very cute idea, it is very messy so I didn’t bother dissolving the paint until I opened all the compartments. All the keys are made from the same mold, so they work in all of the keyholes. You can also use your fingers if you really want. This is the second series to fall under this gimmick, and for some reason this doll was sold exclusively at Target. The rest of the series were also available online. Unlike regular Monster High dolls, the Skulltimate Secrets dolls come with a second outfit and the big plastic locker for the unboxing gimmick. I still hate the word unboxing but unfortunately that’s considered the standard term for this genre of gimmick toy. The Fearidescent dolls are (obviously) iridescent themed and they all seem to have a \"getting ready\" theme. I was very disappointed when I found out this doll has polypropylene hair, because it’s such a pretty color. It’s honestly unacceptable for Mattel to use poly for a $30 doll. Other than her hair, I love everything about this doll. I was lucky enough to get a doll with a good face because this doll was sold in blind packaging (I couldn’t see her face in the store).",  

"352": "Midnight Runway is the second line of extremely overpriced Monster High adult collector dolls released in the 2020s. In this line, the characters participate in a mascaraed fashion show. I missed out on the first Haunt Couture Cleo doll because she sold out almost immediately. I didn’t bother because I knew I would just get stressed. Anyway, this doll comes in a jumpsuit with a cape. This doll is certainly not worth the retail cost of $75 but I allowed myself to splurge just this once for my favorite Monster High character. I think this doll is absolutely gorgeous but at least $45 too expensive.",

"467": "In 2023, the first \"collectors\" G3 doll was released, and sold exclusively online at Entertainment Earth. It featured Lagoona in this fabulous elegant gown. Her hair is very yellow but I think it slays. At the time of writing, this is the first and only G3 doll to come with a stand, which I really appreciate but I wish was the norm. Lagoona’s makeup is very out there and bright but I think it looks incredible on her. The gold lipstick looks so pretty. Unfortunately, my doll is wonky but I think she looks cute so I didn’t return her. She looks normal if you tilt her head a bit so it’s not the end of the world for me. I really really love this doll’s dress, it’s giving a bit of Fleetwood Mac which I always appreciate but also personifies the vibe of life under the sea. This doll is incredible. I do wish Cleo got a collectors doll first but otherwise, I have no complaints.",

"464": "This is one of my absolute favorite dolls. I don’t think I’ve ever been so excited to see a doll from the second it leaks. G3 Abbey Bominable is almost perfect. I love her outfit so much, it’s so 2000s couture and the color palette looks so so good. I do love the COLOR of her hair, but unfortunately it’s polypropylene so it’s the worst part of the doll. My favorite thing is probably her new face mold with the little horns because they’re so cute but also slay. To be honest, I don’t know much about this characterization of Abbey other than the fact that she’s Nepali. That’s a huge improvement over G1’s vaguely Russian and honestly pretty xenophobic character. This doll would be absolutely perfect if she didn’t have the horrible hair fiber.",

"463": "Shocking news to absolutely nobody, I love Cleo De Nile so much that I’m willing to buy another waste of space Caboodle just to get another Cleo doll in my collection. This doll was sold exclusively with another Gore-Ganizer which is just a double yassified organizer box. I also have the Draculaura because that doll slays. For some reason, rather than being called a Gore-Ganizer, this time Cleo is in a \"Boo-Jeweled Beauty Case\" which I think is a much clunkier name personally, but I’m not a marketing expert so I have no credentials in that area. No handle means it’s no longer a Caboodle. This yassified box also comes with facial gem stickers, temporary tattoos, one shade of kid’s turquoise eyeshadow/general powder that looks terrible, a necklace (that contains the shadow), and a mirror alongside the doll. I didn’t take pictures of all those things because nobody cares. This Cleo slayyyyyyys. Her dress is a bit 2009 but in a good way. I LOVE how she’s styled. The shoes, with little sarcophaguses on the heel are so chic and Cleo-core. I don’t think there’s any media where she wears this outfit but that doesn’t take points away for me. The Gore-Ganizer dolls are 2 for 2 in the category of absolutely serving and out-slaying their peers.", 

"466": "So Monster High has done pet-themed lines many times. This was the first time in G3 though. I think the plot is Cleo is at the maul (that’s how they spell mall) with both of her pets. Clawdeen and Draculaura also have a 2-pack in this line but it’s pretty mid so I don’t care. Both sets were Target exclusives. I need to give a little backstory to explain why Cleo has two pets. Cleo’s core doll was the first G3 leak, and a lot of people were very upset that Hissette, Cleo’s snake in G1 had been replaced with a jackal named Tut. To be honest I didn’t care much because my Hissette figure is one of the only surviving pieces of my G1 core Cleo. Later pieces of media revealed that Hissette was still alive in G3 so people were anticipating her return in doll form. And let me tell you, it was such an iconic reintroduction. Cleo wears Hissette as a scarf like Britney Spears which I think is a first for dolls. I included Hissette in the picture because it’s just so iconic. Her necklace is a separate piece. Tut is there too but he’s just there wearing a cheap unhemmed cape. We don’t care. Anyway this Cleo slayyyyyyyys. I love her face and her top so much. She’s so beautiful. It is a bummer to get yet another pair of biker shorts when I would’ve preferred bell bottoms but oh well. Her shoes are very cute but unfortunately they’re unpainted. Her ring stresses me out because I don’t want to lose it and it’s a recolor of Draculaura’s ring so I’m not enthused. I don’t want to talk about the ring because at this time I cannot find it. I wish there was something to put into the shopping bags but at least they’re a new mold and not cardboard like G1. Also the ring light/selfie stick is adorable and Cleo looks so cute with her pets on the camera.", 

"465": "Clawd Wolf has always been uncreatively named Clawdeen’s brother, but in G3 it is way more complicated and the plot involves time travel so don’t worry about it. When I first saw stockphotos of this doll he reminded me of the \"There’s no such thing as a coincidence\" meme but in person he does not give that affect. I’m slightly disappointed that Mattel did not bother to flock his head but the texture is nice. The outfits are unfortunately very thin and cheap with the exception of the jacket sleeves, which are faux leather. I think this is a very beautiful doll as someone who has very few male dolls. I love that he has textured hair, it’s about time Mattel. I haven’t watched much of the G3 cartoon so I can’t tell you much about Clawd’s character but I think he has a very cute design.", 

"494": "Creepover is the first sleep line in G3 of Monster High, and I really like Frankie’s doll. I am not happy their hair is polypropylene but otherwise I really like their outfit. The robe feels a bit thin but it’s still soft and the pajamas look very comfortable. I like the added detail of the asymmetrical shoes and I love how Frankie’s designs consistently showcase their prosthetic leg. The shoes themselves are kinda weird though. They’re definitely not the best doll (that’s Twyla) but I think they’re very underrated. My mom bought me this doll for Christmas without me picking them out so unfortunately this doll is very wonky but I think they’re very cute regardless."


}]