[ 

{"360": "Because I am so quirky and different, this is the size I think of when I think of Polly Pocket. This poor Shani doll is the only survivor of my childhood Polly Pocket collection-unless you include the Disney Princess ones, then I also have one of the Ariel ones. The Travel-Licious line featured Polly and her friends traveling (obviously) to different countries. The dolls in this line had the \"Quik Click\" bodies and clothes, meaning the outfits were two hard plastic pieces that attached to the doll’s body with magnets. Some of these outfits had plastic tops with fabric skirts for some variety. I am missing everything for this doll except the doll herself, including her jet ski. I’m devastated. This was one of the last Polly Pocket dolls I got as a child and it’s very unfortunate she’s all alone.", 

"296": "BFC Inc was a short-lived line of dolls that were themed around friendship (BFC stands for Best Friends Club). They came in two sizes, the more popular 18-inch dolls and the lesser remembered smaller fashion dolls. My doll is one of the latter. I have a vague memory of the commercial, but I never really cared much for the lore of these dolls. It has also been difficult to find information in my research. I definitely got this doll as a birthday gift as a child because they never impressed me. I never changed this doll’s outfit either. This doll has interesting articulation because she has the standard five points plus ankle movement. I’m honestly really surprised that she has ankle articulation but no elbow articulation. I’m guessing this is so dolls could have high heels and flats but personally I’d rather have posable elbows. I wish this doll didn’t have poly hair. Addison seems to be more sporty-themed, which isn’t very me-core but this doll is an interesting relic of 2008.", 

"416": "In the first year of the brand, I was absolutely obsessed with Liv dolls. This was shortly before the debut of Monster High if I’m remembering correctly, but I definitely played with Liv dolls right before I got invested in Monster High the first time. It was one of the first doll lines I remember that came with unlockable internet features with the doll. Daniella was the musician friend of the group, but I couldn’t tell you anything else about her. I treated this doll horribly as a child. You see, Liv dolls came with interchangeable wigs and the commercials advertised restyling them and CUTTING THEIR HAIR. For whatever reason, I decided that this specific Daniella needed a stylish pixie cut. It did not go well. I remember my mom was not happy about my sudden hair dressing aspirations, but my dad defended me as a vulnerable victim of television advertisements. Unfortunately, Daniella’s stylish pixie wig is long gone. I also have lost all the clothes and accessories to this doll except her tank top. For her picture she is borrowing Making Waves Jake’s shorts because it’s the only pair of identified Liv pants I still have. I might have a pair of jeans, but I haven’t confirmed it yet. To quote the drag queen Alaska, I think this doll’s makeup is terrible. She’s serving concealer lips with her lipstick choice which I guess is of its time but looks horrible.",  

"297": "In the second release of dolls from Liv, each of the four original characters came with their pet dogs. I only bought the Alexis doll from this line. I chose her because my friend at the time had just gotten a dog similar to Alexis’s. Lacey, Alexis’s dog, is a bichon frisé. My friend was not happy I got this doll because we were at the age where this was considered \"copying\". I’m sure she wouldn’t think that way now because we are both adults but it was a big deal at the time. This doll, like most Liv dolls, screams 2009 with her outfit and styling. Her original outfit, which I no longer have unfortunately, would never have been in my closet but I’m sure everyone else my age would have loved it. I have vivid memories of Alexis’s purse which I no longer have because it always looked like a paper lunch bag covered in gold paint with a strap added. I think this doll has an absolutely gorgeous face and I feel bad that she has to borrow First Edition Daniella’s top and Making Waves Jake’s shorts. I’m also very sorry to this doll that I lost her wig.",  

"298": "Early on in her career, Taylor Swift released many dolls that correlated with various outfits she wore on stage and in music videos. When these dolls were released I was obsessed with the song \"Love Story\" and the outfit she wore in the music video. Naturally I was delighted when I got the corresponding doll. At the time, she sang parts of the song when you pressed a button on her stomach. As an adult, I took the batteries out, and I ruined her hairstyle because she really needed a clean. She lost her beaded hair accessory in the wash and I lost her shoes and guitar as a child. Her dress is not in good shape at all, the fabric has a major snag in the front and her belt decoration has come off. Her hair is supposed to be curly but the Taylor Swift dolls have kanekalon hair so it went straight in the much-needed boil wash. I love this doll very much, although I wouldn’t consider myself a Swiftie, and she is in very rough shape, this is one of the most sentimental dolls in my collection.", 

"299": "After Mattel temporarily gained the rights to Bratz, MGA created a similar but more modest line called Moxie Girlz. I would describe them as the younger sister of Bratz. They have a similar design with the massive heads and the removable feet but they have more realistic proportions (other than the head), and like I said, much more modest clothing. A lot of the criticism of Bratz was misogynistic claims that the dolls wore inappropriate clothes when they were honestly just being fashionable. I’m guessing MGA wanted to avoid additional slut-shaming for the dolls they still owned while they continued their legal battle. The Art-Titude dolls were a coloring gimmick line where consumers were encouraged to draw on the doll’s clothes with the included markers. Naturally, child me drew on the doll’s face instead. The outfit my doll is wearing is actually her second outfit but I lost the first one. The nature of the faux-leather material used on this doll’s dress has made it peel and crack so I apologize for the state of it but there isn’t much I can do. I only had one other Moxie Girlz doll as a child because I got pretty bored of them but I think this doll is cute. She has pretty simple makeup which I don’t enjoy that much but she has very pretty eyes.", 

"300": "Rainbow Brite is an iconic child’s toy/media brand from the 1980s that has had many reboots similarly to My Little Pony. Unlike the pastel horses, the Rainbow Brite reboots have for the most part flopped, including the 2010 one this doll came from. A couple other characters plus a version of this doll with a horse were released but did not garner much attention. My doll is missing her arm bands unfortunately. I wish a little more effort was put into this doll, but I wasn’t the one who bought it or owned it as a child. My sister was briefly interested in Rainbow Brite but she quickly lot interest. I’m honestly surprised that this doll did not mysteriously disappear. Honestly, I would rather have so many of the dolls that mysteriously disappeared than this doll, but she’s still a unique and interesting piece of doll history.", 

"372": "This doll does not have a box date, but I know she was sold at Hershey Park as early as 2013. Because this is a generic \"fakie\" doll, I don’t have any information about who manufactured her so I just put Hershey. Interestingly, this doll’s body appears to mimic Barbie’s Twist N Turn body but with much longer and skinnier legs. The plastic is also a lot more brittle which is to be expected from \"fakie\" dolls. I almost broke the waist in the cleaning process, but I am notorious for breaking things. Some of the dye on the dress came off in the cleaning process unfortunately. I got this doll as a gift from someone I love very much so even though I usually don’t keep \"fakie\" dolls, I made an exception for this one. I think this doll has a really pretty face but I honestly fear breaking any of her pieces any time I breathe close to her.",  

"417": "Pinkie Cooper is one of those cult classic doll lines that flopped in stores but is very expensive on the second-hand market. I remember when they were in stores, and I wasn’t interested at all to be honest. Anyway, Pinkie Cooper and her friends are anthropomorphic dogs that love fashion and travel. They also have pet dogs so it’s a bit of a Goofy and Pluto situation. These dolls were honestly ahead of their time as anthropomorphic dolls, which is why they’re so popular with collectors. They have interesting hair gimmicks because rather than standard rooting they have wig caps on the sides of their head to mimic big floppy dog ears. The wig caps are removable so you can mix and match hair. I found this doll at a flea market for $6 and knew I couldn’t pass her up just as a lover of dolls. Although she doesn’t appeal to me much, Pinkie Cooper has an important place in doll history.", 

"301": "Cave Club is a small caveman-themed brand released by Mattel. They are very campy and silly, as while these dolls are prehistoric themed, they are also stylized in 1980s fashion. I think this doll is so fun and lighthearted, but there is certainly missed potential. Unfortunately, Cave Club dolls all have polypropylene hair which at this point even Jonah knows is not good. Bashley is supposed to have curly hair but the box plus the fiber came out in a huge mess so Bashley needed an appointment with the hair straightener. I’m honestly really upset that I had to straighten this doll’s hair because although the frizz is gone so is the character’s personality. She’s still gorgeous and has the most slayful makeup but I think she would be a million times better if she had saran hair.",  

"302": "Slate is the only male Cave Club doll. He’s ok. He has the over-used male doll haircut that I don’t like very much but Mattel didn’t bother adding any flocking. I don’t mind the lack of flocking because I always get stressed about flocking coming off. Anyway, Slate is an artist and comes with various painting accessories. His outfit is alright but it’s honestly very cheap quality. His little pet that I didn’t include in the picture is very cute I guess. I’m sorry I don’t have much to say about this doll; he’s just some guy.", 

"303": "In 2020, Mattel released a short-lived Sanrio line that featured fashion dolls dressed after different characters and a figure of the corresponding character. I have the My Melody doll. I think this is a beautiful doll and I absolutely adore her face, but a lot of this doll is very cheaply made. Firstly, she has polypropylene hair (booooo). Next, the details of the outfit is very lazy. For example, the collar on her shirt is printed on. Also, all of the plastic pieces are one color. Don’t get me wrong, the shoes are absolutely adorable and I love them, but they are still very lazy. I think this line could have done so much better if Mattel put more effort into it.",  

"304": "The Na Na Na! Surprise Teens are a spin-off line of the Na Na Na! Surprise dolls but they are bigger and meant to be the older sisters of the original dolls. Most Na Na Na! Surprise dolls are themed after an animal, and Mila Rose is themed after a white (and pink, I guess) cat.This specific doll is part of the Slumber Party line. She wears pretty boring and typical pajama set, and comes with a sleeping bag and pillow I didn’t include in the picture. This doll is interesting because although she is cloth (yet articulated, I haven’t figured it out yet), she is rooted. BUT MGA felt the need to add a big tag to the back of her head right on the hairline. It gets in the way when I want to brush her hair. Thankfully, this doll has nice nylon hair so it’s not the biggest pain. I found this doll on sale, and bought her to see what the bigger Na Na Na! Surprise dolls were like rather than a genuine interest in this doll. Sorry Mila. I think she’s very interesting but honestly cloth dolls make me anxious in case they get dirty so I don’t intend to get any more.",  

"418": "I grew up with the bigger Polly Pocket dolls as a child, and had no idea that she was originally less than an inch tall until I was a teenager. I bought the Sparkle Stage playset impulsively one day because it was on sale and I was curious as to what these dolls were like. I soon found out that they are just ok. I certainly prefer my childhood dolls and the vintage Pollys. I also despise the playset this doll came from because the pieces do not all fit inside nicely and the outside has the horrible sequin gimmick in the shape of a butterfly. Sequins are the most horrible sensory experience for me so I really really hate it. I think this doll is fine though. Her outfit is cute. I would have definitely lost her as a child.",  

"419": "This poor doll doesn’t have an official name. She’s just Polly’s friend. I labeled her Shani in quotes because she resembles the canon character Shani. See my description of the Polly from this same playset to see my list of grievances with this set. I think this is a very cute doll but because she’s so small, there’s very little details. She’s wearing on a printed on leotard and is advertised doing gymnastics on the box. I’m sure she’s very good. Honestly this doll deserves better, a better playset, better details, and most importantly, an actual name.",  

"305": "The Fidgie Friends dolls were a line initially released in 2023 and featured characters with outfits and hair that are fidget toys. I thought this would be a cute idea and I naturally wanted the purple one. Personally, I often use my dolls as fidget toys but I frequently break actual fidget toys so I’ve always been cautious with this doll. Boba Bubbles is a mermaid who has a squishy tail and Orbeez-like beads in her fins. I much prefer her to the other mermaid who has sequins on her tail. Sequins are my number one sensory hate. I think this doll is very cute and I really appreciate her nylon hair, but the articulation and clothing quality is lackluster. I’m not sure what the leg articulation is like since this doll does not have human legs, but I was really disappointed by the wrist articulation. They can only turn, not bend. I honestly don’t see myself collecting any more of these dolls but I still love the one I have.",  

"306": "The poor Mermaze Mermaids were a very short-lived line of mermaids sold by MGA. They have a color change gimmick that I never bothered to try. It didn’t work in Jonah’s pool so what’s the point. Unlike most mermaid dolls, Riviera is unique because she is exclusively in her mermaid form. Her \"legs\" only articulate at the hips and the fins. She cannot sit. The fins double as a stand but it doesn’t work well. The paint has already started to chip on this doll, even before she went in the pool. Also, she was rooted very poorly and her hair was full of tangles in the box. As you can see, I had to give her a drastic haircut. When I tried to brush her hair out, several hair plugs came out with little force. I was really disappointed because I really liked how her hair looked. There were also some logistical issues with this doll (not including the not-being-able-to-sit-or-stand problem), because her jacket is too stiff to hold her guitar with it on, and the collar is too high and stiff for her long earrings to stay in. I think this is a really pretty doll and it’s really unfortunate that I have so many issues with her.", 

"307": "To be honest, I purposely know very little about Miraculous because the entire franchise overwhelms me. However, I found this doll at a thrift store and I find dolls there so rarely that I decided to buy her. Unlike most Ladybug dolls, she has a full jumpsuit covering her feet rather than shoes and has molded on gloves. She also has longer hair than the other Ladybug dolls I’ve seen. I’m missing the tiny accessory that came with the doll but I have no idea what it is. I think this doll’s hair is a really unique navy almost gray blue that I really appreciate but I do not appreciate that it is polypropylene. I wish I could say more about this doll but I’m absolutely clueless.",  

"308": "In the United Kingdom, Sindy was seen as a cheaper alternative to Barbie. In the late 70s and early 80s, my mother had Sindy dolls. Sindy was briefly sold in the United States in 1978 but she wasn’t very popular. Sindy dolls have very similar heads to Tammy dolls made by Ideal Toys in the United States. They were also a cheaper alternative to Barbie but mainly sold in the 60s. Both Sindy and Tammy have a much more childish face that I find a little creepy. In the 2000s, Sindy had a revival in the UK that was much more modern and less scary. Recently, my dad took a trip to England and got this doll for me at Argos. In recent years, Sindy has reverted back to her original doll with more modern styles. I think the face fits her very poorly but it’s still a nice sentiment. I really wish this doll was less cheap because her plastic feels very brittle and her hair is polypropylene. Her outfit is very cute and I appreciate how articulated she is. I also appreciate all the little cardboard accessories she came with, but I broke some of them almost immediately. I think this doll is very ugly and outdated looking but she means a lot sentimentally because she is the closest I will get to the dolls my mom had as a child.", 

"309": "MGA’s Na Na Na! Surprise line confuses me because it’s only sometimes an unboxing (yuck) gimmick doll and also, they are made of cloth. I assume it’s similar to Cabbage Patch Kids but I have filed a restraining order against any and all Cabbage Patch Kids so I cannot find out. What’s definitely different from those horrible babies is the Na Na Na dolls have printed faces and underwear on their cloth bodies. I’m not sure how I feel about it. This doll was a Valentine’s Day gimmick with a conversation hearts motif. For reasons I will not confirm nor deny, Valentine’s Day should be renamed Daniel Day because the focus should be on me. I do not like conversation hearts so they should all go in the trash. I think it’s nice though that even though these dolls have the weird conversation hearts dresses they have little removable t-shirts underneath which is very much appreciated. Mattel wouldn’t have bothered if this was a Barbie. A big problem I have with the Na Na Na dolls is that their shoes are constantly falling off so I wish they wouldn’t do that. Another complaint for this line specifically is that they are not rooted, and their hair is attached to their hats so if you take their hats off they will be bald. Regardless, I think this doll is very cute and she gets bonus points for being themed after my favorite color. I had to take her twists out because they got really messed up, but I haven’t had the time to fix them yet.", 

"310": "Integrity Toys made this doll in collaboration with one of my all-time favorite drag queens: Trixie Mattel. They also produced various Rupaul dolls throughout the 2000s and a couple others more recently. Unfortunately, the Rupaul dolls are very expensive on the secondhand market, so I do not own any of them currently. Because this is s doll meant for adult collectors rather than playline, Trixie is probably the highest quality doll in my collection. Her outfit is honestly nicer quality than some of the clothes I’ve bought myself. She came with an additional pair of hands, a pink acoustic guitar, and three mini vinyl records of her three albums at the time. I don’t enjoy country music so I cannot tell you how good these albums are. For me, the focal point of this doll is the face and how they translated Trixie’s distinct drag makeup to a doll. I think she looks absolutely incredible. I noted that this doll was a gift from my dad because she was very expensive, and my dad was generous enough to preorder her for me when I was going through a rough time. I remember because I preordered her the day Trixie announced the doll on her YouTube channel, I was one of the first people to receive my doll and that was a very special day. Trixie Mattel is one of my favorite drag queens not only because I enjoy her art, but also because she’s a doll collector. Personally, I don’t enjoy 1960s Barbies, which are the main focus of her collection, but I still really appreciate such a public figure and an icon in pop culture bringing doll collecting to the mainstream.",  

"391": "The Cry Babies BFF line are a spin-off to some baby dolls. I don’t have any interest in baby dolls, so I am abstaining from learning more. I believe that the BFF characters are tween versions of the babies and they all have matching friendship necklaces. Hannah is from the second series, and I am honestly not sure what animal she is themed after. She also seems to be the sporty doll in this line. The quality of these dolls is really nice, I was pleasantly surprised by their clothes and their nylon hair. However, their faces are a bit unsettling. I can’t decide if I like them or not. They are a bit scary but look a lot better in person than they do in pictures. They still look very strange. I honestly bought this doll and Jassy, the other doll from their line because I found them on clearance for very cheap. Still, I appreciate her for what she is.",  

"392": "In the second series of Cry Babies BFF dolls, Jassy is the unicorn themed character and also the only doll of color. I think her outfit is very cute and she is very high-quality, but like Hannah, her face is a bit off-putting. I really like the blend of colors in her hair and it’s a lovely soft nylon so that is definitely the highlight. Her pretzel-shaped purse is very odd and feels out of place, but I don’t want to watch the cartoon and find out, so I’m content with it being a mystery. I think this is a lovely doll, but her face is a bit too weird for me to have any desire to collect the line.",

"487": "Honestly, I think Jonah likes this doll more than I do. He was very entertained and played with her for almost an hour when I showed her to him the first time. When he gave her back to me, her hair was a tangled mess. I could easily fix it but I enjoy fake complaining about him on his website. However, Jonah keeps thinking this doll is a Barbie when she clearly isn’t. He has lost his mermaid privileges (just kidding, bestie). Anyway, unlike the signature Riviera doll, the Winter Waves collection improved all of the quality issues of the first release. Harmonique’s hair wasn’t a complete disaster falling out as I opened the box (that came after I let Jonah play with her) which was a good start. Her tail was completely enclosed in the packaging which I prefer because I don’t really want children touching my dolls before I buy them. Another thing I appreciated was that the doll’s jacket wasn’t too stiff to pose her arms with. She also came with a stand (structurally very similar to the OMG stands which I love). Unfortunately, the accessories that came with this doll were a total mess. There was lots of really cute little makeup products, but the nail polish wand snapped in half immediately and the earrings will not fit into her ears without breaking. It’s really unfortunate because they’re so darling and the makeup products all open but they completely fell apart immediately. I couldn’t tell you much about Mermaze Mermaids lore-wise because it was very silly and the whole point was to make the color-change gimmick super serious and a big deal. It also doesn’t help that the brand was canceled soon after the Winter Waves line. It’s very unfortunate because these are such beautiful dolls. I think if they didn’t have the quality control problems of the signature series, it would have done so much better. I think Harmonique is an absolutely gorgeous doll. Honestly the snow globe effect of the glitter in her tail stresses me out a bit in case it ever leaks but I plan on keeping her on display so it shouldn’t be a problem for the rest of my dolls. I love the bright glam metal inspired eyeshadow on these dolls; it reminds me of the makeup I like to do on myself if I wasn’t too lazy to do eyeliner.", 

"486": "La Dee Da was a short-lived fashion doll line initially released in 2012. The series follows Dee and her friends after they started a fashion label and apparently they all liked Dee enough to name it after her. These dolls remind me a lot of Blythe, which is one of the most famous vintage dolls in modern history. Blythe flopped in their original release in 1972, but they have unique changeable eyes so they are very expensive on the secondhand market. Blythe dolls have massive round heads and tiny skinny bodies with noodle-y arms and legs. La Dee Da dolls lack the eye gimmick but their design looks otherwise totally like Blythe. City Girl Dee was the doll’s debut release and featured Dee wearing an artsy New York City-inspired look. It’s giving Zooey Deschanel twee but with more saturated colors. The doll came with a little portfolio of her fashion designs and a booklet that gives some more backstory. I got this doll secondhand so I don’t have any of those pieces. I also am missing her shawl but that’s ok. This doll has a customizable gimmick where you could alter the shape of her dress and move around the fascinators via Velcro. I remember having zero interest in these dolls when I was a child, mainly because I was a Monster and then Ever After High loyalist. I wish I wasn’t so close-minded because these are beautiful dolls. I love dolls with cartoonish proportions and La Dee Da dolls have the most beautiful faces. This doll’s asymmetrical eye makeup reminds me of Ke$ha a bit but I could very well be completely delusional and making up a Ke$ha look. I’ll ask Gideon because he’s a stan. Anyway, this doll gets bonus points because she has kanekalon hair. Yes I am aware kanekalon is considered lower quality than saran but I don’t care. It’s so fluffy and lovely (unless it’s tangled). Anyway, this doll is adorable and I wish I gave this brand more attention when I had the chance.", 

"489": "There’s a lot of backstory to this doll. It starts with a gimmick toy going viral online. That gimmick toy had various spin offs that finally culminated in a semi-blind packaged doll line. Originally, Magic Mixies released as a potion making playset, where the consumer uses the provided pieces and a plastic cauldron (later iterations use a genie lamp or a crystal ball) to \"magically create\" a fantasy stuffed animal friend. These playsets are fairly expensive and most of the product is a one-time use so as an adult this does not appeal to me at all. However, in 2023 a doll line was added as a spin-off series, for a much cheaper retail price. Unfortunately, the potion making gimmick is still there. I don’t like mess around my dolls but luckily strange liquids do not come into contact with the doll. It’s easy to skip the potion but I did it so I could get the full experience. I don’t know how it works because I’m not a scientist so I can’t really explain it to you, sorry. I can talk about the dolls though. I don’t know the lore, because there doesn’t seem to be any, but each of the characters seem to be an elf-like creature with motifs of other creatures, fantasy or otherwise. I picked the unicorn themed doll. She has lovely crimped nylon hair and really impressive sculpting on her head mold. Unfortunately, her top is molded on but there’s so much texture to it I can’t complain that much. The skirt is a little cheap with the lack of hemming but I’m not that bothered considering the size. Honestly, I was really expecting these dolls to be a lot bigger. I thought they’d be the standard 1:6 scale fashion doll, but they’re about half that. Honestly, I’m pleasantly surprised because that makes them so much more unique. The little details like the paint on the shoes make the small size really impressive. I’m not sure how to pronounce this doll’s name, but they all seem to be puns on their creature type. They eye makeup on this doll looks absolutely stunning, I can’t believe it’s a factory screening because it looks so nice. My only complaint is that the paint on her arms has already started to chip after I decided to make her pose on a G3 My Little Pony for a reference of scale. It works pretty well but she doesn’t stay on because she can’t bend her knees. This is my only doll made by Moose Toys, but if this is the quality standard, I’d be inclined to check out some of their others. Hopefully they’re less messy to open.", 

"490": "Ok so I bought another one. See Magic Mixies Pixlings Unia for more details about how these dolls are packaged. Yes I did the unessesary mess again. This time I used too much water so this poor doll got the liquid on her dress and I had to wash it off. I think the stain was there before but I’ll keep you updated. Wynter was sold as a Target exclusive so she was slightly more expensive than the normal dolls but she came with extra clothes and accessories. Her top Is fabric which is preferred, but still not hemmed. Apparently Wynter is a bunny pixie which I did not figure out until right now when I looked it up. Her headband reminds me of Adventure Time which makes me nostalgic for middle school. Like the other dolls, Wynter has a stunning face that contantly impresses me. Her articulation is the same as the standard dolls, but she has no paint on her hands. That’s a good thing because on my Unia doll the paint has already started to chip. To be honest, I don’t see how this doll is worth more than the universal releases because the only additions is the cloth top (well it’s a dress but you get what I mean) she just has a couple of extra pieces and slightly larger packaging. The extra stuff has it’s own unboxing gimmick but it’s so meaningless (you dissolve the bags in water) that I didn’t even realize it was a thing and just opened them like a normal person. This doll is gorgeous and adorable but she is absolutely not worth more than the standard release dolls.", 

"488": "Ok so I bought another one. I just think they’re really cute ok! And this one has legs so I get to describe her leg joints this time. Fairie Garden, who has one of the worst names of any dolls I own, is the first doll in series 2 and was released several months before the other two. She is the most cottage core woodland fairy of all the dolls released so far. Her foam squishy skirt is the same idea as the donut skirt in series 1 which is a little disappointing, but at least her wings have a new and unique fidget gimmick. The paint will inevitably crumble so I’m trying to be careful with the skirt and the headband, which has the same fidget. The clothes are the same quality as the series 1 dolls, which is a little disappointing because they could be better. It’s cool to see her shoes though, which are a new mold with a really cute design. I really like it, and I appreciate the fabric ribbons even though they feel a little cheap. I appreciate the painted details. What I found really interesting is that the legs are very similar to Rainbow High dolls but smaller and a little more rigid. But all the joints are the same, which I appreciate because obviously I really like Rainbow High. Overall, this doll certainly could have been a lot better but I’m still very impressed by her.", 

"485": "First of all, sorry for the jumpscare. I know this doll is scary and not my usual choice. But I promise this doll is really interesting. Diva Starz was a relatively short-lived hybrid (she’s like a Prius) doll and electronic line initially released in 2000. According to my bestie Wikipedia, Diva Starz were Mattel’s answer to electronic pets like Furbys and Tomagachi. In my personal view, that fact is overshadowed by how interesting I find the fashion and aesthetics of these dolls, because they were released less than a year before Bratz and had (loosely) similar vibes. I wonder if the electronic gimmick became a weakness that allowed MGA to completely overtake Mattel with Bratz. It was probably because these dolls are so scary. Later there was a spin-off line of actual fashion dolls with the same scary faces but slightly smaller. Anyway, these dolls have various buttons on their body that are triggered when you attach the various plastic clothes and accessories to their bodies. I got my doll used so she does not work anymore and I cannot demonstrate any of the features. I also do not have any of her additional outfits or accessories. This doll is named Alexa, and apparently she likes pink and fashion. Cool. My doll is missing all her eyelashes but I don’t think that would help with how creepy she is."

} 

] 