[{

"250": "Avery is (as of writing this) the only Rainbow High doll without rooted hair. Instead, she has a plastic molded on pixie cut like the Liv dolls I grew up with and has two wigs to choose from. I of course, chose the purple one, both because purple is my favorite color, and it is the wig she wears in the Rainbow High web series. The doll also comes with a \"fashion studio\" that is essentially a rack of mismatched clothing pieces themed after each of the dolls in series 1 and half of series 2. Avery is also packaged with multiple pairs of shoes and clear storage crates. Interestingly, my doll is an older release because her head only moves left and right; it does not move up, down, or diagonal. I pictured Avery in her original outfit. This doll is sometimes considered part of series 1 but she is never included in the lineup, so I just listed her as part of the special series. Honestly, my doll has slightly messy eye makeup and also suffers from the series 1 and 2 problem of wearing way too much highlighter (kind of like me when I was 17) but it is not as bad as my Bella doll. The tinsel of both her wigs, especially the purple one is not very cooperative also. Despite my numerous complaints I am very glad I have this doll in my collection, both because she’s unique but also, she is a purple doll.", 

"251": "Series 1 Jade Hunter is very obviously inspired by the fashion of Billie Eilish. I know very little about Billie Eilish but in the canon of the Rainbow High web series Jade wears much more traditionally masculine and androgenous outfits, for example, she is the only doll in series 1 to never wear high heels. Also in the lore, Jade is a makeup artist, but her signature doll has relatively neutral makeup which seems like a missed opportunity to me. During the release of series 1 there was a lot of online buzz about this doll being the \"Billie Eilish doll\" and describing the design as lazy or over-inspired. I don’t really have an opinion either way, but if there was a Rainbow High doll heavily inspired by Kate Bush, I would probably buy at least 5. This doll also has the updated neck articulation and the less severe highlight. Jade is also a heavily lesbian-coded character, with the fandom frequently shipping her with Bella Parker from series 2. I usually display the dolls together because I think it looks cute.", 

"252": "Poppy Rowan is the orange-themed doll in series 1 of Rainbow High and is one of my favorites. I really like the blend of pink and orange in her hair as well as her unique outfit. Practicality-wise, this outfit isn’t great, as the stiff material of her jacket and boots limit movement significantly. Additionally, her dress is beginning to fray. Despite all her faults, I think Poppy is a beautiful doll with a gorgeous face. In the Rainbow High canon, she is a music \"focus\" (because it is a high school they say \"focus\" instead of major) which is not at all reflected in the doll’s appearance. Also unique to this doll is the molded butterflies stuck in her hair. I think they look cute but they make hair styling more difficult. I found a second one of this doll with her complete second outfit but one of the butterflies snapped off when I found her because she was secondhand. The skirt is hideous but the sweatshirt and shoes are cute.", 

"253": "Ruby is the red-themed doll in series 1 of Rainbow High. Canonically, she studies mixed media arts which apparently means customizing sneakers. Ruby dresses like someone who claims to only be friends with men because they are \"less drama\". Ruby’s hair is unique because she has a massive hole on the top of her head to attach her hat, which has a massive peg on the inside. Unfortunately, that leaves poor Ruby with a massive bald spot when you take her hat off. Just like series 1 Violet, this doll also suffers from the problem of the straps on her shoes being too small and too thin because I broke one of them while getting ready to take this picture. I don’t have any intention of going out and replacing this shoe though, because Ruby is not a purple doll. Another important note about Ruby is that she loves to wear Supreme, which is parodied as \"Sparkle\". Maybe I’m just a hater but I find that very tacky. She’s still a gorgeous doll; I love her face the most. I have a second one of this doll now but she is only wearing part of her second outfit because I got her secondhand and unfortunately incomplete.", 

"254": "Skyler Bradshaw is the blue-themed doll in the debut series of Rainbow High. In the Rainbow High universe, she is studying fashion design. Skyler really likes wearing denim. Personally, I think her outfits consist of entirely great pieces, but they look very silly together. Skyler has the best shoes of all of series 1, but they’re wasted on this ridiculous mountain of denim. Did I mention that Skyler loves wearing denim? My doll was unfortunately sacrificed as a part of my brief impulsive customization era. I decided to swap her eyes with Series 3 Sheryl but I forgot that you have to use eyes from dolls with the same face mold. As a result, this procedure was an absolute disaster. In the process I accidentally ripped out the plastic piece that keeps the inset eye in place. As a result, Skyler can no longer have two eyes. I am embarrassed with the state of this doll. It is entirely my own fault and I am very sorry if I scared you with this picture.",  

"255": "Personally, I think Sunny is the series 1 doll that aged the best. In the Rainbow High lore, Sunny is an animator who has made her own cartoon called \"Hi Hi Kawaii\". Sunny is a twin; her sister Luna goes to Shadow High and their relationship suffers from continuity errors after the mess that is season 3 of Rainbow High. Her hairstyle is inspired by Sailor Moon, one of the most famous anime characters and the star of the only manga I’ve read. I did modify the hairstyle slightly, the longer hair pieces outside of the bun were visibly uneven on my doll so I just twisted them around the buns to put them with the rest of the ponytail. My absolute favorite part of this doll is her shoes. Her socks are also very cute pride pieces, but I am absolutely obsessed with her gold and rainbow platforms. I love wearing platforms myself as I have awful balance and cannot walk in heels so this doll is just like me for real.", 

"256": "Violet Willow is the purple doll in series 1. I have two because I bought one separately (the uglier one on the right wearing her second outfit) and then broke one of her original shoe straps. So, the natural solution was to buy the six-pack of all of series 1 so I could get a Violet without a broken shoe. Jonah is shaking his head at me reading this. Unfortunately, both dolls were bought online so I could not pick out a doll without wonky eye makeup, but it doesn’t bother me. In the Rainbow High web series, Violet is a teen influencer that’s kind of a bad friend, but she wears purple, so all is forgiven. She is my favorite doll in series 1 which is not a popular opinion. Both of my dolls are later releases, so they have full neck articulation and less intense facial highlight. The prettier Violet (the six-pack version) has a much dewier glow compared to ugly Violet and the earlier dolls.", 

"257": "This doll is from the first non-signature line, considered budget at the time, because they were not sold with stands. They still had the same amount of articulation as the full dolls though. They are themed after cheerleaders, but they all have differently designed outfits because of a plot point in the Rainbow High web show. This doll is an earlier release, so she only has limited neck articulation. Additionally, her hair bow is attached with a clear elastic band which is questionable quality-wise. The pom poms have nicer elastic on their handles so there isn’t really an excuse. This doll’s outfit is just ok in my opinion, I’m not really a big fan of cheerleading so I don’t feel super excited about this doll when I see her. She has unique eye paint on her cheeks, so her makeup is really the high point of this doll. I also like the shoes though, because it’s funny to think of someone cheerleading in high heels.",  

"358": "The first music group introduced in Rainbow High is Rainbow Dream, and Lyric is the lead singer. She is a former child actor but her acting abilities are never shown outside of a music video so I couldn’t tell you if she was very good. I wouldn’t be able to tell you if there was footage of her acting though because I can never tell when someone is a good actor. It doesn’t really matter in this context though. This is a doll that people either love or hate. I really like her hair, because the color blend looks like an oil spill. Her makeup is also really nice. Outfit-wise, I like her jacket and top but those pants are absolutely hideous and tackey. Her second outfit is overall cuter but I display my dolls in their first outfit (with a couple of exceptions that will be noted) so it doesn’t matter. This doll looks significantly mid compared to the other two dolls in the Rockstars line which is why I think other people dislike Lyric. Personally, I consider Lyric a purple doll so I automatically like her but not as much as Vanessa. The Rockstars line was released a year before the entire Rainbow Vision thing, and Rainbow Dream don’t participate because it’s explained away as they won last year. I must admit their song \"Colors Go Pow\" is a banger, but their other song \"Hero\" is mid and I didn’t like it. I will not subject Jonah to the Rainbow High music because he is my friend.",  

"259": "This is probably one of the most beautiful dolls in my collection. Vanessa is the drummer for Rainbow Dream and seems to be a nepo baby in that industry, as her father is also a famous drummer. Vanessa’s personality seems to be a bit crunchy granola (with peace and love). The one scene where she talks for more than a second, she stresses her desire for the music video costumes to be made of high-quality secondhand fabric. To be fair, the outfits end up being pretty gorgina. Vanessa was the first Rainbow High doll to have microbraids, and they are partially rainbow colored. Barbie dolls have had microbraids before Vanessa, but Vanessa is a much higher quality doll than most Barbies available right now. Vanessa also seems to like incorporating denim into her fits, but she is much more subtle about it than Skyler. I think my favorite piece of this doll is her first pair of shoes. They are heavily decorated Timberlands and they’re absolutely adorable.", 

"260": "The De’Vious Twins were released as a 2-pack in between series 2 and 3. They were the first dolls to have a new face mold and they were also the first 2-pack in the signature line. Holly and Laurel are both acting focuses and seniors at Rainbow High. They act very similarly but apparently Holly has an icier personality than her sister. The De’Vious sisters are very wealthy mean girls; one plot arc features them putting on a play that is just an advertisement for the ski lodge their parents just bought. They also perform a hyperpop song during series 3 while fantasizing about hosting Rainbow Vision (I hope you’re taking notes, Jonah). Holly is supposed to represent the cooler tones of the rainbow, so green, blue, and purple. This is why I group her in with my purple dolls, but I honestly wouldn’t be that bothered excluding her. Holly’s outfit is a palette swap of Laurel’s; the silhouette is exactly the same. I think their outfits are very cute, but the skirt looks a little too old for her. It’s something a middle-aged businesswoman would wear in my opinion. The top is really cute though. I think this doll is gorgeous and I appreciate that she came with an extra pair of shoes, a classic pump, and some stud earrings. I wish she had more purple in her hair blend but I always want more purple so that doesn’t mean much. I also have a duplicate of this doll now but she looks exactly the same.",  

"261": "As much as I love Holly, Laurel is undoubtedly the prettier sister. See my description for Holly for a detailed explanation of the lore. Another fun fact about these twins is that their names are a play on the \"Yanny or Laurel\" viral trend a few years ago. I think that’s a little cute but also a bit cheugy. Because her outfit is exactly the same as Holly’s but in a different color, my opinion is the same so again, so read my Holly description for my opinion. With both of these dolls, I prefer her second pair of shoes to the first, but I just love a classic pump so that’s no shade to their first pairs. I think Laurel is a lot prettier than Holly mainly because of her eyes. Holly has blue eyes while Laurel’s are brown, proving they’re fraternal twins (unless one of them is wearing contacts). I think blue eyes are beautiful, but there is such an oversaturation of blue eyes on Rainbow High dolls that I always get excited when I see a doll with brown eyes. Laurel’s eyes are a little more hazel, but honestly I’ll take what I can get.", 

"262": "Bella Parker was a part of the second series of signature Rainbow High dolls and the first pink themed doll. She is an Art Direction focus (basically a set builder) and she’s probably poking fun at Barbie. In the cartoon (which I won’t make you watch, don’t worry Jonah), she is one of the original members of the series 1 runway group, but she gets expelled from Rainbow High for taking pictures of one of her projects to submit into an internship contest. It doesn’t really make sense. Bella is replaced by Amaya Raine (the rainbow-themed character), but she later returns. She doesn’t do much after that but she does win a trip to Rainbow High’s sister school Pacific Coast. It was acceptable this time because the school ran the contest. See my Pacific Coast dolls for more information about that failed spin off. Bella is hinted to be queer and is frequently shipped with series 1’s Jade Hunter. I have an earlier version of this doll where she has limited neck articulation and a comically shiny face. The picture I took was the best that she could possibly look. Also, my doll came without the waist piece to her stand so I had to borrow Skyler’s for the picture. This was just a factory error that really upset me at first but I don’t really care now. I think this doll is very pretty and she has really soft hair. I think her clothes are just ok, but I’m not much of a light academia girlie so it’s not really for me. Unfortunately, the excess highlight on her face looks so horrible that her face looks ridiculous.", 

"263": "Krystal Bailey was the purple doll released as part of series 2. She is also the first Rainbow High doll to have really dark Black skin. She was initially going to have a medium skin tone, which was similar to Karma Nichols (also from series 2) but a little darker, but consumers criticized the lack of diversity in skin tones and the lack of darker skinned Black dolls. She was also originally named Jett Dawson, this change was so last-minute that some of the doll boxes have the name Jett Dawson printed at the top, covered with a sticker that has the correct name. In the Rainbow High cannon, Krystal is a Journalism focus and is the editor-in-chief of the school magazine. She also teaches a journalism class for some reason, I guess she’s just that good. Honestly, Krystal was done so dirty because this outfit is hideous. The color scheme is indigo, so she is closer to blue than purple but I still consider her under the purple umbrella. I don’t understand fashion at all, but Krystal’s jacket looks silly to me. The fabric of her shirt is a stiff material that is honestly a horrible sensory experience. Her headband refuses to stay on most of the time, but I do appreciate that the faux ribbon part is detachable. I really like Krystal’s makeup. I’m so glad I have Krystal’s Junior High doll because she finally got the love this beautiful doll deserved.", 

"264": "Emi is one of the Rainbow High dolls where I prefer her second outfit significantly more than her first. Emi Vanda’s first outfit commits one of the biggest fashion crimes in my opinion, because her sweatshirt features a printed on (well it’s sewn but you get what I mean) accessories, in this case a purse, rather than the physical separate accessory. Even worse, it’s asymmetrical. Disgusting. I’m sure the sewn-on purse was for fashion reasons rather than budgetary reasons (that would be the case with Barbie), but I still hate it. There are also fake undone zippers on the shoulders that looks silly. Other than the sweatshirt, I really like everything else about this doll. I think her skirt and boots are cute, but most importantly the base doll is absolutely gorgeous. I absolutely adore her hair blend, but my doll is a bit sparsely rooted so I have to strategically hide the bald spots. Emi doesn’t do much in the show other than be a little quirky and accidentally use coffee for her watercolor painting. She is a visual Arts focus, but other than her little quirky girl moment we don’t see much of that. I forgot to add that she is the purple doll from series 3 but you probably could have guessed that from the picture. Later on, I also got a second Emi doll in the rerelease 4-pack. She’s the one wearing her second outfit. My second Emi is much nicer, her hair rooting is much fuller and her inner corner eyeshadow is more even. I would make her the main Emi but her shoes have a super irritating and complicated ribbon that I don’t want to undo.",  

"263": "The yellow doll from series 3 of Rainbow High is very obviously inspired by Cher from Clueless. I have only seen parts of that movie if I'm being honest. Interestingly, there were a line of Clueless dolls made by Mattel but they were based on the television series rather than the movie. Originally, Sheryl was a background character and her outfit was just a color-swap of Bella Parker’s outfit and her hair was brown and in a high ponytail. The actually released outfit for Sheryl is much better in my opinion. Her second outfit is also very chic but I wish she came with pants rather than a skirt. It is a cute skirt though. Once she became her own character, it was revealed that Sheryl is a Textile Design focus and the heir to a lemon fortune which is honestly so slayful. I customized my doll to have blue eyes because I went through a mini phase and it did not go very well so her makeup and eyelashes are all messed up. This doll is so beautiful and I wish I kept her brown eyes because they look so much better than the blue ones I gave her. I also scratched one of the eyes so it looks very asymmetrical. This happened when I customized this doll, I’ve recurled (at this point, my cat Sirius sat on my laptop and added his own opinion of Sheryl. Jonah said I could keep it in.)-p[0≥≥≥≥≥≥≥≥≥≥≥≥≥≥≥≥≥≥≥≥≥≥≥≥≥≥≥A	X @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (back to Danny now) her hair multiple times and it took two different techniques for me to finally be happy with it. She still looks gorgeous, but this doll taught me the harsh lesson that I am not good at doll customization, and I should not do it again.", 

"266": "Winter Break is a weird line that features the series 1 characters in winter gear. The dolls come with either skis or a snowboard and one pair of ice skates. Violet is one of the skiers. I think this is one of the most beautiful Violet dolls and I love her makeup. One of my favorite details is that her earrings also click into the sides of her earmuffs because that is so campy and cute. I have two of these dolls because my first one has a faulty leg joint, and I got the second one on sale. The doll on the left with the curlier hair and skis is my second doll and she wears the first outfit. I love it very much; my only complaint is that the studs fall off the jacket easily. My second doll has lost some of her hair after a couple boil washes. I did accidentally damage her hair a bit because I left her in the bowl while on face time with my grandma. I was able to fix it but unfortunately Violet lost her curl. I don’t like the jacket on her second outfit at first, and the studs are also frequently falling off of that too. Her second skirt is also a bit thin but it’s also very cute. This was the first non-signature Rainbow High doll I got. This doll is extra special because my sister got her for me which was really really sweet of her. Even though she has multiple flaws I will always treasure this doll because my sister was so kind to get her for me.", 

"269": "The first series of Junior High dolls features the series 1 characters reimagined as their middle school selves. I’m not sure why this is so drastically different from their series 1 dolls because they are supposed to be high school freshman. To be fair, my style changed a lot throughout middle school but it still feels silly. Regardless of plot holes in the lore, I am obsessed with this doll. It’s also important to note that the Junior High dolls are slightly smaller to accommodate for the fact that the characters are supposed to be younger. Their joints are slightly better and she can articulate slightly further. They also do not come with stands which is unfortunate but I guess MGA would have to scale them down so it’s probably a cost issue. A lot of people call these dolls \"ankle biters\" and I kind of see it but I still really like this doll. Violet is so cute and her outfit is adorable. It is very obviously inspired by Britney Spears in the \"…Baby One More Time\" music video but with a purple color scheme. Violet’s skirt is a little big on her but it fits the full-sized dolls very well. I love each and every piece of this doll.", 

"270": "The Junior High version of Krystal improves on the Series 2 doll in each and every way it was needed. For a start, this doll is the first female Rainbow High doll to have textured hair. Krystal also finally has edges, which were absent in Series 2. She also has fabric boots which I adore. Unfortunately, the pleather material is going to eventually peel over time but I can enjoy it now. This doll is so cute and she is definitely more unmistakably purple than her Series 2 doll. The only thing I don’t like about this doll is her top but that’s definitely a my fashion preferences rather than anything legitimate.", 

"271": "Pacific Coast was an attempted spin-off of Rainbow High that featured characters who went to a beach-side school in California. There was only the first series released at the time of writing this. Additionally, pre-existing character Bella Parker (from Series 2 of the Signature line) was included, and this was explained away with plot reasons that honestly don’t make sense if you think too much about it. Margot is (shockingly) themed after pearls and she seems to be an astrology girlie. I’m not much of an astrology girlie myself so I don’t have anything to say about that. Margot has a weird spiritual connection to Paris Hilton (who is of course the headmistress of Pacific Coast High) at one point that I did not understand. For whatever reason (and this is immediately dropped in the Rainbow High cartoon), Pacific Coast High has a weird reality show that Margot and the other Pacific Coast dolls (minus Bella) star on for whatever reason. I consider Margot a purple doll because her hair is mainly purple shades even though I know it’s supposed to be pearlescent. This is probably me being delusional and trying to justify this gorgina doll but I don’t care. I think Margot is stunning. Her face card never declines and I’m obsessed with just staring at her. I don’t really understand her head scarf and honestly it really annoys me because it never stays on (I despise those tiny plastic t-shaped tabs so I remove them immediately upon opening a doll), but I know it is a designer fashion reference.", 

"272": "Phaedra has a unique color scheme because rather than just one color she’s themed after a sunset. That’s why her last name is Westward, because the sun sets in the west. Ha Ha. Anyway, Phaedra is a makeup focus who calls herself a girlboss unironically. If she wasn’t so beautiful I would hold that against her. I love her cute little ponytails with the gold scrunchies, but if it was my choice they would be purple. While I wish her entire outfit was purple, I guess the other colors look good too. I think my favorite piece is her visor because it’s so cute and the elastic is really high quality. I also really love Phaedra’s eye color. I think she is absolutely gorgina.", 

"336": "The Rainbow Divas were finalists in Rainbow Vision, they were a girl group that broke up by the end because the other two members hated Sabrina for no reason. I told you this season was awful. Sabrina performed a solo at the end but the divas were still disqualified. Sabrina’s color scheme is a champagne pink or rose gold, and she looks absolutely stunning. Her eyes are a gorgeous shade of green that really pop. She wears a trumpet gown that suffers from the sin of high-low cut but it doesn’t bother me that much. The sequins are always falling off which is annoying. Sabrina (along with the other Divas) came with a makeup cady and various makeup accessories that are so cute, but after this line the pieces were reused far too many times. This doll’s second outfit is also very cute, it feels like an elevated version of something Bella Parker from Series 2 would wear.", 

"413": "Tessa is the tomboy leaning towards butch member of the Royal Three, the K-pop band that (spoilers) wins Rainbow Vision. Tessa appears to be a rapper and she has a weird romance with one of the other competitors that gets dropped immediately. Tessa’s outfit is very unique, featuring a detailed embroidered jacket and a pair of boxers in her second outfit (that’s how Jonah knows this doll). Tessa’s outfit features asymmetrical pants that honestly don’t seem that comfortable but they are very fashionable. My doll’s bangs refuse to cooperate so I apologize for their state in the picture. Honestly, I very much prefer the purple tones of Tiara from her line, but Tessa is still a gorgeous purple girl. Her makeup is stunning and I think she is a beautiful doll. I just don’t really understand the fashion of either of her outfits, but I still appreciate them.", 

"326": "I think Tiara Song wears my favorite shade of purple, which is my favorite color (I’m sure you’ve noticed looking at my Rainbow High collection). She was released as part of the Rainbow Vision line in the Royal Three subline (I’m not sure if that’s a word). The Royal Three is a K-pop girl group that wins Rainbow Vision (a very poorly executed Eurovision parody) in season 3 of Rainbow High. I think this doll is almost flawless. I absolutely adore her first outfit, and I can appreciate her second outfit even though it’s definitely not for me. However, I broke one of her bracelets almost immediately after taking her out of the box. In my defense they are very small and fragile. Luckily, I can easily hide the broken bracelet with her jacket sleeve. I think this is one of my favorite Rainbow High dolls entirely because she is themed after my favorite shade of purple.",   

"267": "The costume ball line was a very weird part of Rainbow Vision that seemed more like shoehorning in a Halloween release. This character appears in just one episode of the cartoon, so the only thing I know about her personality is that she takes dressing up as a vampire way too seriously. In this instance, she dresses up as one to compete in a costume contest that pits Rainbow and Shadow high against each other which half the characters treat as a huge deal. Everyone else doesn’t care and is just having fun but this still feels like a huge waste of time. Regardless, this doll is absolutely stunning and gorgina. I love love love her outfit, it’s very vampire but also fashion. I’m not really goth or alt or anything adjacent to that so I can’t judge whether it is accurate to any subculture or not, but I still think it looks stunning. I consider this doll purple themed so she is part of my purple collection and she holds such a unique place on the shelf. Her hands have a special mold where she has long acrylic nails and molded-on rings. I love this doll very much.", 

"268": "This doll is very silly and is giving low effort Halloween costume. See Demi Batista from the same line for a description of the \"lore\". Violet is supposed to be a cat but she’s literally just wearing a feather boa and a mask. I don’t care at all though because I think she is gorgeous. This doll was one of the first to have a modified original mold, and combined with her cat-themed makeup, Violet looks stunning. Violet’s color scheme is one of my favorite shades of purple where it almost looks pink and I love her so much. My doll has one flaw, where the nail polish is chipped on one hand but that is easy to hide. She had the long acrylic nails that are so cute. Most people seem to be underwhelmed with this doll but I adore her.", 

"273": "I think the Lila is one of my favorite purple Rainbow High dolls. I think she is one of the most beautiful dolls in my collection. The only problem is that I am terrified of ruining her hairstyle, so I don’t touch this doll so much. Lila is a Visual Arts focus. When this doll was first leaked, there was criticism because Lila has a Japanese last name but her second outfit comes from traditional Chinese culture. MGA quickly damage controlled by canonizing that Lila’s mother is Chinese and her father is Japanese. This could totally be the original intent, but I have no idea. Anyway, this doll is stunning. My favorite part of Lila is her shoes because they are platform crocs. You can even put them into sports mode; it’s so cute. I also adore her cherry blossom earrings, but they do tend to fall out. The only thing I don’t like about this doll is the band-aid on her nose because I get anxious about nose pain/injuries (for whatever reason this irrational anxiety did not extend to my nose piercing). My Lila doll has the slightest pinprick on one of her cheeks, she came like that in the box. I don’t mind that much because her face is otherwise perfect.", 

"274": "I still cannot decide which of the Storm twins are my favorite. I think they are both so pretty and I have literally no complaints. Veronica and Naomi are essentially the Shadow High equivalent of Laurel and Holly. Veronica seems to also be inspired by the movie \"Heathers\" which I love very much. The Storm twins were the first Rainbow High dolls to have acrylic nails, and they even feature multiple colors for added detail. These dolls were also the first to feature the molded rings and I really appreciate them. As someone who is mourning the loss of many of my Ever After High rings, I am so glad that I will never have to worry about that with Rainbow High. Veronica is an experimental doll because she has bubble gum protruding (I’m writing this during a crying episode, I’m sorry I’m not very articulate right now) from her mouth. It doesn’t really work because you can’t take the gum out, so Veronica permanently has this weird pink orb covering her lips. I’m not that bothered because it’s still very unique. I love Veronica’s outfit, especially the feathers on her jacket, it’s so cute. I also love her pleather knee-high socks with the heels. It’s so cute but also chic. The pops of color such as the pink of her nails really bring the fit together.",  

"275": "Naomi is in my opinion slightly prettier than her sister, but I still don’t have a favorite. It’s not fair because I can see her entire face which gives Naomi an advantage. The quality of Naomi’s clothes are so high (as are her sister’s), and the ensemble is very cohesive. My favorite piece to this doll is her fabric boots. They are a lot easier to put on and take off than I originally thought and I just really like the feel of them. Naomi’s makeup is flawless and I love everything about it. I literally have nothing negative to say about this doll. Honestly I don’t appreciate her enough.", 

"276": "This doll is so wonky I’m honestly so embarrassed. If you look at her eye makeup, one eye has much thicker black liner than the other. Ainsley is also one of the only dolls I deliberately did not put in her original outfit because I hate it so much. I just really don’t like asymmetrical clothes, I think it’s a weird sensory issue. In the show, Ainsley used to be a prefect at Rainbow High and was part of the As clique with Avery and Aiden but she decided to transfer to Shadow High. She seems to be the only Shadow High student to not wear full body paint makeup. It is not addressed. I really like what this doll is supposed to look like, and I love her Shadow High version of her outfit (that she is wearing in her picture). This doll had so much gel in her hair when I got her, it took two hair washes to get it out. I consider this doll a purple girl because her hair is very very dark purple but I’m not dedicated to fighting that argument.", 

"277": "Series 2 of Shadow High featured three purple-themed dolls (in my opinion), and this doll is by far my favorite. Monique is a Fashion Design focus (it feels like they all are at this point) that was introduced in the Project Rainbow arc of the cartoon. This doll is absolutely flawless. I love each and every aspect of her. I literally have zero complaints. I don’t even care that she doesn’t come with a second outfit or that her accessories are just recolored old pieces because she is that stunning. I love love love her makeup, hair and dress. Her earrings are also really cute little flowers. I think my favorite part of this doll is her shoes because I love when heels flare out like that. Monique is just perfect and she gets to stay in the front of my display.",  

"341": "Series 5 was the first main series of Rainbow High to come without a second outfit. Series 2 of Shadow High was released like this first, but I was still grumpy. This was for budgetary reasons and in it’s place were repackaged accessories from previous playsets. Victoria came with the sewing machine, hair dryer, eyeshadow palette, and a phone (with a removable case). She also came with hangers but there’s no point because she didn’t come with any clothes to put on them. Victoria is a Fashion & Accessory Design focus, and she is originally from Australia. I think Victoria is the most unique doll in series 5 and one of the most unique Rainbow High dolls at the time of her release. She has full-body freckles and body blushing, which is a. technique usually used on high-end art dolls or ball-jointed dolls. It essentially brings more life to the doll by putting blush throughout their body. Victoria is one of the two pink dolls released in series 5. Usually, I prioritize the purple dolls in a line, but there isn’t really a purple doll in series 5. Aiden is technically considered the purple doll but he’s a lot more holo in my opinion (I will still get him eventually; I just wasn’t ready to get my first boy doll yet). Victoria is breathtakingly beautiful, I am absolutely obsessed with her makeup, especially her lips. My favorite part of this doll is her earrings, they look like cute little umbrellas or some sort of flower. I’m not exactly sure. One thing I absolutely hate about this doll is her shoes. They are the wrong color and they do not fit her well. If it wasn’t for the strap (that I also dislike because it is nearly impossible to put those kinds of Rainbow High shoes on without breaking them), they would be constantly falling off. I wonder if Victoria was originally supposed to come with some cute little lacy socks. Hopefully they would’ve been the right color.",  

"476": "Neon Shadow was Shadow High’s main contribution to Rainbow Vision. Not going to lie, their song slaps. Anyway, Uma is the guitar player. I held off on buying this doll for a while because she’s technically a blue doll but she pulls too purple for me to ignore. I think I asked everyone I knew if they considered her blue or purple, to mixed results. Her hair is absolutely purple but her clothes are blue so it’s confusing. I found this doll on a really good sale one day when I was really in the mood to buy new dolls. Uma has a very interesting outfit. I love her shirts even though one of them is mostly sequins, I’m able to avoid touching it much. The pants are very Bratz Pretty N Punk which I love. It’s a very interesting and unique design. The ribbon chain stresses me out a bit because I’m not sure how much it would impede walking but it looks really slay. I also love the hat even though the faux leather will eventually peel. My only complaint about this doll is that her first pair of shoes do not want to stay on which is irritating but I can deal with it.", 

"477": "I went back and forth deciding if this doll counts as a purple girl or not, and I’m so glad I decided she was because she’s a really unique piece in my collection. Dia is yet another fashion design focus that comes in last place in the Project Rainbow competition. Her outfit is heavily inspired by Rihanna. I’m not sure why they decided to give her purple skin (I’m pretty sure the Shadow High characters are wearing body makeup but I’m not sure). The clothes are all really nice quality pieces and I really love that the body suit has a purple tint to it, justifying my purchase. The one thing I’m a little unsure about with this doll is her stylish bob. It looks a little silly, especially when it still had the gel in it (as you can see in the picture). Funny story about stylish bobs, I impulsively asked Jonah to cut my hair recently (don’t worry about it) and my only direction to him was please do not give me a stylish bob. He honestly did an amazing job so I’m not complaining here but this doll reminds me of what could’ve been if Jonah decided to be mean to me. Dia is kinda the worst in the Rainbow High cartoon so I don’t feel bad about the association.", 

"472": "Daria is the pink doll in series 3 of Rainbow High. She’s a songwriter but like most of the dolls in series 3, she doesn’t do much after her initial appearance. The song she writes in her episode is not very good. I got this doll in a 4-pack rerelease that featured two dolls from Rainbow High series 3 and two dolls from Shadow High series 1, all in their second outfits. I don’t mind that because I prefer Daria’s second outfit to her first, she looks like a mean office worker that slays. The embroidery is a little weird but that’s ok. The shoes are such a subtle slay I love it. Her hair blend is also really pretty. I don’t feel that connected or interested in Daria as a character but she’s so beautiful I don’t care. I’m not that much of a floral girlie but the roses are very aesthetically pretty.", 

"474": "Shadow High is the first spin-off line of Rainbow High, first debuting entirely in grayscale for the first series. I’m not sure if it sold well because the grayscale gimmick was dropped immediately. Instead, the dolls have fantasy skin tones. Anyway, this doll is the second-lightest doll in the spectrum. Heather is very e-girl and honestly I thought I’d like her a lot more than I do. I’m not that into split-dye hair and the extensions are a little weird and I don’t get it but other people seem to. I got this doll in the rerelease 4-pack I’ve mentioned before, so she’s wearing her second outfit. I prefer her second outfit to her first so I don’t mind. Her pants have real pockets which is very slay. The shoes are so gorgina. Heather has a snakeskin motif which is honestly not what I expected. Heather is a special effects makeup focus which is unfortunate because my doll has pretty messed up face paint. Her lips are the worst, there’s a spot missing from her top lip. I don’t like her lip stick anyway because they’re this weird glitter shade. I expected to like her eye makeup a lot more than I did, I think the white under her eyes looks really weird and doesn’t translate well to the doll. That’s a huge bummer because I love how that looks in person. The glitter in her eyebrows are also very weird and uneven but I think that’s an interesting concept. I don’t envision trying glitter eyebrows out myself but I respect anyone who does.", 

"475": "See Shadow High Series 1 Heather Grayson for an explanation of the origins of Shadow High. Natasha is from Amsterdam which is interesting, I believe that makes her the first non-American character in the Rainbow High series. She is a cosmetic chemistry focus, which just means that she makes perfume. For some reason, she also competed in Rainbow Vision and sang this super slayful song that was just a commercial for her perfume I’m pretty sure. Natasha is the stark white or \"dove\" themed doll which I thought was really interesting. I only have her second outfit but I like it more than her main look. I’m pretty sure this was the first appearance of the fabric boots, and unfortunately the glitter does shed a bit but it looks so so good. Natasha is really really beautiful and I’m so glad to have her in my collection. Her makeup is stunning, I especially love her lip combo. She’s a true stand-out.", 

"478": "So once again I’m in the minority here with my Rainbow High opinions because everyone seems to hate this doll but I love her. Fantastic Fashion was released alongside the Project Rainbow season of the Rainbow High web show, even though the outfits were from season one. In the original cartoon, all of the looks had a reveal except for Skyler but that’s not replicable on a children’s toy so they just have the final look. Is Violet’s look technically the worst? Yes. But I still love her and think she’s stunning. I must admit Poppy is my favorite in the line but I still prioritize purple dolls and I’m definitely not making an excuse for the fact that Poppy was sold out. Anyway, this dress is giving flapper Halloween costume with the weird feather things and it looks very silly but I think it’s cute. Honestly, the hair and shoes are way too good for this dress. I think it should be a gown personally. The second outfit is cute but I wish it came with a second pair of shoes. I don’t understand why she (and the rest of the dolls) came with the little sketch of their design because canonically, only Skyler and Amaya designed the outfits so they should come with something pertaining to their own focus. I guess Violet would come with a phone which is pretty lame. Even though I’m complaining, I do appreciate the new molded accessory because Rainbow High loves to reuse accessory molds. Overall, people are too mean to this doll and nobody gets her like I do.", 

"479": "Lavender Lynn is a photography focus at Shadow High. She’s the purple doll in Series 3, but Shadow High seems to be less committed to including all of the colors equally. Because of course she is, Lavender is from Minneapolis but she’s obsessed with going to Paris. She’s even wearing a beret because she’s real annoying about it. However, she’s also an emo gworl so her beret has spikes on it. Even though I’m poking fun at her hat, this doll is stunning and her outfit is so slayful. The heels of her shoes are so gorgina. I love unconventional heels so much. I also really love her dress because it’s a little cottage core, but I wish it was all the same color like the illustration. The teacup is very cute but like where’s the rest of the tea set? Not only can’t she share but she doesn’t have a tea pot so it’s not very practical. I don’t really care that much but when Ever After High had a tea line the dolls came with two teacups and a teapot each all themed to their character with different molds just sayin. Anyway, I love her extremely long hair, it's so beautiful. Her glasses are cute too but I wish they were purple. They unfortunately left little dents on her nose which I’m obviously not thrilled about. My glasses are pink so it’s not like it’s unrealistic.", 

"469": "See Cheer Violet Willow for an explanation of the Cheer line. Jade is serving butch cheerleader here. Like she’s wearing flat sneakers while the rest of the girls are wearing impractical heels. It’s not very slay but it’s very practical. I got this doll used so I’m missing most of her hair clips. I like her makeup but it’s not that special. I don’t know anything about football and even though he’s sitting right next to me as I type this I’m too embarrassed to ask Jonah (again) so I don’t know if there’s an Eagles reference here. The face paint is interesting but I don’t know if it means anything significant.", 

"470": "See Cheer Violet Willow for lore about this line. This doll was originally sold with a misprint, calling her \"Skylar Bradshaw\". I got her used so I don’t know if she had a misprinted box. In 20 years people will try to scam me into paying $200 for this doll with the misprinted box. It’s happened to me twice with Happy Holidays Barbie 1997 which is hilarious because she’s literally everywhere and all my doll boxes all go in the trash. Anyway, I was thrilled to find this doll because an eye-swapping incident broke my other Skyler doll and now she only has one working eye socket. This doll’s face and hair are flawless but unfortunately her outfit is not very good. The string ties are all frayed which is not a good look. Also the rubber band holding her hairbow is no more. I don’t care that much, I’m just happy to have a displayable Skyler doll.", 

"473": "Kia Heart was a weird Valentine’s Day special release. I usually don’t really like Valentines Day releases because that holiday should be about celebrating me and how fabulous I am rather than anyone else. I got her used so I’m missing many of her pieces but her face is the main character here. I love her hair blend of pink with all the different colors. I think she definitely would look better with a different face mold but I don’t feel that strongly about it. By the way, Kia is pronounced the same as Kaya the American Girl doll, not like the car. I get confused too. The fashion of this doll is definitely not for me, as it’s not \"cottage core\" (according to Jonah) or man-who-just-got-out-of-bed. I just don’t feel qualified to give an opinion whether or not it’s good. In the show Kia runs the school’s café and is the school matchmaker (platonic, creative/professional, and romantic) but she doesn’t get a lot of focus.", 

"471": "So this doll was supposed to by Violet Willow’s rival as a social media influencer but MGA forgot and so did I. Karma as a base doll is one of the best, like her eyeliner is so good and it’s one of the few times I wish I could adequately do eyeliner. HOWEVER, this outfit is HORRIBLE. The neon green looks like vomit highlighter and the outfit itself is so ugly I hate it!!!!! I got this doll used so I don’t have her first pair of shoes or socks but that doesn’t make that much of a difference. Karma deserved so much better because she’s so beautiful and for a while she was the only Indian American character. Like most of the characters, she gets little attention in favor of the Series 1 characters which I think is a crime.", 

"468": "Amaya is a weird character because she was introduced as a replacement for Bella Parker after she got arbitrarily expelled from Rainbow High (temporarily). Amaya is supposed to be the rainbow-themed doll but her Series 2 doll has mostly blue hair and a lot of people say she looks like a clown. This doll I classified as Series Special but like Avery Styles, she was more of an extension of Series 1. This is also a hairplay gimmick doll and originally came with glitter gel for her hair that her previous owner thankfully did not use because I’ve heard it stains. Obviously, I got her second-hand so she is stuck wearing Series 2 Amaya’s second outfit but her original boots. I must say the previous owner slayed with the fit I found her in at the thrift store but I had to make it as Amaya-y as possible for the picture. This doll suffers from the Series 1 shiney face but her hair is very pretty."

}]